{"title": "Breads", "recipes": [{"id": "CN8M", "title": "'Everything Bagel' Cauliflower Rolls", "image": "https://images.yumprint.com/p1yumprintvw/vWwym9AsiGtpVGvqBbtKrTFfGFami8dho1-7TZL7jXofCQcq1HdaRsWdjjxVoMcn", "link": "http://lexiscleankitchen.com/2013/07/30/everything-bagel-cauliflower-rolls/", "ingredients": ["1/2 teaspoon poppy seeds", "1 tablespoon sesame seeds (black and white)", "1 teaspoon dried minced garlic", "1 tablespoon dried minced onion", "1/2 teaspoon coarse sea salt"], "directions": ["Preheat oven to 400°F and line a baking sheet.", "In a food processor, or using a hand grater, pulse/grate cauliflower until rice consistency.", "In a bowl combine eggs, cauliflower rice, almond flour, coconut flour, garlic powder, and salt,", "In a separate bowl combine \"everything\" topping ingredients.", "Roll cauliflower mixture into even sized balls and lay onto the baking sheet. Sprinkle \"everything\" topping and slightly press them into the top,", "Bake for about 30 minutes, or until golden brown.", "Optional: For extra crisp rolls, remove from baking sheet and broil on high for 3 minutes with the buns directly on the oven rack.", "Remove from baking sheet and let cool directly on a cooling rack.", "Serve as rolls with your meal, or serve as bread with your favorite sandwich ingredients."]}, {"id": "AAox", "title": "118", "image": "https://images.yumprint.com/p1yumprintjx/jX8YE-7nfEEcQ8OUmBF6S6IygikDHBjDmCBv_K3vkmOvshOyobl0x-A8SqIXLqEY", "link": "http://www.itsalwaysautumn.com/2016/02/12/homemade-artisan-bread-easiest-bread-recipe-ever.html", "ingredients": ["3 cups white flour", "1 teaspoon salt", "1/2 teaspoon yeast", "1.5 cups of warm water"], "directions": ["Mix everything in a bowl.", "Use a wooden spoon and just mix until everything’s combined, probably less than a minute. No kneading, and no worries it if looks like a shaggy mess. It’s ok.", "Cover with plastic wrap and leave at room temperature for 8-24 hours. It will get all bubbly.", "About 90 minutes before you’d like to serve it, turn the dough out onto a well-floured surface. Form it into a ball (as shown in the video), and let it rest for 30 minutes.", "In the meantime, turn on the oven to 450 degrees and put whatever dish you’ll cook it in inside the oven to preheat. You can use a dutch oven, or the crock from your slow-cooker (that’s what I use), or a casserole dish with high sides, or an oven safe pot…pretty much anything that’s oven safe and has high sides will work. NOTE: A reader has let me know that her crock cracked from the heat in the oven. I have used mine multiple times and it has been fine, but I’d hate for anyone to ruin their crock on my advice! So use a crock at your own risk.", "After dough has rested and oven has preheated 30 minutes, use a sharp knife to slash an X across the top of the dough. Spray your baking dish with nonstick spray, pick up the dough with floured hands, and plop it in. Cover the dish with a lid or aluminum foil, and put it in the oven.", "Bake covered for 30 minutes, then uncover and bake 10-15 minutes more until top is nicely browned.", "I like to let it cool for at least 15 minutes before I slice it so it doesn’t squish. If you have an electric knife you may be able to cut it sooner; and if you don’t have a sharp serrated knife you might want to wait even longer. It’ll be worth it, I promise!"]}, {"id": "J8TI", "title": "Almond Flour Butternut & Bacon Biscuits", "image": null, "link": "https://www.vitacost.com/blog/cooking-recipe/almond-flour-biscuits-recipe.html?fbclid=IwAR3RPo1AVj3NeGkXjuscXeA9UyBpY-L5dHl2xATYk1Fw-J8F9g3wivlE6u8#comments", "ingredients": ["2-1/2 c Bob’s Red Mill Super-Fine Almond Flour", "3 Tbsp. Nutiva Organic Coconut Flour", "1 med butternut squash (roughly 1 cup cooked)", "1/4 c  Organic Coconut Oil or ghee, melted", "6 slices cooked bacon, crumbled", "2 eggs", "1 tsp. Vitacost Organic Apple Cider Vinegar", "1 tsp. Pamela’s Gluten-Free Baking Powder", "1/2 tsp. salt"], "directions": ["Preheat oven to 400 degrees F. Place towel underneath cutting board to stabilize, cut squash lengthwise and de-seed.", "Line pan with parchment paper. Liberally coat squash with oil and place flesh-side down on pan. Pierce with fork and bake 30-35 minutes, or until tender.", "Remove squash from oven and set aside to cool. Scoop flesh into food processor, add wet ingredients and pulse until combined.", "In small bowl, combine dry ingredients. Spoon half dry mixture into food processor and pulse a few times. Add remaining dry mixture and process until combined, scooping down sides of bowl if needed.", "Add bacon and pulse a few times or mix in with spoon.", "Line baking sheet with parchment paper. Scoop about 2 heaping tablespoons of mixture into hands and roll into 12 equal balls.", "Place onto baking sheet a few inches apart. Using hands, lightly flatten balls to form biscuits.", "Bake 20-25 minutes or until inserted toothpick comes out clean."]}, {"id": "xaht", "title": "Asiago, Artichoke & Spinach Soufflé", "image": "https://images.yumprint.com/p1yumprint3t/3tCZ52Vg2zWypw8YDTF0aeqRYW3nxR9LWJI-rBgnwWHSpN--HrpWvvLiR7R8FKeO", "link": "http://www.eatingwell.com/recipes/artichoke_souffle.html?socsrc=ewfb0221164", "ingredients": ["3 tablespoons fine, dry breadcrumbs", "1 14-ounce can artichoke bottoms, drained", "4 ounces (about 1 1/4 cups) chopped frozen spinach, thawed", "1 cup finely shredded Asiago or Parmesan cheese", "1/2 teaspoon freshly ground pepper", "1 1/2 cups low-fat milk", "2 tablespoons unsalted butter", "2 tablespoons canola oil", "1/4 cup white whole-wheat flour (see Tips) or all-purpose flour", "4 large egg yolks, at room temperature (see Tips)", "8 large egg whites, at room temperature (see Tips)", "1/8 teaspoon salt"], "directions": ["Position rack in lower third of oven; preheat to 375°F. Coat eight 10-ounce ramekins or a 2 1/2-quart soufflé dish (or similar-size baking dish) with cooking spray. Sprinkle with enough breadcrumbs to generously coat the inside, tilting to evenly distribute; tap out excess. Place ramekins on a baking sheet.", "Pat artichoke bottoms dry, chop and then pat dry again. Press thawed spinach in a fine sieve until very dry, then finely chop. Combine the chopped artichoke and spinach in a bowl with Asiago (or Parmesan) and pepper.", "Heat milk in a small saucepan over medium heat until steaming. Melt butter and oil in a medium saucepan over medium-low heat. Whisk in flour and cook, whisking, for 2 minutes. Slowly whisk in the hot milk and cook over medium-low heat, whisking, until the mixture is the consistency of thick batter, 2 to 4 minutes. Transfer to a large bowl. Whisk in egg yolks, one at a time, until incorporated. Whisk in the artichoke-spinach mixture.", "Clean and dry a large mixing bowl and beaters, making sure there are no traces of oil. (Any fat in your egg whites may prevent your soufflé from rising properly.) Beat egg whites in the bowl with an electric mixer on medium speed until foamy. Add salt; gradually increase speed to high and beat until shiny and stiff, but not dry. Do not overbeat: stop when the egg whites hold their shape in the bowl and on the beater but don’t look overly dry or lumpy.", "Using a rubber spatula, stir one-third of the whites into the egg-yolk mixture to lighten it. Gently fold in the remaining egg whites just until evenly distributed. It’s OK if a few white streaks remain. Spoon the batter into the prepared dish(es).", "Bake until puffed and firm to the touch, 20 to 24 minutes for 10-ounce soufflés, 38 to 42 minutes for a 2 1/2-quart soufflé. (Resist the temptation to take a peek until the last 5 minutes of baking—an open oven door will let in too much cool air and may interrupt the rising.) Once out of the oven, even a beautifully puffed soufflé will slowly deflate, so go directly to the table to show off its beauty, then serve it at once.", "Make Ahead Tip: Prepare through Step 3, cover and refrigerate for up to 1 day. Bring to room temperature before folding in egg whites. Equipment: Eight 10-ounce ramekins or a 2 1/2-quart soufflé dish", "Room-temperature egg whites will gain more volume when beaten and help your soufflé rise. To bring eggs to room temperature before separating the yolks from the whites, set the eggs out on the counter for 15 minutes or submerge (in the shell) in a bowl of lukewarm (not hot) water for 5 minutes."]}, {"id": "rJ30", "title": "Banana Oat Bread", "image": "https://images.yumprint.com/p1yumprintxd/xDbjUM-gs-JxZtMeokxYUucdaZ3VI_nBqohfKkm2IZfFF5rPncF1yIv5LowjAlDQ", "link": "http://bethanysrecipes.blogspot.com/2010/05/banana-oatmeal-bread.html", "ingredients": ["1 cup of flour", "1/2 cup of whole wheat flour", "1/3 cup of white sugar", "1/3 cup of brown sugar", "1 1/2 tsp baking powder", "1/4 tsp baking soda", "1/4 tsp salt", "1 1/2 tsp cinnamon", "3/4 cups quick cooking oats", "2 small, very ripe bananas, mashed", "1/3 cup of low fat buttermilk", "1/4 cup of canola oil", "1 1/4 tsp vanilla", "2 eggs, beaten"], "directions": ["Preheat the oven to 350 degrees. Coat a loaf pan with cooking spray.", "Combine all the dry ingredients together and mix well. Combine the banana, buttermilk, oil, vanilla, and eggs together until mixed thoroughly. Slowly add the dry ingredients to the wet ingredients until well combined. Pour the batter into the loaf pan.", "Place into the oven and bake for 45-55 minutes or until a tester inserted in the middle of the loaf comes out clean. Let the bread cool for 10 minutes before removing from the pan and placing on a cooling rack for a few more minutes. Slice and slather with butter if desired. Enjoy."]}, {"id": "p-Z7", "title": "Banana Zucchini Bread", "image": "https://images.yumprint.com/p1yumprintzo/ZoP1C4pUPm_Nz29l3eKb6UUF93SYTK2ZePTrKr25aQ3YzFKBqg2M_Ct6zvsLMCk0", "link": "http://www.food.com/recipe/banana-zucchini-bread-96994", "ingredients": ["3 eggs", "1 cup vegetable oil", "1 1⁄2 cups sugar", "2 cups flour", "1⁄4 teaspoon baking powder", "1 teaspoon baking soda", "2 teaspoons ground cinnamon", "1 teaspoon salt", "2 teaspoons vanilla extract", "1 cup chopped pecans", "1 cup raw zucchini, shredded", "1 cup mashed ripe banana"], "directions": ["In large mixing bowl, beat eggs, sugar and oil together.", "Add flour, baking powder, baking soda, cinnamon, salt, vanilla and nuts.", "Mix together.", "Add zucchini and bananas and continue to mix until blended.", "Pour into 2 greased and floured loaf pans.", "Bake in 350 degree oven for 45-55 minutes or till tests done in center with toothpick.", "Remove to wire rack and cool for 10 minutes before removing to completely cool on wire rack."]}, {"id": "I_FG", "title": "Banana-Coconut Bread", "image": "https://images.yumprint.com/p1yumprint42/42bUUjzE4dwfS6yKDPBc11Nf3_gfyt9WPyGMwYIKwrT_3zMwf-E3G-CVznGgNmLu", "link": "http://www.eatingwell.com/recipe/262834/banana-coconut-bread/?utm_medium=social&utm_campaign=etg_ABA0B27E-9E40-11E8-86F6-CA920F4A2151_editorialcontent&utm_content=_dl&utm_source=facebook", "ingredients": ["1 cup all-purpose flour½ cup whole-wheat pastry flour or whole-wheat flour2 teaspoons baking powder½ teaspoon pumpkin pie spice¼ teaspoon baking soda¼ teaspoon salt1 cup mashed bananas (2 to 3 medium)½ cup packed brown sugar (see Tip)⅓ cup unsweetened lite coconut milk (see Tip)¼ cup refrigerated or frozen egg product, thawed, or 1 egg, lightly beaten2 tablespoons canola oil¼ cup chopped macadamia nuts or sliced almonds¼ cup raw chip coconut or shredded coconut", "1 h 25 m"], "directions": ["Preheat oven to 350°F. Grease the bottom and ½ inch up the sides of an 8x4x2-inch loaf pan or line with parchment paper; set aside. In a large bowl stir together all-purpose flour, whole-wheat flour, baking powder, pumpkin pie spice, baking soda and salt. Make a well in the center of the flour mixture; set aside. In a medium bowl combine mashed bananas, brown sugar, coconut milk, egg and oil. Add banana mixture all at once to flour mixture; stir just until moistened (batter should be lumpy). Spoon batter into prepared loaf pan. Sprinkle with macadamia nuts and coconut. Bake for 45 to 50 minutes or until a toothpick inserted near center comes out clean, covering loaf loosely with foil for the last 20 minutes of baking to prevent overbrowning. Cool in pan on a wire rack for 10 minutes. Remove from pan. Cool completely on wire rack. Wrap and store overnight before slicing.", "Tip: If using a sugar substitute, use Splenda® Brown Sugar Blend for Baking. Follow package directions to use product amount that's equivalent to ½ cup brown sugar. Nutrition Per Serving with Substitute: Same as below, except 139 cal., 19 g carbohydrate., 127 mg sodium. Exchanges: ½ carbohydrate. Carbohydrate choices: 1.", "Stir the can of coconut milk well before measuring out the ⅓ cup to use in this bread."]}, {"id": "Kf23", "title": "Carrot Banana Bread Muffins with Walnut Chia Crumble", "image": "https://images.yumprint.com/p1yumprintaf/AFGntSmZOgF4EwK2U6bfQqbxbYyOHkvmk7r4Vq4T-W5r-Pr-f03ebxhbzMo4IYlb", "link": "https://shop.sprouts.com/shop/recipes/1366", "ingredients": ["1/4 cup Walnuts, toasted and finely chopped", "2 3/4 cup Old-fashioned oats", "1/2 cup Oat flour", "1/4 cup Brown sugar", "Pinch of kosher salt", "2 Tbsp. Sprouts Organic Black Chia Seeds", "2 Tbsp. Unsalted butter, melted", "2 Very ripe bananas, peeled and chopped", "1 cup Sprouts Plain Greek Yogurt", "1/4 cup Maple syrup", "2 Large eggs", "2 tsp. Baking powder", "1 tsp. Vanilla extract", "1 tsp. Ground cinnamon", "4 Large carrots, peeled and grated (about 1 1/2 cups)"], "directions": ["Preheat oven to 425Â°F. Coat 12-cup muffin tin with cooking spray. In a medium bowl, stir together walnuts, 1/4 cup old-fashioned rolled oats, oat flour, brown sugar, salt and chia seeds for walnut chia topping. Drizzle melted butter over bowl and use hands to mix, pinch together to create crumbles.", "For the muffins, add 2 1/2 cup oats, bananas, Greek yogurt, maple syrup, eggs, baking powder, vanilla extract and cinnamon to blender and blend on high until smooth, scraping down sides, as needed. If more liquid is needed, add cool water, 2 tablespoons at a time, until batter is smooth.", "Combine batter and carrots in large bowl, stirring until carrots are evenly distributed. Pour batter into prepared muffin tin. Top batter with crumble. Bake on center rack of oven 15-18 minutes, until tester comes out dry."]}, {"id": "JIoY", "title": "Cauliflower Cheddar Bay Biscuits", "image": "https://images.yumprint.com/p1yumprintbx/bxHQB-cEJDvmfooMVrDq78LSV3ybbR8oxIkzDoLqpW7QVkM7LEORod52WwajZ5td", "link": "http://www.eatingwell.com/recipe/268634/cauliflower-cheddar-bay-biscuits/?utm_campaign=eatingwell_eatingwell&utm_content=link_recipes&utm_term=30E96DC2-D6CC-11E8-A212-46610F4A2151&utm_medium=social&utm_source=facebook.com&fbclid=IwAR1hZmFbn-RcojRQsApAdeopuBgoobE9vwi20FLjOEmZ6_mVKhQWQupbsV8", "ingredients": ["1½ pounds cauliflower florets (about 7 cups)1 large clove garlic, quartered1 cup plus 2 tablespoons shredded extra-sharp Cheddar cheese, divided2 large eggs", "3 tablespoons chopped fresh chives1 tablespoon arrowroot or corn starch⅛ teaspoon salt"], "directions": ["Preheat oven to 425°F. Line a large baking sheet with parchment paper or a silicon baking mat. Place cauliflower and garlic in a food processor. Process until finely grated. (You may need to do this in batches.) Transfer to a microwave-safe bowl. Cover loosely and microwave on high for 4 minutes. Let cool slightly. Transfer the cauliflower to a clean kitchen towel and wring out excess moisture. Return to the bowl and stir in 1 cup cheese, eggs, chives, arrowroot (or corn starch) and salt until thoroughly combined. Using about ⅓ cup batter, mound into 2½-inch biscuits on the parchment paper, leaving about 1 inch between each one, until you have 8 biscuits. Sprinkle tops with the remaining 2 tablespoons cheese. Bake until browned and crispy around the edges, about 30 minutes."]}, {"id": "Kn-l", "title": "Cauliflower Pizza Crust", "image": "https://images.yumprint.com/p1yumprintoo/OotrpacypI676mtfZOpszjSBpXVwfWpYICqx1PCJkhe7Jr_optr4wGGEMJa7dTzs", "link": "http://www.halfyourplate.ca/recipe/cauliflower-pizza-crust/?fbclid=IwAR1rmN2WMtozoLNU30LC2csad56bqfSI9-I4yG0yCX4b_T9RRAU6MKBTkUs", "ingredients": ["1 medium Cauliflower", "1 tsp Italian seasoning", "1/2 tsp Garlic crushed", "salt and pepper to taste", "1/4 cup shredded Parmesan cheese (use the real stuff!)", "1/4 cup reduced-fat mozzarella cheese", "1 egg"], "directions": ["Preheat oven to 425. Line a sheet pan with oiled parchment paper.", "Slice cauliflower into florets, steam for 10 minutes. Once cauliflower has cooled, place a few at a time in a food processor and pulse until it resembles rice. **", "Cool the cauliflower then wring it out in a cheesecloth or clean towel to remove as much water as you possibly can – this will help the crust stick together!", "Once you've removed as much water as you can, mix with cheeses, egg and seasoning. Mix until dough is formed then press onto the lined sheet pan. Bake for 9-12 minutes, or until golden brown.", "Remove from oven, add your toppings, then pop it back in for about 5 minutes or until the cheese is bubbly. Let it cool for 5 minutes before serving so that the crust can firm up."]}, {"id": "vT3N", "title": "Cauliflower Pizza Crust", "image": "https://images.yumprint.com/p1yumprinttb/TB_A50atAymb4qSGkWs9EHJXPiPxsodyJ02S4BI1hGORyYJzvVRJsCi9riY4TvUU", "link": "http://www.healthy-holistic-living.com/cauliflower-chia-seed-crust-heart-cancer-prevention-brain-benefits.html", "ingredients": ["1 Large head of Organic Cauliflower", "3/4 cup of ground almonds", "1 1/2 Tbsp Dried Oregano", "Sea salt and pepper to taste", "1/4 cup chia seeds", "3/4 cup water"], "directions": ["Preheat your oven to 400F.", "Mix your chia seeds in with the 3/4 cup of water and place in your fridge 20 minutes before intended use.", "Chop the cauliflower, and place in a blender or food processor and blend until it is a fine rice-like texture.", "Measure out around 3 cups and place into a large bowl, add in the ground almonds, oregano, salt, and pepper. Make a hole in the center and add in the Chia goop.", "Combine the ingredients by hand and, and shape everything together into a ball. It should be loose and sticky not like a traditional dough.", "Put the ball onto a baking tray and form into a flat crust with your hands. Make a ridge around the outside, and bake for 25 minutes or until golden brown.", "Add your favorite tomato base, and toppings bake an additional 5-10 minutes and enjoy your healthy meal!"]}, {"id": "pdze", "title": "Cheddar-Chive Drop Biscuits", "image": "https://images.yumprint.com/p1yumprint3n/3nmMTGf50q-KD20zCG_K2Y5wQNTGIRuvBeHZsPmlu8Vp7asAtiyTWtVz-QUpT7XG", "link": "http://thepioneerwoman.com/cooking/2014/04/cheddar-chive-drop-biscuits/", "ingredients": ["6 cups All-purpose Flour", "1/4 cup Baking Powder", "3/4 teaspoons Salt", "8 ounces, weight White Cheddar Cheese, Grated", "1/3 cup Sliced Chives (or Green Onions)", "1-1/2 cup Cold Salted Butter, Cut Into Small Pieces, Plus More For Brushing", "2-1/2 cups Buttermilk"], "directions": ["Preheat oven to 425 F.", "Combine flour, baking powder, salt, cheese, and chives in a food processor. Pulse until everything is mixed together. Add butter and pulse until mostly incorporated, but with a few remaining chunks of butter. Pour in buttermilk while pulsing, stopping just when the dough comes together. (Add a little more buttermilk if dough is overly dry.)", "Drop dough onto a baking sheet in 1/4 cup portions (bigger if you'd like!) and bake for 12-15 minutes, or until golden brown.", "Brush with melted butter and sprinkle with more chives!", "If you do not have a food processor, cut together the dry ingredients with the butter, then stir in the other ingredients."]}, {"id": "umbD", "title": "Chestnut Bread", "image": "https://images.yumprint.com/p1yumprint9n/9nnc16Qtbw7e_-nmWKT-3KNypYwkNB0CW4y71qwu2KBeAGRRMsmkAhs79IflP8Nc", "link": "http://www.eatingwell.com/recipes/chestnut_bread.html", "ingredients": ["2/3 cup raisins", "1/2 cup warm water or Vin Santo dessert wine", "1 2/3 cup chestnut flour (see Tip)", "1 cup water, plus more as needed", "2 tablespoons extra-virgin olive oil, divided", "2/3 cup walnut halves", "1 tablespoon pine nuts", "1 tablespoon fresh rosemary"], "directions": ["Preheat oven to 400°F.", "Cover raisins with warm water (or wine) in a bowl and let soak.", "Meanwhile, sift chestnut flour with a flour sifter or push it through a fine sieve into a medium bowl—this can be harder than it sounds, because the flour typically has many hard lumps. Add 1 cup water and whisk until combined. Stir in 1 tablespoon oil. Let the batter rest for 15 minutes.", "After 15 minutes, the consistency of the batter should be similar to pancake batter; if it's too thick, add another tablespoon or two of water to thin it a little bit. Drain the raisins and stir into the batter along with walnuts", "Place the remaining 1 tablespoon oil in an 8-inch square baking pan and set in the oven for 2 to 3 minutes to heat the oil. Tilt the pan so the oil coats the bottom and sides. Pour in the batter and smooth to the edges (some of the oil will be pooling around the edges of the pan). Sprinkle with pine nuts and rosemary.", "Bake until dry on top and the edges are browned, 25 to 30 minutes. Let cool on a wire rack for 15 minutes. Loosen the sides with a knife before turning the bread out of the pan or lifting it out with a large spatula. Serve warm or at room temperature.", "Make Ahead Tip: Store airtight at room temperature for up to 2 days; reheat in a low oven, if desired."]}, {"id": "xTmS", "title": "Choco Pumpkin Walnut Bread", "image": "https://images.yumprint.com/p1yumprintlt/ltB-2L5htHWW4WhrowMxC_Qk31Q3gzelpfUilpnwUyx0S8ztMnjdXH-eksBt472R", "link": "http://www.plantpurepods.com/recipes/recipe/choco-pumpkin-walnut-bread/", "ingredients": ["1 cup chopped walnuts, divided", "1/2 cup vegan, non-dairy chocolate chips"], "directions": ["Preheat the oven to 350° F.", "In a medium bowl, mix all of the dry ingredients and spices until combined.", "In a large bowl, whisk all of the wet ingredients until no lumps are left.", "Add dry mixture to the wet, one-third at a time, gently stirring to combine. Avoid over mixing, a few lumps are ok.", "Fold in 2/3 cup of chocolate chips and/or chopped walnuts", "Lightly spray a loaf pan with cooking spray. (The pan I used is 9.25 x 5.25 x 3.75 inches.) Spoon batter into the pan, smoothing the top. Sprinkle the reserved chopped walnuts on top of the loaf.", "Make a dome from aluminum foil and loosely cover the pan. This helps the loaf stay moist. Make sure to leave some room for the bread to rise.", "Bake for 45 min at 350° F, then take off the foil and bake for 10-15 min more, or until a chopstick inserted in the thickest spot comes out dry and clean.", "Let rest for at least 10 min before attempting to take the loaf out of the pan, and then cool a little longer on a wire rack before slicing and serving."]}, {"id": "KoRj", "title": "Chocolate Tahini Banana Bread", "image": "https://images.yumprint.com/p1yumprintun/uN2_lqfSLQgiJBYJitAzMdDO9DyWKL41WIpn-WNxlhF6ukhyI-uKajPnJYueC5ok", "link": "https://www.paleoplan.com/recipes/recipes/chocolate-tahini-banana-bread/?fbclid=IwAR1Twr2qQ-ITzX0OzmPE9AibYbCoZcl8ciPxtOjrP-wdgQM67jY25MzsURs", "ingredients": ["3 bananas ripe mashed", "1/2 cup(s) tahini", "1/4 cup(s) ghee softened", "3 tablespoon(s) coconut sugar", "4 eggs room-temperature", "1 teaspoon(s) vanilla extract", "2 cup(s) almond flour", "1/2 cup(s) tapioca flour", "2 tablespoon(s) cacao powder", "1 tablespoon(s) baking soda", "1/2 cup(s) dark chocolate chips divided"], "directions": ["Preheat oven to 325°F.", "Grease or line a loaf pan with parchment paper.", "In the bowl of a stand mixer with paddle attachment, cream together tahini, ghee, and coconut sugar.", "Add bananas, eggs, and vanilla extract, then beat another minute to incorporate.", "Add almond flour, tapioca flour, raw cacao powder, and baking soda. Mix until just combined.", "Fold half of chocolate chips into batter. Transfer batter to prepared loaf pan.", "Sprinkle top of loaf with remaining chocolate chips and bake 40-45 minutes, until a toothpick inserted in the center comes out clean.", "Cool loaf in pan for 10 minutes. Transfer to a wire rack to cool another 20-30 minutes.", "Slice and enjoy."]}, {"id": "xmqP", "title": "Cilantro Lime Cauliflower Biscuits", "image": "https://images.yumprint.com/p1yumprintye/YeQbVFZyGwKAeh48ZKJm9FjuIObuc-i9CLOUmmeftQ4gL4HWCL4fU3L1D-UapdaJ", "link": "http://caitliniles.ca/cilantro-lime-cauliflower-biscuits/", "ingredients": ["2 cups cauliflower rice*", "1 lime, juiced", "1/3 cup densely packed chopped cilantro", "4 green onions, sliced", "¼ cup + 1tbsp. coconut flour", "¼ cup tapioca starch", "1 tsp. baking powder", "½ tsp. sea salt", "2 eggs"], "directions": ["Preheat oven to 350F and line a baking sheet with parchment paper or grease with coconut oil.", "Stir together cauliflower, lime, cilantro, green onion, coconut flour, tapioca starch, baking powder, and sea salt.", "Crack eggs into mixture and stir together until fully combined.", "Let mixture sit 5 to 7 minutes to allow coconut flour to absorb the moisture, then knead for about 30 seconds until it starts to stick together.", "Form into small balls and then press flat into desired biscuit shape.", "Bake for 30 to 40 minutes until tops are golden brown and biscuit is firm when pressed.", "Let cool and enjoy!", "Store in an airtight container for up to 5 days.", "To rice cauliflower, break up into florets and pulse in a food processor until a small, rice-like texture is achieved."]}, {"id": "Kh2r", "title": "Coconut Flour Bread", "image": "https://images.yumprint.com/p1yumprinted/EDxj__m3pSDqm0IYRLTZv5F7gvhNzSr9EblKN6XoGTpqfHHjB4Nb_cxggYFtmpsD", "link": "https://www.drlivingood.com/blog/coconut-flour-bread", "ingredients": ["6 eggs", "1/2 cup coconut oil or butter, melted", "3/4 cup coconut flour, ideally sifted", "1 tsp salt", "1-2 tbsp raw honey (optional)"], "directions": ["Combine coconut flour and salt in a bowl.  In a small bowl, beat eggs and add to the flour. Mix in oil (and honey if using).  Put dough into coconut oiled loaf pan and bake at 350 degrees F for 40 minutes or until golden brown."]}, {"id": "uBOm", "title": "Delicious Gluten-Free Flatbread", "image": "https://images.yumprint.com/p1yumprintit/ItlZD76B7JtJ6Ob8N-q32OJKB3GOeLLhVgZrSR4V_Po5Dwafg27RnilKM1Wem2Fy", "link": "http://drarata.com/the-best-and-most-delicious-gluten-free-flatbread-youll-ever-make/", "ingredients": ["1/2 cup potato flour", "1/2 cup tapioca starch", "1 cup coconut milk (full fat)", "1 egg", "1/4 tsp salt"], "directions": ["Preheat oven to 350 degrees.", "Combine all ingredients in bowl and mix together.", "Once it starts to form a thick dough, spread out on baking sheet lined with parchment paper.", "You may need to wet your hands or add a little water to the dough for easier spreading.", "Sprinkle with sea salt and any other desired seasonings.", "Bake for 30-40 minutes until golden brown.", "I like to brush with a layer of olive oil when it’s finished baking. Enjoy!"]}, {"id": "BdIf", "title": "EASIEST HOMEMADE BREAD EVER", "image": "https://images.yumprint.com/p1yumprintie/ieuhbvZEjrIU-lJRp-6Bi8Wp40JmZrZufCQ0WXeuiqP_7lFpgdBa3nPJdemfAat2", "link": "http://rachelschultz.com/2013/06/19/easiest-homemade-bread-ever/", "ingredients": ["2 cups flour", "1/2 cup whole wheat flour", "1 teaspoons salt", "1 cup warm water", "2 teaspoons sugar", "1 teaspoon active dry yeast", "1 tablespoons butter"], "directions": ["Stir together flours and salt in a mixing bowl (not the glass bowl you will bake in). In a small bowl, (also not the one for baking), water, sugar, and yeast. Allow to sit for 15 minutes. Stir yeast mixture and pour into flour. Mix until a dough forms. Cover bowl with a towel and let rise for 2 hours. Preheat oven to 425 degrees. Butter the sides of an approximately 1.5 liter glass bowl (this one is used for baking!). Transfer dough into bowl. Bake for 10 minutes. Reduce heat to 375 degrees and bake for 20 minutes."]}, {"id": "CQy8", "title": "Easy Cheesy Garlic Breadsticks", "image": "https://images.yumprint.com/p1yumprintjk/jKfn6idPLrSAaUvu0gh32aw4DcWqw8Qu2sDTvCa4RozvFST_EBfpa1ucnzMQf0bu", "link": "http://sugarapron.com/2014/08/03/easy-cheesy-garlic-breadsticks/", "ingredients": ["1 (10 ounce) can prepared pizza crust", "1 tablespoon butter, melted", "1 cloves garlic, finely minced", "1/2 cup mozzarella cheese, grated", "1 tablespoon parmesan cheese", "1 tablespoon dried basil", "salt & pepper to taste"], "directions": ["Preheat oven to 425.", "Mix butter and garlic in a small bowl and set aside.", "Unroll pizza dough onto a parchment paper lined baking sheet and brush with butter and garlic mixture.", "Sprinkle cheeses and spices evenly over the dough.", "Use a pizza cutter and cut dough into stick shapes (Lengthwise into 7 long strips and crosswise into 3 strips). Do not seperate strips.", "Bake for 10-12 minutes or until light golden brown.", "Recut along each strip and remove from cooking sheet.", "Serve sticks warm with marinara sauce."]}, {"id": "t5HR", "title": "Easy No-knead Einkorn Sourdough Bread", "image": null, "link": "http://www.motherearthnews.com/real-food/einkorn-sourdough-bread-zbcz1510.aspx", "ingredients": ["•  1 cup or more* proofed/bubbling sourdough starter", "•  6 cups Einkorn flour", "•  2 to 3 cups room temp filtered water", "•  1 tbsp sea salt"], "directions": ["In a large bowl (preferably one that has a lid), add the flour, sourdough starter, water and salt and mix until blended. It should be a gluey thick batter, a little thicker than brownie batter.", "Cover and let it rise in a warm spot for about 8+ hours, or until bubbly and doubled in size. In the winter, I turn my oven light on for warmth and keep the bowl in the oven for rising.", "Once the dough has risen sufficiently (8-12 hours, depending on ambient temps), remove it from the oven. Place your empty covered casserole in the oven and set the oven temp 450 degrees F.", "Once temp is achieved, remove your casserole from the oven. CAUTION: HOT HOT HOT! Remove the lid and gently pour the dough into the casserole, being careful to not disturb too many bubbles. Cover and bake for 60 minutes. PLEASE NOTE: You may have to experiment with bake time due to altitude differences. Being at almost 6,000 ft., I bake for 80 minutes.", "Remove the bread from the oven and remove lid. After 10-15 minutes, dump the bread out of the casserole, place on a cooling rack and allow it to cool completely before slicing and serving. I usually leave it on the counter over night to cool and dry a little and then cut it in the morning with a meat slicer. If it makes it through the night, lol. Don’t forget the Kerry Gold!"]}, {"id": "KjgE", "title": "Einkorn Banana Bread", "image": null, "link": "https://nourishedkitchen.com/einkorn-banana-bread/?fbclid=IwAR1nSCodADcge-RHaCeFh1Fd6UAOuDNPVp0deDdGUcUIVf4wmxR0lJp67Qk", "ingredients": ["4 frozen overripe bananas, thawed overnight", "2 cups all-purpose einkorn flour", "½ teaspoon finely ground sea salt", "1 teaspoon baking soda", "½ cup softened butter", "1 cup jaggery", "2 pastured eggs", "⅓ cup milk kefir", "½ cup chopped walnuts", "½ cup dark chocolate chips"], "directions": ["Grease a 9-inch by 5-inch loaf pan or line it with parchment paper, and heat the oven to 350 F.", "Remove the bananas from their peels, and return them to the colander. Set the colander in the sink or over a bowl to allow excess liquid to drain.", "While the bananas drain, sift the einkorn flour with the baking soda and salt into a medium bowl, and set it aside.", "Place the butter and jaggery into a stand mixer, and cream them together at medium speed until lightened and fluffy. Add the eggs and bananas, and beat them together until uniformly combined.", "Beat one half of the flour into the liquid ingredients, and then pour in the kefir, and then beat in the remaining flour.", "Fold the nuts and chocolate chips into the batter, and then pour the batter into your prepared loaf pan. Bake at 350 degrees for 70 minutes or until it springs back when lightly touched in the middle. Remove from pan and cool on a wire rack."]}, {"id": "x8dR", "title": "Exclusive Paleo Bread Recipe from Ditch the Wheat Cookbook", "image": "https://images.yumprint.com/p1yumprintzw/ZwWtkgwdvlf8H7Vym1qOhQXiPvxHwPKxgkGeCo6pWPl22n1rYkFEAFfDgbdxUb8X", "link": "http://www.mommypotamus.com/gluten-free-paleo-bread/", "ingredients": ["7 large eggs", "1 cup unsweetened almond butter", "½ cup arrowroot starch", "½ cup tapioca starch", "¼ cup coconut oil", "3 tablespoons raw honey", "2 teaspoons cream of tartar", "1 teaspoon baking soda", "½ teaspoon fine sea salt"], "directions": ["Preheat the oven to 375°F. Line an 8 by 4-inch loaf pan with parchment paper.", "Using a stand mixer, mix all the ingredients together.", "Pour the batter into the loaf pan.", "Bake for 50 minutes or until a toothpick comes out dry.", "Allow the bread to cool in the pan for 10 minutes, then remove them from pan and cool on a cooling rack.", "Let the loaf cool completely before slicing.", "Store bread at room temperature in an airtight container for up to 2 days, or pre-slice the bread and freeze."]}, {"id": "tLlY", "title": "Freckled Pumpkin Yeast Bread Recipe", "image": null, "link": "http://www.motherearthnews.com/real-food/freckled-pumpkin-yeast-bread-zbcz1510.aspx", "ingredients": ["• 1-1/2 cups Kamut flour", "• 3 cups all-purpose or bread flour", "• 1-1/2 tbsp brown sugar", "• 1-1/2 tsp salt", "• 2-1/4 tsp active dry yeast", "• 1-1/4 cup pumpkin puree", "• 3/4 cup plain yogurt or buttermilk", "• 2 tbsp olive oil", "• 3/4 cup chopped pecans"], "directions": ["Add all ingredients except pecans to a large bowl, or a stand mixer bowl. Mix well to combine.", "Add nuts. Knead by hand until smooth and elastic, about 10 minutes, or using a stand mixer for 5 - 8 minutes.", "Place in a greased bowl, cover and let rise in a warm place until almost doubled, about 1-1/2 hours", "Gently fold to deflate.", "Shape the dough into a ball and place in a floured brotform. You could also shape the dough into a free from oval. Cover and let rise 30 – 40 minutes or until doubled.", "Preheat oven and baking stone to 400 degrees Fahrenheit.", "Gently flip the bread out of the brotform and onto a parchment lined peel. Score the round with a sharp knife.", "Slide the loaf onto the baking stone and bake for 40 - 45 minutes, or until interior temperature reaches 195 -200 degrees.", "Remove from oven and let cool for up to an hour before slicing."]}, {"id": "BcDd", "title": "Fruit and Nut Bread (Gluten-Free,", "image": "https://images.yumprint.com/p1yumprintk-/k-m-kM2nDle9iomWs9LuqruIwqZPgVdbxdOEFjr_3kNspPkpFtDNz_VUNKJDC74m", "link": "http://gourmandeinthekitchen.com/fruit-and-nut-bread/", "ingredients": ["½ cup/120g cashew butter", "½ cup/120g roasted almond butter (smooth)", "4 large eggs", "¼ cup/48g coconut sugar", "1 teaspoon vanilla extract", "½ teaspoon ground cinnamon", "Pinch of sea salt", "1 teaspoon baking powder (use cornstarch-free for paleo)", "8-10 small deglet noor dates, chopped (plus more to top)", "1/3 cup/50g raisins (plus more to top)", "1/3 cup/53g dried cherries (plus more to top)", "1/3 cup/46g hazelnuts, chopped (plus more to top)", "½ cup/62g pecans, chopped (plus more to top)"], "directions": ["Preheat the oven to 350°. Prepare two 6 inch loaf pans with parchment paper.", "In a large bowl whisk together cashew butter, almond butter and eggs until smooth. Whisk in coconut sugar, vanilla extract, cinnamon, salt, baking powder until well combined. Stir in dried fruit and nuts.", "Scrape the batter into the prepared pans and place on a baking sheet. Top with extra dried fruit and top. Bake for about 30-35 minutes, until the loaves are puffed and browned and a cake tester inserted in the center comes out clean. Transfer the loaves to a rack and let cool to room temperature."]}, {"id": "sbmD", "title": "Garlic Parmesan Pull Apart Rolls", "image": "https://images.yumprint.com/p1yumprintry/RyLnAr8yTrkF-M0L3HG-2Vzvg8LbD44cWoWSvdkexBSGV3M1BeUxpisJdXxTZtIK", "link": "http://www.melissassouthernstylekitchen.com/garlic-parmesan-cheese-pull-apart-bread-using-rhodes-frozen-yeast-rolls/", "ingredients": ["16 frozen white dinner rolls [I used Rhodes]", "1/2 cup [1 stick] butter, melted", "2/3 plus 1/4 cup grated Parmesan-Romano cheese [divided]", "1 tsp dry parsley flakes", "1 tsp garlic powder", "1/2 tsp salt", "1/2 tsp dried basil or Italian seasoning", "1/2 tsp onion powder"], "directions": ["If you’re someone who loves for all of the rolls to have that crispy golden top,  bake the bread in a round 9 inch spring form or pie pan.  Follow the same preparation method and bake for around 22-24 minutes until golden and cooked through.", "Additional baking options:", "Bundt pan", "Divide the dough between 2 loaf pans", "Individual size in standard muffin cups [4 pieces in each]", "8×8 baking dish", "9 inch round spring form or pie pan", "8 inch tart pan"]}, {"id": "eEFp", "title": "Gluten and Dairy Free Cornbread Recipe", "image": "https://images.yumprint.com/p1yumprintuz/Uz1GBNMShmB_cKKr6Tc1nkcbpSb1Eu1jKW-nhyd02jigrGB-ctv8RxxMMDB_AVPU", "link": "http://alittleinsanity.com/gluten-and-dairy-free-cornbread-recipe/", "ingredients": ["1 Cup Organic Corn Flour or Organic Corn Meal (I prefer the smoother texture of Corn Flour – and always use organic to stay away from bad GMO’s)", "1 Cup of Erika’s All Purpose Gluten Free Flour Mix", "1 Tablespoon Baking Powder", "¼ Cup Sugar (or sugar alternatives – see below – or none)", "¼ Cup Honey", "1 teaspoon Salt", "1 Cup Milk Alternative (or real Milk)", "¼ Cup Spectrum Palm Shortening (or real Butter)", "3 Eggs"], "directions": ["Preheat oven to 400 degrees.", "Prepare Muffin Pan with liners or Pan with non-stick spray if necessary.", "Combine all ingredients in your Stand Mixer fitted with the whip attachment or in Bowl and beat all together for 2 minutes.", "Pour mixture into prepared muffin cups or square cake pan.", "Bake at 400 degrees for approx. 15-20 minutes for muffins and 25-30 minutes for cake pan or until the top is a dark golden brown and a toothpick comes out clean. I use my Digital Pen Thermometer to test the temperature of my gluten free breads and pull them out of the oven once they hit an internal temp of 200 degrees.", "STORAGE", "Although it can be left out overnight, it’s best to store leftovers in fridge to avoid spoilage.", "STUFFING INSTRUCTIONS", "To make Gluten Free Cornbread Stuffing cut up Cornbread into small cubes and place on a cookie sheet in your oven at 200 degrees until the bread is completely dry (like croutons). Or, you can use your dehydrator to dry the bread. Use 1 for 1 in your favorite stuffing recipe!", "Serves: 1 8×8 Pan or 12 Muffins"]}, {"id": "KGF4", "title": "Gluten Free Chocolate Vanilla Muffins", "image": "https://images.yumprint.com/p1yumprintaw/awUCRw-oJJq3ekiC1_l3IhAkBiS7KLb4b7vsx0847gJ5sxMVOLrxh-DPIbUVj-DR", "link": "http://www.littlebitesofbeauty.com/gluten-free-chocolate-vanilla-muffins/?fbclid=IwAR3B1tvWMzthttHlTBG1vFAwk7On_yZLqcncwxqcGJWAxl8U9kXnizhKLxU", "ingredients": ["35 gr 100% Dark Chocolate (melted)", "25 gr Coconut Milk", "10 gr 100% Dark Chocolate Chips", "10 gr Organic Corn Starch"], "directions": []}, {"id": "KnDN", "title": "Gluten free French Bread", "image": "https://images.yumprint.com/p1yumprintjd/JdPCMAz2g6by3peF9fIhcZTyC67fgqzOJu_SDPR-2xVfVu6rgpS97RdfE8Y7zMiC", "link": "https://glutenfreehomemaker.com/gluten-free-french-bread-recipe/?utm_content=buffer2e01b&utm_medium=social&utm_source=facebook.com&utm_campaign=buffer&fbclid=IwAR333QujOrIZxSdje4s_wGKhvC8Aimm2Ca2ESJOBMBzOTGXXcpDp7bR7U_I", "ingredients": ["1 cup sorghum flour", "1 1/2 cup potato starch", "1/2 cup tapioca starch or flour", "1 1/2 teaspoon salt", "1 Tablespoon sugar", "1 teaspoon xanthan gum", "1 teaspoon guar gum (or xanthan)", "1 1/2 Tablespoons instant or bread machine yeast", "1 Tablespoon olive oil", "3 large egg whites", "1 teaspoon cider vinegar", "1 cup warm water (105 – 115 degrees)"], "directions": ["In the bowl of your mixer, combine the dry ingredients (sorghum flour through yeast).", "Add the olive oil and egg whites and mix to incorporate.", "Add the vinegar and most of the water. Beat for 2 minutes, adding the remaining water if needed to make a soft dough.", "Spoon the dough onto the pan and carefully shape with a spatula. Because the dough is soft, it will go through the small holes in the pan. Don’t press hard when shaping.", "If you like, you can brush the top with beaten egg white.", "Use a sharp knife to cut several slits in the top of each loaf.", "Place the pan in a cold oven on a middle rack. Turn the oven on to 425 degrees and begin timing for 30 – 35 minutes.", "Cool the loaves on a wire wrack before slicing."]}, {"id": "f8SJ", "title": "Gluten Free Wraps | Buckwheat Galettes (Buckwheat Pancakes)", "image": "https://images.yumprint.com/p1yumprint4q/4QiSdqCvdX2fgWlYgShvVOFNiv3a_C_30lMovlXvW1p2uc-kotHZk_4GvWOucnlL", "link": "http://wholenewmom.com/recipes/gluten-free-wraps-buckwheat-galettes-buckwheat-pancakes-vegan/", "ingredients": ["2 cups buckwheat flour (330 g)", "2 tsp salt (I recommend Real Salt)", "3 1/3 cups water (750 ml) (Filtered preferred.  Read How Safe is Your Water?)", "1 egg (or substitute.  See my Homemade Egg Replacer.)"], "directions": ["Mix flour and salt in a large bowl.", "Add water gradually by adding in 1/3 – 1/2 of the total amount each time, stirring well after each addition.", "Add the egg or substitute.", "Cover batter and refrigerate for 1-2 hours (optional.  I’ve, opted not to do this when I am in a hurry.)", "Ladle batter onto a prepared skillet, greased as necessary.", "Cook until galette starts to brown.", "Flip galette over and cook on the other side.", "NOTE:  You can soak the flour and liquid overnight as well, and the pancakes will turn out quite a bit thicker.  See How and Why to Soak Grains.)", "Eat them just as they are!", "Spread with sandwich fixin’s like nut butter, either plan or with jam or sweetener of choice.  Top with another pancake and eat like a sandwich.  Make sure you see Homemade Nut or Seed Butter.", "Spread with a thin layer of your favorite filling and roll up and eat like a wrap.  (The top photo is filled with scrambled eggs, tomatoes and peppers.)  We’ve filled them with Savory Hummus at times.  Yum!", "Fill with ice cream (like Chocolate Almond Chip Coconut Milk Ice Cream…our favorite!) and drizzle w/ chocolate sauce.  Umm….I hear it calling my name now!  What a simple, elegant dessert!"]}, {"id": "umcz", "title": "Gluten-Free All-Purpose Flour", "image": "https://images.yumprint.com/p1yumprintt8/T8qv4Q_ZE9kZ9S_UM4YZtNbzmkFxnYfowlyeNXj0reD7tvrW1koa9EBnQHScfPG0", "link": "http://www.artisanbreadinfive.com/2014/04/30/gfmix", "ingredients": ["White Rice Flour: 6 cups, or 36 ounces, or 1,020 grams", "Sorghum flour: 3 1/4 cups, or 1 pound, or 455 grams", "Tapioca Flour or Starch: 1 3/4 cups, or 8 ounces, or 225 grams", "Potato Starch*: 1 1/4 cups, or 8 ounces, or 225 grams", "Xanthan Gum or Psyllium Husk Powder: 1/4 cup, or 1.4 ounces, or 40 grams", "*Don’t substitute potato flour"], "directions": ["Makes 4 1/4 pounds (2 kilograms) of flour mixture", "The ingredients must be very well mixed, otherwise the xanthan gum or psyllium will not be evenly distributed and your loaves will be inconsistent. Whisk and mix the ingredients in a 5- to 6-quart lidded container. Finish by picking up the container and vigorously shaking until the flours are completely blended."]}, {"id": "IL2h", "title": "Gluten-Free Buckwheat Bread", "image": "https://images.yumprint.com/p1yumprinth4/h4iy8L2JUa2QBP4PBDYV-hngvD_5wfDUmYYxyAXz5iNTx1kZhGq3FgrJejI-9Cm0", "link": "https://hormonesbalance.com/recipes/gluten-free-buckwheat-bread/?utm_source=facebook&utm_medium=post", "ingredients": ["5 tablespoons ground flaxseeds (flaxseed meal)", "1 cup water", "1 cup almond milk (or other non-dairy milk)", "3 tablespoons coconut oil, melted", "2 teaspoons apple cider vinegar", "1 cup rice flour", "1 ½ cups sorghum flour", "½ cup tapioca starch", "¼ cup buckwheat flour", "3 teaspoons baking powder", "1 teaspoon xantham gum", "½ teaspoon salt", "½ cup seed mixture (a combination of sunflower seeds, flax seeds, chia seeds, and sesame seeds), for sprinkling"], "directions": ["Pre-heat the oven to 350 deg. Fahrenheit (180 deg. Celsius) and line a loaf pan with parchment paper. Let extra parchment paper hang from the sides to make it easier to remove the loaf later on.", "In a medium bowl, combine the ground flaxseeds with the water, almond milk, melted coconut oil and apple cider vinegar. Mix until combined.", "In a large bowl, whisk the rice flour, sorghum flour, tapioca starch, buckwheat flour, baking powder, xantham gum and salt together.", "Pour the wet ingredients into the bowl with the dry ingredients and stir until just combined and you have a homogeneous batter.", "Pour the batter into prepared loaf pan and sprinkle seeds on top of the batter.", "Bake the batter for 65 to 70 minutes, until a toothpick inserted in the middle comes out clean.", "Allow the loaf to cool completely for at least 30 minutes before removing from the pan and slicing.", "Store bread in an airtight container in the refrigerator for up to 1 week, or in the freezer for up to 1 month."]}, {"id": "Kwy0", "title": "Gluten-Free Cheesy Ruffle Bread", "image": "https://images.yumprint.com/p1yumprintum/umHM2f3qor9TzMGSbbjxatEa6LCt3cm2zhwpm8weGW7avpt21ukDJGH86cIh764q", "link": "https://www.queenofmykitchen.com/gluten-free-cheesy-ruffle-bread/?fbclid=IwAR3KOC-HRSgBSRSfniDxl_3P7PwIBp8W_ELu3C-O6B91N3wFht1057Cj7Wg", "ingredients": ["Olive oil cooking spray", "1 cup (120 grams) tapioca flour (also called tapioca starch)", "½ cup milk", "1 egg", "2 tablespoons olive oil", "1 teaspoon salt", "Pinch of pepper", "⅓ cup (40 grams) grated cheddar cheese"], "directions": ["Preheat oven to 500 degrees.", "Spray two 8-inch round cake pans with olive oil cooking spray.", "In a bowl whisk together the tapioca flour, milk, egg, olive oil, salt, and pepper until you have a smooth batter.", "Pour half the batter into each pan and sprinkle the cheese evenly on the tops.", "Bake on the bottom rack of the oven for 10-12 minutes until browned and crispy around the edges.", "Use a pizza wheel to cut each circle of bread into 4 pieces."]}, {"id": "K8EA", "title": "Gluten-Free Chocolate Avocado Bread Recipe", "image": "https://images.yumprint.com/p1yumprintlf/lFf9OFI5qWJzH9gEmh2WOaYciYF0YFhfquZDVHMsmGzLA9XYsyv7uGOTw9ckjlu6", "link": "https://thewellnessway.com/chocolate-avocado-bread/?fbclid=IwAR3wNSgnIFFcW3vLt0kzMAq7qovAeSM7vtXJ86rTYMXUYIhdluYeNwG7ZOI", "ingredients": ["1 1/2 cups organic avocado", "1 teaspoon organic vanilla extract", "3 tablespoons organic coconut oil, melted", "3 tablespoons raw, organic honey", "2 1/2 tablespoons organic coconut cream (open can and leave in fridge overnight – cream will form on top)", "2 duck eggs, room temperature", "1/4 cup organic raw, organic cacao", "1-2 tablespoons organic maca powder", "2 cups organic gluten-free flour of choice", "1/2 teaspoon sea salt", "1 teaspoon aluminum-free baking soda", "1/3 dairy-free chocolate chips, and a few for sprinkling on top"], "directions": ["Preheat oven to 350 degrees. Line both bottom and sides of bread pan with parchment paper.", "Blend avocado, then add coconut oil, coconut cream, eggs, vanilla, and honey. Blend until smooth.", "In a separate bowl combine flour, cacao, salt, baking soda, and chocolate chips.", "Mix wet and dry ingredients carefully.", "Pour batter into pan, and sprinkle chocolate chips on top if desired. Spread batter until even.", "Bake 40-45 minutes, then let cool for 10 minutes before serving."]}, {"id": "mjQy", "title": "Gluten-Free Crepes", "image": "https://images.yumprint.com/p1yumprintmc/mcIMAsGu08mlwRsoXz9nqOZoyQBODJm6EUuev7bb-3dilFEU82i4LsssNcV-gd5Q", "link": "http://www.melissadarabian.net/recipes/gluten-free-crepes/", "ingredients": ["If making savory crepes only, add chopped herbs.", "If making dessert crepes only, add 1 tablespoon sugar, orange zest or cocoa powder.", "We use same batter for both savory and sweet, so we leave out the extras."], "directions": ["In a small bowl, whisk together the wet ingredients. In a clean, large bowl, whisk together the dry ingredients. Pour the wet ingredients into the dry ingredients and whisk until smooth. (The batter will be thin.) Place bowl in the refrigerator and let rest for 30 minutes. Once rested, the batter should be just slightly thicker than heavy cream (which means it will be slightly thicker than regular crepe batter). Add a tablespoon or two of water if needed. Heat a nonstick skillet or crepe pan on medium heat. Spray with nonstick spray just before pouring in the batter each time. Pour in just under 1/4 cup of batter into the hot, greased pan, and swirl the pan around to coat the entire bottom of the pan with the batter, using the back of spoon if needed to help it spread quickly. After the swirling, place the pan back on the burner and let it cook for about 30-60 seconds, or until the top of the crepe looks partially dry. Then pull the crepe off the burner for another 30-60 seconds (I cook on the back burner and pull to the front burner.). This off-burner cooking trick is what makes my GF crepes perfect — totally worth the extra seconds of cook time. The extra (low-heat) time let the crepes settle into shape, so they flipped easily without falling apart, while not over-browning them. As the crepes cook, stack them on a large plate. Then fill with anything you want, from ham and cheese to chocolate-hazelnut spread. Fold and enjoy."]}, {"id": "I5n3", "title": "Gluten-Free French Baguette Recipe", "image": "https://images.yumprint.com/p1yumprinttx/tx7bMqPEnsk7f_7kbzzoqNMcP6CcJ0Vkbo4uoxPxwwJ497I0_noub1d5pfkfO67t", "link": "https://www.motherearthliving.com/food-and-recipes/recipes/gluten-free-french-baguette-recipe-ze0z1406zpit", "ingredients": ["• 2 tablespoons ground chia seeds", "• 2 1/4 teaspoons active dry yeast", "• 1 tablespoon granulated sugar", "• 1 cup water, heated to 110 to 115 degrees Fahrenheit, divided", "• 2/3 cup millet flour, plus more if needed", "• 1/2 cup garbanzo bean flour", "• 1/3 cup cornstarch", "• 1/3 cup potato starch", "• 1/4 cup tapioca flour", "• 3/4 teaspoon xanthan gum", "• 1/2 teaspoon fine salt", "• 1 tablespoon unsalted butter, melted", "• 1 tablespoon poppy seeds"], "directions": ["Grease the inside of a long French baguette pan with vegetable oil or softened butter.", "Combine the chia seeds, yeast, sugar, and 1/2 cup of the warm water in the bowl of a stand mixer fitted with the paddle attachment and mix well.  Set aside for about 10 minutes while the yeast proofs.  Combine the 2/3 cup of millet flour and the garbanzo bean flour, cornstarch, potato starch, tapioca flour, xanthan gum, and salt in a deep mixing bowl and whisk well.", "When the yeast looks frothy add the remaining 1/2 cup of warm water and the melted butter and mix well.  Add the dry ingredients and beat at medium speed until combined.  Increase the speed to high and beat the dough for 3 to 5 minutes, or until the dough has the consistency of a drop biscuit dough.  Add more millet flour by 1 tablespoon amounts in necessary.", "Scrape the dough evenly into the prepared pan, forming it into a long line.  Cover the pan loosely with a sheet of oiled plastic wrap or a damp towel and allow the dough to rise for 1 hour in a warm spot, or until it has doubled in bulk.  Sprinkle the top of the loaf with poppy seeds, if using.", "Place the oven racks in the middle and lowest positions.  Place a rimmed baking sheet on the lower rack and place a pizza stone on the upper rack.  Preheat the oven to 400 degrees Fahrenheit toward the end of the rising time, bring a kettle of water to a boil, and have a spray bottle of water handy.", "Pour 1 cup of boiling water into the heated sheet pan and slide the bread pan on top of the heated pizza stone.  Spray the walls of the oven with the spray bottle, close the oven door and wait 30 seconds, then spray the oven walls again.  Covering the loaf loosely with aluminum foil after 20 minutes, bake the bread for 45 to 50 minutes, or until the bread is golden brown, sounds hollow and thumps when tapped on the bottom, and has reached an internal temperature of 200 degrees Fahrenheit on an instant-read thermometer.  Remove the bread from the oven and allow it to cool for 30 minutes before slicing.", "Note: The bread is best the day it is baked, but it can be stored refrigerated, tightly covered with plastic wrap, for up to 2 days.", "If you go to a French bakery, the number of names given to basically the same bread can be mind-boggling.  It all depends on the size and shape.  A baguette is long and thin, generally 24 inches by 2 inches, whereas a bâtard is shorter and wider; it’s 16 inches by 3 inches. A long loaf shrinks in length even more when it becomes a ficelle, which is only a foot long and about 2 inches wide. Round shapes are just as numerous. A large round or oval is dubbed a pain de ménage or a pain boulot, whereas smaller rounds are boules and rolls are petits pains."]}, {"id": "umcg", "title": "Gluten-Free Master Recipe", "image": "https://images.yumprint.com/p1yumprintsa/sadEKJzP7NuKt5Sb-gmpmccMpDyu6R1hP3mEb2MEYh-JxGhPu4uZXjo1SIzlhFBe", "link": "http://www.artisanbreadinfive.com/2014/11/03/master-recipe-from-gluten-free-abin5", "ingredients": ["6 1/2 cups (2 pounds 3 ounces / 990 grams) flour mixture #1 from our book, which is reprinted at this link. We tested all our recipes with Bob’s Red Mill unblended flours, not their gluten-free flour mixtures.", "1 tablespoon Red Star Active Dry or Quick Rise yeast (not Red Star Platinum, which isn’t gluten-free)", "1 to 1 1/2 tablespoons Kosher salt", "2 tablespoons sugar or honey (we find that the gluten-free dough needs the sugar to brown nicely, although it is optional)", "4 egg whites, plus enough warm water to equal 3 3/4 cups (*see picture below) – if you don’t want to use eggs, then just use 3 3/4 cups water."], "directions": ["Put 4 egg whites in a large measuring cup, fill the cup with water until you have 3 3/4 cups liquid.", "In our GFABin5 we suggest using a Stand Mixer with the paddle attachment for the smoothest dough and ease of mixing. You can still do the mixing in a bucket or bowl, as we recommended in our past books, but it will take a bit more effort to get a really smooth dough.", "In a stand mixer, fitted with the paddle attachment, add the yeast to the flour mix #1. We tested all of the recipes with both Active and Quick Rise yeast from Red Star and find that they work equally well in our stored gluten-free dough. You can’t use their Platinum yeast, since it contains trace amounts of wheat, but we love it for our wheat breads.", "Add the Kosher salt to the flour mix. You can add more or less salt, depending on your preference.", "Blend all the dry ingredients for a few seconds.", "While the mixer is on low speed, slowly add all the liquid.", "Once all of the liquid is added to the mixer, turn it up to medium-high speed and let it blend for about 1 minute.", "The dough will look and feel like soft biscuit dough.", "Transfer the dough to a 4+ quart Food-Storage Container. The dough will rise some, but don’t expect it to double in size.", "Cover the container, but it shouldn’t be airtight. I poke a very small hole in the lid (you can see it in the exact center of the above lid) to allow the gas from the yeast to escape. If you don’t poke a hole…", "…then you will want to place the lid on the container, but don’t snap it all the way shut (see above photo). Don’t allow too much air to get into the bucket or the dough may dry out.", "Allow the dough to sit at room temperature for 2 hours. If your kitchen is cool, it may take 2 1/2 to 3 hours. You can use the dough after the initial rise or refrigerate the dough for about 5 days (10 if you don’t use eggs).", "When you are ready to bake, sprinkle some GF flour on a piece of parchment. Dust the surface of the dough with more flour.", "Scoop up a 1-pound piece of dough. Store the rest of the dough in the fridge for up to 5 days if using egg whites, or 10 days if you only used water. That’s where our method saves you time–all your subsequent loaves are made from pre-mixed, stored dough that will develop sourdough flavors as it ages.", "Unlike our wheat dough, this will not have any stretch when you lift it out, it will just break off.", "Place the dough on the parchment and shape it into a ball. It may not be smooth at this point.", "Using wet fingers, smooth out the surface of the dough. Creating a smooth surface also seems to help trap the gas from the yeast and improve the rise of the bread.", "Cover loosely with plastic and allow to rise for about an hour. If you are using fresh dough, then just 30 minutes.", "Preheat oven with a Baking Stone to 450°F. It is very important that your oven be hot enough, so use an oven thermometer to check the actual temperature. If you are using a thick Baking Stone, this can take 45 minutes or longer. Put a broiler tray on the bottom of the oven, which will be used to catch water to create steam in your oven.", "Once the dough is ready (it may not rise much while resting), dust it with more flour and slash the top with a serrated knife.", "Slide the loaf onto the preheated baking stone, add 1 cup water to broiler tray to create steam and quickly close the door.", "Bake the loaf for about 45 minutes or until nicely browned.", "Allow the loaf to cool to room temperature before cutting into it. The gluten-free bread will be quite gummy if you cut into it before it is totally cooled. Using a sharp serrated Bread Knife is the best for cutting this loaf.", "If you don’t finish the loaf in one or two days, wrap it well and freeze it for another time.", "It also makes wonderful toast the next morning, and you can use up the remaining dough over the next 5 days (if you used egg whites), or 10 days (if you only used water)."]}, {"id": "KODH", "title": "Gluten-free zucchini loaf bread", "image": "https://images.yumprint.com/p1yumprint8i/8i9r7diMi97yQe3xfSlqoIAOczwzpXdcqd4ByismpKkpoA5TiswnCV6Rxh-AB3J4", "link": "https://theheartysoul.com/gluten-free-zucchini-bread-recipe/?utm_source=snjv&fbclid=IwAR1Eq85qIeOf5Lsxi2-q1YsNq87bIgfGXFl7sUx0IkhikqJHVT3NpvGYhDw", "ingredients": ["1/8 cup raw honey", "1/8 cup coconut butter, melted", "2 tablespoons lemon juice", "Pinch of Himalayan salt"], "directions": ["Preheat oven to 350 degrees F.", "In a small bowl, combine the cashew milk and apple cider vinegar, stir well and allow to sit for 5 minutes", "Combine the gluten-free flour, poppy seeds, salt and baking powder in a medium bowl", "In a separate large bowl, beat the eggs and add in the melted coconut oil and coconut sugar, whisk until evenly blended. Add the lemon juice, fermented cashew milk, and lemon zest. Blend again until evenly incorporated.", "Squeeze any excess moisture from the zucchini and fold into the wet mixture. Add the dry ingredients to the wet and blend together until well combined.", "Pour the batter into a greased 9×5 /10×4 loaf pan and bake for 40-45 minutes, or until a toothpick comes out clean.", "In the meantime prepare the glaze; melt the coconut butter and then add to a small bowl, whisk in the raw honey and lemon juice until creamy and well incorporated.", "After the loaf is baked, add the glaze to the top of the bread while still warm, allow the glaze to set before cutting and serving."]}, {"id": "A-uR", "title": "Gourmande in the Kitchen", "image": "https://images.yumprint.com/p1yumprintjk/jk96FZIw5nr4A7jhlB0cE0iUsezjdXrREOGDfVami1gIrlG-rz7mZSPpDXxGuyCg", "link": "http://gourmandeinthekitchen.com/french-spice-bread-pain-depices/?utm_content=buffer51f18&utm_medium=social&utm_source=facebook.com&utm_campaign=gitkbuffer", "ingredients": ["4 large eggs", "½ cup/128g cashew butter", "½ cup/128g roasted almond butter (smooth)", "½ cup/120ml orange blossom honey", "1 ½ teaspoons ground cinnamon", "1 ½ teaspoons ground ginger", "½ inch piece of fresh ginger, peeled and grated", "1 teaspoon ground cloves", "1 teaspoon freshly grated nutmeg", "1 teaspoon ground aniseed", "¼ teaspoon ground black or white pepper", "The zest of 1 medium orange", "½ teaspoon baking soda"], "directions": ["Preheat the oven to 350°. Prepare two 6 inch loaf pans.", "Whisk together the eggs, cashew butter and almond butter until smooth. Stir in honey, spices, orange zest and baking soda until well combined.", "Scrape the batter into the prepared pans and place on a baking sheet. Bake for about 30-35 minutes, until the loaves are puffed and browned and a cake tester inserted in the center comes out clean. Transfer the loaves to a rack and let cool to room temperature.", "NOTE: The loaves can be stored in an airtight container at room temperature for 5 days."]}, {"id": "BrTJ", "title": "Grain Free French Crêpes", "image": "https://images.yumprint.com/p1yumprintl1/L1IujMSpBShvI0t8gNn4lXCz1EmaQ7I3pcg9jlLjMmoaTmKnPqMb0CPR2MPxzLjK", "link": "http://www.prepareandnourish.com/2015/12/grain-free-french-crepes-recipe/?utm_content=buffer0ca06&utm_medium=social&utm_source=facebook.com&utm_campaign=gitkbuffer", "ingredients": ["3 medium eggs, room temperature", "4T melted butter", "1t honey", "½t fine sea salt (my pick)", "¾c cassava flour (my pick)", "2c milk (plus more as needed)", "additional butter for frying"], "directions": ["First crepe (or two) may not always turn out perfectly. It is totally appropriate that you do a taste test to make sure they are good and continue with the rest.", "You may need to butter the pan every so often (after 3-4 crepes). Simply add ¼ teaspoon of butter onto the pan and swirl to be sure there's a good amount of fat covering the pan.", "Use a measuring cup to deliver just enough batter onto the pan (1/4 cup works perfectly!).", "Be sure to stir the batter every so often as flour settles on the bottom, changing the consistency of it. You may need to add a few tablespoons of additional milk as you come towards the end of your batter supply."]}, {"id": "xahN", "title": "Grain-free Savory Breakfast Muffins {gluten-free, paleo, nut-free}", "image": "https://images.yumprint.com/p1yumprint-w/-WN-sm0y5hlVYXnWadqq_j4wr9XIog0SiVdg6kMT1R1cHJybCCgFYRLS3NkHwOA8", "link": "http://tasty-yummies.com/2016/02/18/grain-free-savory-breakfast-muffins/", "ingredients": ["crumbled feta, goat cheese or shredded cheddar, optional", "crumbled bacon, sausage, chopped ham or other meat", "fresh herbs: basil, oregano, etc", "other veggies: chopped or shredded zucchini, asparagus, peas, broccoli, cherry tomatoes, mushrooms, carrots, celery, onion, garlic, scallions,"], "directions": ["Preheat oven to 350ºF. Line a standard-sized muffin tin with parchment paper muffin cups.", "Place the eggs into a blender jar and blend on low until they become whipped and increase in volume.", "Add the coconut flour, coconut milk, arrowroot starch, sea salt, pepper, baking soda and baking powder to the blender. Blend until the ingredients are well incorporated, stopping to scrape the sides of the jar with a spatula as needed.", "Pour the batter into a large mixing bowl. In a small bowl, toss in the greens, scallions, bell pepper and any other veggies, herbs or meat and cheese that you are adding.", "Scoop the batter evenly into the lined muffin tin, sprinkle each muffin with some hemp seeds and bake for 35-40 minutes or until golden brown and a toothpick inserted into the center comes clean. Top the finished muffins with chopped chives.", "Muffins will keep up to one week in the refrigerator or can also be frozen. If freezing, allow to thaw in the refrigerator overnight."]}, {"id": "KGFZ", "title": "Grain-free Spinach Tortillas", "image": "https://images.yumprint.com/p1yumprintcw/CwSTE_H9MzD3YzVACN1Xtz67gbqOcrqfBCBV1I3GOiCfoUKafyDVrBUi6JNDEFc1", "link": "http://tasty-yummies.com/grain-free-spinach-tortillas/?fbclid=IwAR2I2nve7bsdg1N-OxnitZuGZoS4EbpfuwAjooQRNhTX20cBtoiLH0m2ZSE", "ingredients": ["4 cups DOLE Organic Baby Spinach", "½ cup filtered water, divided in half", "1 cup cassava flour (I use this brand)", "1 tablespoons finely ground golden flaxseeds*", "¼ teaspoon sea salt (to taste)", "3 tablespoons fat of choice (palm shortening, lard, olive oil or avocado oil)"], "directions": ["Add the baby spinach and ¼ cup of the water to a medium sauce pan over medium heat. Cover. Steam the spinach until just wilted. Remove from the heat. Add the spinach, the cooking water and the additional ¼ cup water to a blender and puree until smooth and there are not bits of spinach visible. Set aside to cool slightly.", "In a large bowl whisk together the flour and the flax seed meal and salt. Add the fat and begin mixing together with your hands until its crumbly and sandy. Add the spinach purée, start with half and continue working with your hands. Add more of the spinach puree slowly, as needed. Continue to work with your hands. The dough will feel sticky at first, but as you work it, the flour absorbs the liquid and the dough should feel soft and pliable, not at all crumbly.", "Separate and roll the dough into 4-6 evenly sized balls and wrap in plastic while you are prepping everything, to keep them from drying out. (I find weighing the dough balls out give the best results. I make each tortilla ball around 60-65 grams for an 8.5 to 9-inch tortilla.)", "Place the dough ball between two sheets of parchment, gently press the ball down into a disc with your hand. Place the dough on a tortilla press or simply roll out by hand with a rolling pin, to your desired thinness. I do a combination of the press and the rolling pin to get to the perfect even thinness I prefer. This is the tortilla press I use: http://amzn.to/2jvuw5q", "Heat a cast iron griddle or pan over medium heat until evenly heated.", "Working with one tortilla at a time, peel off the top piece of parchment paper and carefully place the tortilla onto the hot pan, peeling off the other piece of parchment, slowly. Cook for a minute or less, until it starts to bubble just slightly and brown just a little, you don't want to overcook it through or it will get crispy, dry and won't roll as nicely.", "Flip to the other side and cook another minute or so until cooked. Checking often.", "Remove from the pan and place on a towel (or paper towel) lined plate and continue cooking the rest.", "Store the cooked tortillas, covered or wrapped in the fridge. Let come to room temperature and reheat on a griddle or pan until softened and warmed. Dough can be made ahead of time, up to a few days, be sure to let the dough come to room temperature before rolling out."]}, {"id": "liug", "title": "Grain-Free Thanksgiving Stuffing", "image": "https://images.yumprint.com/p1yumprintzt/ZT0ZkSia5iCJmEwp3HNX5P74L6c1HaxytdJk4f76J3WKoIIoE7MXXdkPf2EZUgHW", "link": "http://againstallgrain.com/2011/11/21/grain-free-thanksgiving-stuffing/", "ingredients": ["1 tablespoon extra virgin olive oil", "1 yellow onion, chopped", "2 celery stalks (leaves included), chopped", "2 garlic cloves, minced", "3 sprigs parsley, chopped", "1 sprig rosemary, chopped", "2 sprigs thyme, chopped", "2 sage leaves, chopped", "1/2 cup cremini mushrooms, chopped", "1/2 pound sweet italian sausage (SCD legal)", "1 medium fuji apple, chopped with skin on", "6 cups bread cubes", "3 eggs, lightly beaten", "1/4 cup dry vermouth", "1-1/4 cups turkey stock (or SCD legal chicken broth)", "2 teaspoons sea salt", "1/2 teaspoon pepper", "7 tablespoons salted butter"], "directions": ["Combine all bread ingredients (except for the flour and water) in a food processor and blend until smooth.  Add the flour and water and pulse until dough is combined. Dough will be a very sticky consistency.", "Grease a 9×9 pan and put a rectangular piece of parchment paper at the bottom. This will help the loaf come out easily. Spread a little more oil on top of the parchment piece.", "Fold the dough into pan and even it out with a spatula.", "Bake at 325° for about 35 minutes. Careful to not let the top burn.", "While the bread is baking, saute the celery, onions, garlic, sausage, apples, herbs and mushrooms in 1 tablespoon olive oil for about 15 minutes. Add the vermouth and bring to a boil. Remove from heat while you wait for the loaf to bake and cool.", "Once the bread has cooled, slice it in half lengthwise to make two thin loaves.  Next, slice it into 1/2 inch strips and then across those cuts to make small cubes.", "Coat with 5 tbsp melted butter. Place on a cookie sheet and toast in the oven for 30 minutes on 300° turning occasionally. The bread should come out golden brown and slightly dry.", "Toss the bread crumbs with the sauteed mixture, eggs, salt and pepper, and turkey stock.", "Transfer stuffing to a well buttered baking dish and sprinkle the additional 2 tablespoons of butter on top.  Cover with foil, and bake at 350° for 35 minutes. Uncover and bake 15 minutes until top is golden.", "Tip : make the bread and toast it a couple of days before and store the toasted cubes in a ziplock. You can also saute the mixture the night before Thanksgiving and then put it all together right before baking."]}, {"id": "JLqe", "title": "Healthy 5 Minute Gluten Free Paleo Bread", "image": null, "link": "https://paleoglutenfree.com/recipes/healthy-5-minute-gluten-free-paleo-bread/amp/?fbclid=IwAR0AnO8tdO-MwRe5R14Zn6qvdZgEIEl35trdgcKLdFHQcUEXM7lCBhzSOPA", "ingredients": ["1 cup almond flour", "3/4 cup arrowroot flour", "1/2 cup golden milled flax meal", "1/3 cup coconut oil Solid- not melted", "4 medium eggs", "1/4 cup water room temp", "2 tablespoons maple syrup", "1 teaspoon apple cider vinegar", "1/2 teaspoon sea salt", "2 teaspoons baking powder"], "directions": ["Preheat oven to 350F. Line a standard bread pan with parchment paper.", "In a blender or food processor, combine all of the ingredients for the bread.", "Pour the batter into the loaf pan. Bake on 350F for 35 minutes until golden on top."]}, {"id": "p-zL", "title": "Healthy Double Chocolate Zucchini Muffins", "image": "https://images.yumprint.com/p1yumprintug/UgScGNot0Md5AnsQOfv3HlI_NszcDWfYU88xDELac9qWz7ylsE-VuMcU6K0pUkmQ", "link": "http://www.ambitiouskitchen.com/2014/07/healthy-double-chocolate-zucchini-muffins/", "ingredients": ["1 ¼ cup whole wheat pastry flour or white whole wheat flour", "1/3 cup unsweetened cocoa powder", "1 teaspoon baking soda", "¼ teaspoon salt", "2 tablespoons coconut oil", "1/3 cup honey or agave nectar", "1 teaspoon vanilla", "1 egg", "1 egg white", "1 cup shredded zucchini (about 1 medium)", "¼ cup unsweetened applesauce", "½ cup Almond Breeze Unsweetened Almond Milk", "½ cup regular or mini chocolate chips", "Make a Cheesy Sausage Breakfast Casserole"], "directions": ["Preaheat oven to 350 degrees F. Line 12 cup muffin tin with cupcake liners and generously spray inside of liners with nonstick cooking spray.", "Squeeze shredded zucchini of excess water with a paper towel. This is important, so don’t forget!", "In a medium bowl, whisk together flour, cocoa powder, baking soda, and salt; set aside.", "In the bowl of an electric mixer, add coconut oil, honey, vanilla, egg and egg white; mix on medium-low until smooth and well combined. Add in zucchini, applesauce, and almond milk; mix again. Slowly add in dry ingredients and mix until just combined. Gently fold in chocolate chips.", "Evenly divide batter into prepared liners. Bake 22-25 minutes or until toothpick inserted into middle comes out clean. After 5 minutes, remove muffins and transfer to wire rack to finish cooling. Enjoy!"]}, {"id": "BCle", "title": "Healthy Zucchini Bread", "image": "https://images.yumprint.com/p1yumprintif/IFLK7ujhQt7iOhQIJ9bxDq5OA8HAKxK3eb9lyJ3pPXmVOlrwkIsFMZNST2P34FSp", "link": "http://www.eat-yourself-skinny.com/healthy-zucchini-bread/", "ingredients": ["1 cup unbleached all-purpose flour", "½ cup whole wheat flour", "1 tsp. baking powder", "½ tsp. baking soda", "1½ tsp. cinnamon", "¼ tsp. nutmeg", "½ tsp. salt", "1 egg", "½ cup plain Greek yogurt", "¼ cup coconut oil, melted and cooled", "½ cup honey", "2 Tbsp brown sugar", "1 tsp. vanilla", "1½ cups grated zucchini, water squeezed out"], "directions": ["Preheat oven to 350 degrees. Prepare a 8\" x 4\" loaf pan with oil or parchment paper.", "In a large bowl, whisk together flours, baking powder, baking soda, cinnamon, nutmeg and salt until combined.", "In a medium bowl, mix together egg, yogurt, coconut oil, honey, brown sugar and vanilla then add grated zucchini. Fold in flour mixture until all combined and pour mixture into prepared loaf pan.", "Bake for 45 min to an hour or until a toothpick inserted in the middle comes out clean. Remove bread from the pan and allow to cool on a wire rack for about 10 minutes. Slice and enjoy!"]}, {"id": "t2A3", "title": "Heart-Healthy Pumpkin Bread Recipe ", "image": "https://images.yumprint.com/p1yumprintws/Ws6vLvoN2tog9FaONcChuxcmKVKljR_aTM2YbK03KX42TqGjV6NZIaO6fB9mINva", "link": "http://www.healthy-holistic-living.com/healthy-pumpkin-bread-for-fall.html", "ingredients": ["1 cup of blanched almond flour", "¼ teaspoon of Celtic salt", "½ teaspoon of baking soda", "1 tablespoon of ground cinnamon", "1 teaspoon of ground nutmeg", "½ teaspoon of cloves", "½ cup of roasted pumpkin", "2 tablespoons of organic raw honey", "¼ teaspoon of stevia", "3 large free range organic eggs"], "directions": ["In a food processor mix the almond flour, salt, baking soda, and spices together. Add the pumpkin, stevia, honey, and eggs to the dry ingredients and pulse for two minutes. Scoop the batter into a parchment paper-lined loaf pan and bake at 350° for 35-45 minutes. Let it cool for an hour, serve and enjoy!"]}, {"id": "GevW", "title": "Herb & Cheddar Gougères", "image": "https://images.yumprint.com/p1yumprintmx/mxY73qG1_mh3OAw77907UNOLDtxDBMZGkNhBKPK_EBrgIqXt3mofhb4PJaCj-V09", "link": "http://www.eatingwell.com/recipe/260940/herb-cheddar-gougeres/?utm_source=facebook&utm_medium=social&utm_campaign=etg_1151153301_editorialcontent", "ingredients": ["¾ cup water 4 tablespoons unsalted butter ¼ teaspoon salt ¾ cup all-purpose flour 2 large eggs 1½ cups shredded extra-sharp Cheddar cheese 1 teaspoon Dijon mustard 1 teaspoon chopped fresh thyme ½ teaspoon chopped fresh rosemary"], "directions": ["Position racks in upper and lower thirds of oven; preheat to 400°F. Line 2 large baking sheets with parchment paper. Combine water, butter and salt in a medium saucepan. Bring to a simmer over medium-high heat. Reduce heat to medium-low, add flour and mix vigorously with a wooden spoon to form a smooth dough. Cook, stirring, for 2 minutes. The dough should dry out slightly and pull away from the pan. Scrape the dough into a medium bowl and let cool for 2 minutes. Using a wooden spoon, beat eggs one at a time into the dough, beating thoroughly after each addition. The batter will separate after each egg, but keep stirring: it will come back together. Add cheese, mustard, thyme and rosemary and fold to combine. Transfer the dough to a pastry bag fitted with a round ⅜- to ¾-inch pastry tip (or use a gallon-size plastic bag with about ¾ inch snipped off a corner). Pipe 25 small mounds of dough onto each prepared baking sheet, making each a littler wider than a quarter. Bake, rotating the pans front to back and top to bottom halfway through, until puffed and golden, 18 to 20 minutes. Serve warm."]}, {"id": "xnJW", "title": "Honey Oat Quick Bread", "image": "https://images.yumprint.com/p1yumprinte9/e9-9ESoy7GYdMaR9jSiTl0jW0gmXp3ZVJy1vA-_2FrihIpsjYv-XwJcoUgdHJp6F", "link": "http://www.eatingwell.com/recipes/honey_oat_quick_bread.html", "ingredients": ["2 tablespoons plus 1 cup old-fashioned rolled oats, or quick-cooking (not instant) oats, divided", "1 1/3 cups whole-wheat flour, or white whole-wheat flour (see Tip)", "1 cup all-purpose flour", "2 1/4 teaspoons baking powder", "1/4 teaspoon baking soda", "1 1/4 teaspoons salt", "8 ounces (scant 1 cup) nonfat or low-fat plain yogurt", "1 large egg", "1/4 cup canola oil", "1/4 cup clover honey, or other mild honey", "3/4 cup nonfat or low-fat milk"], "directions": ["Position rack in middle of oven; preheat to 375°F. Generously coat a 9-by-5-inch (or similar size) loaf pan with cooking spray. Sprinkle 1 tablespoon oats in the pan. Tip the pan back and forth to coat the sides and bottom with oats.", "Thoroughly stir together whole-wheat flour, all-purpose flour, baking powder, baking soda and salt in a large bowl. Using a fork, beat the remaining 1 cup oats, yogurt, egg, oil and honey in a medium bowl until well blended. Stir in milk. Gently stir the yogurt mixture into the flour mixture just until thoroughly incorporated but not overmixed (excess mixing can cause toughening). Immediately scrape the batter into the pan, spreading evenly to the edges. Sprinkle the remaining 1 tablespoon oats over the top.", "Bake the loaf until well browned on top and a toothpick inserted in the center comes out clean, 40 to 50 minutes. (It’s normal for the top to crack.) Let stand in the pan on a wire rack for 15 minutes. Run a table knife around and under the loaf to loosen it and turn it out onto the rack. Let cool until barely warm, about 45 minutes.", "Make Ahead Tip: Store cooled bread, tightly wrapped, for up to 1 day at room temperature. If desired, warm (wrapped in foil) at 375°F before serving.", "Tip: White whole-wheat flour, made from a special variety of white wheat, is light in color and flavor but has the same nutritional properties as regular whole-wheat flour. Two companies that distribute the flour nationally are King Arthur Flour (kingarthurflour.com) and Bob's Red Mill (bobsredmill.com)."]}, {"id": "Kj0s", "title": "Keto Two Minute Burger Bun", "image": "https://images.yumprint.com/p1yumprintqz/QzR2ObF50VB0JeFloeqmvSOIX0xfyAIlYNoil3aVMlQdmbO3PV3G7kq2o10QUnAI", "link": "https://castleinthemountains.com/keto-two-minute-burger-bun/", "ingredients": ["1 cup tomato paste (240g / 8.5 oz)c", "¼ cup apple cider vinegar or white / red wine vinegar", "1 small onion (60g / 2.1 oz)", "2 cloves garlic", "⅛ tsp ground allspice", "⅛ tsp ground cloves", "2 tbsp or to taste of Erythritol   (20g / 0.7 oz)", "1 tsp salt", "pinch black pepper ( I like fresh ground)", "If it’s too thick add water by the tablespoon until its just right"], "directions": ["Peel and cut the onion and garlic in smaller pieces. Have all the other ingredients on hand ready to be used. You can use any vinegar you like such as apple cider or white / red wine vinegar.", "Place everything in a blender or use an immersion blender and pulse until smooth.", "Pour into a saucepan over medium heat until you start to see small bubbles. Reduce to low and stir constantly for ten minutes.", "You’re done! Pour in a glass jar and keep in the fridge up to a month.  If you would like to preserve for longer try water bath canning."]}, {"id": "tb_E", "title": "Lemon Zucchini Bread with Blueberries", "image": "https://images.yumprint.com/p1yumprintak/AkVHI8-Ng4oZ-N7SnW588BVvpoLRg2BWSsjSvjrhdwZeBH6zJkNb2NQHEpSY3zQI", "link": "http://amandascookin.com/lemon-zucchini-bread/", "ingredients": ["1 cup powdred sugar, sifted", "2 tablespoons fresh lemon juice"], "directions": ["Preheat oven to 350 F. Butter and flour a 9x5 loaf pan.", "whisk together flour, baking powder and salt and set aside.", "Beat eggs with mixer until light yellow.", "With mixer on low-medium speed, add oil and sugar, then buttermilk, lemon juice and zest.", "Fold in zucchini.", "Stir in dry ingredients just until combined.", "Gently fold in blueberries.", "Transfer batter to prepared pan and bake for 45-55 minutes.", "Cool in pan on wire rack for 15 minutes.", "Remove from pan and cool completely.", "Prepare glaze by carefully combining ingredients and drizzle over top of bread."]}, {"id": "IZJT", "title": "Lemon Zucchini Cake", "image": "https://images.yumprint.com/p1yumprintof/OFr5eGDMK3a6Y44b086bRPn4xJH1wt49xAK3ALoW-esa0J0s69-8jHQZE1OB4dvw", "link": "https://www.momontimeout.com/lemon-zucchini-cake-recipe/", "ingredients": ["1 cup powdered sugar", "1-2 tbsp lemon juice"], "directions": ["In a small bowl, combine powdered sugar and lemon juice. Whisk until smooth.", "Drizzle the glaze over the cake.", "Slice and serve."]}, {"id": "Kjcz", "title": "Low Carb Cauliflower Breadsticks", "image": "https://images.yumprint.com/p1yumprint1m/1MKjzYYo6bbrYjyffM8FnCNjCsUXgv1Zc4gJ1Rh0-yZZvORejuo4vu6tWTDvV09R", "link": "https://realhousemoms.com/low-carb-cauliflower-breadsticks/?fbclid=IwAR28fPxVlr8gIYpCjvVmSrJFP5TSOUKJaQahlCRASSEmRjRCvQwj8YWS1hw", "ingredients": ["1 head cauliflower raw", "1/2 cup Mozzarella Cheese shredded", "1/2 cup Parmesan Cheese shaved", "1 large egg", "1/2 tablespoon garlic minced", "1/2 tablespoon fresh basil chopped", "1/2 tablespoon fresh Italian flat-leaf parsley chopped", "1 teaspoon salt", "1/2 teaspoon ground black pepper", "3/4 cup Mozzarella Cheese shredded"], "directions": ["Preheat oven to 425°F and line a baking sheet with parchment paper or a silicone baking mat.", "Rice the cauliflower by coring it and breaking it into florets. Then place it in the bowl of a food processor and pulse until it is the texture of rice. (If your cauliflower seems excessively moist, squeeze the riced, raw cauliflower in a paper towel to help remove moisture.)", "In a large bowl, mix the riced cauliflower, 1/2 cup shredded Mozzarella cheese, 1/2 cup Parmesan cheese, 1 egg, 1/2 tablespoon fresh garlic, 1/2 tablespoon fresh basil, 1/2 tablespoon fresh parsley, 1 teaspoon salt, and 1/2 teaspoon black pepper until combined and holds together. Place the mixture onto the lined baking sheet and spread out into a rectangle about 9x7\" and 1/4\" thick.", "Bake in the preheated oven for 10-12 minutes. Remove from oven and top with 3/4 cup shredded Mozzarella cheese and return to oven to continue baking until the cheese is melted and starting to brown. Cool about 10 minutes and cut into 'breadsticks'. Garnish with fresh herbs and Parmesan cheese. Serve with your favorite Red Sauce and enjoy!"]}, {"id": "Kqa7", "title": "Low-Carb Blueberry Muffins", "image": "https://images.yumprint.com/p1yumprintcp/cPHT9VzThqf1Tjyh1cBdbiW9jeb2I2BRYr-M4hhiAfzSrwN4ja-4cSeGF-pUubdi", "link": "http://www.eatingwell.com/recipe/269494/low-carb-blueberry-muffins/", "ingredients": ["1¾ cups almond flour", "¼ cup coconut flour", "1 tablespoon baking powder", "¼ teaspoon baking soda", "¼ teaspoon salt", "1 cup blueberries", "3 large eggs", "½ cup reduced-fat milk", "⅓ cup plus 2 tablespoons light brown sugar", "¼ cup avocado oil", "1½ teaspoons vanilla extract"], "directions": ["Preheat oven to 350°F. Generously coat a muffin tin with cooking spray. Sift almond flour, coconut flour, baking powder, baking soda and salt together in a large bowl. Add blueberries and toss to coat. Whisk eggs, milk, brown sugar, oil and vanilla in a medium bowl. Add to the dry ingredients and stir until combined. Divide the batter among the muffin cups (about ¼ cup batter per cup). Bake the muffins until lightly browned around the edges and a toothpick inserted in the center comes out clean, 20 to 25 minutes. Let cool in the pan on a wire rack for 20 minutes. Run a knife around the edges and remove from the tin to cool completely."]}, {"id": "Kj1u", "title": "Low-Carb Keto flatbread", "image": "https://images.yumprint.com/p1yumprintad/AdJDqeO1zvoNBc6H-9TawiGYqACH2pVLmxEUSXgzkpUHC9qxkDqRFTbh8xvROhKi", "link": "https://mouthwateringmotivation.com/2018/06/02/the-amazing-8min-low-carb-flatbread/", "ingredients": ["2 tbsp coconut flour", "1 tbsp almond flour", "2 tbsp vital wheat gluten (do not sub! This is the protein extracted from bread that gives it it’s elasticity. It has virtually no carbs and works great in low-carb baking to give items a more traditional feel!)", "1/4 tsp baking powder", "pinch of baking soda", "1/8 tsp salt", "1 tsp parmesan and herb seasoning (OR any other seasonings you prefer!)", "2 tbsp + 1 tsp(65g) full fat sour cream", "Olive oil: optional, for brushing"], "directions": ["Preheat oven to 450*F.", "Combine all dry ingredients in a small bowl.", "Add the sour cream and stir until a dough forms.", "Roll the dough into a ball and place on a greased baking sheet.", "Roll the dough out to your desired thickness, it will rise just slightly. Roll it thinner if you want a crispier result.", "Brush the dough with olive oil and sprinkle any toppings you’d like such as shredded cheese, parmesan etc.", "Bake for 5min (or longer for crisper texture), you don’t need to flip the bread but you can half-way through if you’d like both sides to be browned.", "Enjoy!", "(I enjoyed mine torn into pieces with some spinach dip!)"]}, {"id": "fAPt", "title": "Oatmeal Buttermilk Breakfast Scones with", "image": "https://images.yumprint.com/p1yumprint14/14JQclUjEZLj32gKnJjWa3k6fY9hF6u3ucK_ELZY4DOFyHMTFqyXQPyCIjn5DpOt", "link": "http://www.inspirededibles.ca/2013/12/oatmeal-buttermilk-breakfast-scones.html#disqus_thread", "ingredients": ["1 + 3/4 cups (420 mL) spelt flour (or flour of choice)", "2 cups (500 mL) 100% pure rolled oats", "4 Tbsp (60 mL) demerara sugar, substitute brown sugar", "2 + 1/2 tsp (12.5 mL) baking powder", "1/2 tsp (2.5 mL) baking soda", "12 Tbsp (3/4 cup/170 grams) chilled coconut oil or old fashioned butter, cut into piece", "1/2 cup (125 mL) buttermilk + a touch for brushing tops of scones", "1 large egg", "1 Tbsp (15 mL) orange zest", "2 tsp (10 mL) vanilla extract", "1/2 cup (125 mL) dried cranberries + handful for decorating top of dough", "1/3 cup (80 mL) pistachios, shelled and chopped + another pinch for decorating top of dough", "Makes about 16-18 biscuits, 196 calories each"], "directions": ["Preheat oven to 375 F.", "Combine the first 5 ingredients in a blender/food processor and pulse until combined.", "Add 1/2 cup cranberries, 1/3 cup pistachio and the coconut oil or butter and pulse until coarse meal forms. Transfer to a large bowl. (Note: the blender/food processor will grind your fruit/nuts into tiny bits. If you prefer to keep your cranberries/pistachios larger sized, simply add to 'dry' ingredient bowl following the processing part).", "In a separate smaller bowl, combine: buttermilk, egg, orange zest and vanilla, whisking to combine.", "Add wet ingredients to 'dry' ingredients and mix with a fork just until dough forms -- do not overmix. If the dough is too wet or too dry simply add a small amount of flour/oatmeal or buttermilk as required (it's helpful to have some extra flour/oatmeal as well as buttermilk beside you in case you need to make adjustments).", "Turn the dough out onto a lightly floured surface and knead four or five times. Spread and pat the dough out into a 3/4-inch thick (approximate) round.", "Cut out as many scones as possible using a 2 + 1/4-inch (or so) cookie cutter (a small glass or inverted wine glass will work just fine).", "Gather scraps, reshape, and cut out more scones.", "Transfer scones to a gently floured baking sheet/s and brush tops with buttermilk and sprinkle of sugar, if desired.", "Bake scones until just golden, about 12-18 minutes, in the middle of the oven  (watch carefully as oven temperatures will vary - see notes above).", "Allow scones to cool slightly before relishing!"]}, {"id": "vHzT", "title": "Oopsie Bread", "image": "https://images.yumprint.com/p1yumprintn4/n4ysrjEgK4oCl_Gc6TxZyvyhNpe_YOV4Apf23yc8QWrAmemEVnzK_iI1JAutSkk0", "link": "http://www.food.com/recipe/oopsie-bread-497736", "ingredients": ["3 eggs", "1⁄2 cup cream cheese", "1 pinch salt", "1⁄2 tablespoon psyllium husks (optional)", "1⁄2 teaspoon baking powder (optional)"], "directions": ["Separate the eggs, with the egg whites in one bowl and the egg yolks in another.", "Whip the egg whites together with the salt until very stiff. You should be able to turn the bowl over without the egg whites moving.", "Mix the egg yolks and the cream cheese well. If you choose, add the psyllium seed husk and baking powder (this makes the Oopsie more bread-like).", "Gently fold the egg whites into the egg yolk mix – try to keep the air in the egg whites.", "Put 6 large or 8 smaller oopsies on a baking tray.", "Bake in the middle of the oven at 150° C (300° F) for about 25 minutes – until they turn golden.", "You can eat Oopsies as bread or use them as a bun for a hotdog or hamburger. You can also put different kinds of seeds on them before baking them, for instance poppy, sesame or sunflower seeds. One big Oopsie can be used for a swiss roll: Add a generous layer of whipped cream and some berries. Enjoy."]}, {"id": "ACRp", "title": "Orange-Oatmeal Zucchini Bread Recipe", "image": null, "link": "http://www.motherearthnews.com/real-food/orange-oatmeal-zucchini-bread-zbcz1509.aspx", "ingredients": ["• 3 eggs", "• 1/2 cup safflower oil", "• 1/2 cup plain yogurt", "• Juice from 1 large orange", "• 1 cup granulated sugar", "• 1/2 cup packed brown sugar", "• Grated zest from 1 large orange", "• 3-1/2 cups grated zucchini", "• 3 cups all-purpose flour", "• Dash salt", "• 1 tsp baking soda", "• 1/2 tsp baking powder", "• 1 cup rolled oats"], "directions": ["Preheat oven to 350 degrees Fahrenheit.", "Grease two 8-1/2 x 4-1/2 inch loaf pans.", "Add eggs, oil, yogurt, orange juice, sugars, orange zest, and zucchini to a large bowl. Stir well to combine.", "Sift together flour, salt, baking soda, baking powder and rolled oats. Add to bowl.", "Stir until all ingredients are combined. Divide mixture between the two loaf pans.", "Bake for 50-60 minutes or until done. Test by inserting a toothpick in the center of the bread. When it comes out clean the bread is done.", "Let bread cool in pans for 15 minutes. Gently turn out onto a wire rack and cool completely before cutting."]}, {"id": "lrDg", "title": "Paleo Coconut Flour (Cornbread) Muffins", "image": "https://images.yumprint.com/p1yumprintya/YABmEN2aO6qcpV3dZOPEpX0nqed-cXonHpo-G5ny_jA6DnqkaYXQwh8htlbg6leH", "link": "http://empoweredsustenance.com/paleo-cornbread-muffins/", "ingredients": ["(Double recipe if desired)", "1/4 cup coconut flour", "1/4 cup coconut oil, butter or real lard, liquified", "2 eggs, at room temperature", "1 Tbs. unsweetened applesauce or, and this is really yummy, 100% pure apple butter", "1 Tbs. raw honey", "1/4 tsp. baking soda", "1 tsp. apple cider vinegar"], "directions": ["Preheat the oven to 350. Line 6 muffin cups with unbleached liners. Mix together the coconut flour and oil until smooth, then beat in the eggs until smooth. Add the remaining ingredients and stir well.", "Divide between the prepared cups and bake about 20 minutes, until a toothpick comes out clean and the top springs back when lightly pressed."]}, {"id": "KGF2", "title": "Paleo Coffee Cake Muffins", "image": "https://images.yumprint.com/p1yumprint7d/7dBm2RqE-Od2zEckrVxJW-rdJhvfDTPAOyeKo6rls3yyBpGFfrA4EfAM6FFYJYyu", "link": "https://paleorecipesecrets.com/recipes/paleo-coffee-cake-muffins/print/376/?fbclid=IwAR0JUmqRmvoNRRfWYgC-q35c_svHt8c8Ot36jKSUOM5FGJEyfIA3KwHfeoQ", "ingredients": ["2 cups almond flour", "1 teaspoon cinnamon", "½ teaspoon baking soda", "¼ teaspoon salt", "¼ cup coconut oil", "¼ cup honey", "2 eggs", "1 teaspoon vanilla", "Topping​", "1 ½ tablespoons coconut oil", "¼ cup coconut flour", "¼ cup coconut sugar", "1 tablespoon cinnamon", "Optional: melted coconut butter for drizzle"], "directions": ["Preheat the oven to 350 degrees and lightly grease or line a muffin tin. In a large", "mixing bowl, stir together the dry ingredients.", "Stir in the coconut oil, honey, eggs and vanilla until well combined. Spoon the", "batter into the prepared muffin tin.", "To make the crumb topping, stir together the coconut oil, coconut flour, coconut", "sugar and cinnamon. Distribute evenly on top of each muffin. Bake for 12-15", "minutes and let cool. Drizzle with melted coconut butter if desired."]}, {"id": "kYkS", "title": "Pasta da Pizza (Naples-Style Pizza Dough)", "image": "https://images.yumprint.com/p1yumprint6r/6RiWNJvDIr1nxnf3IOigNk1s_J3sM5vUzwPaHZCzlBwxKrsw-AeoC9Q7CSHP1z0E", "link": "http://www.saveur.com/article/Recipes/Pasta-da-Pizza-Naples-Style-Pizza-Dough", "ingredients": ["2 tbsp. sugar (⅞ oz.)", "1 tbsp. olive oil, plus more (½ oz.)", "½ tsp. active dry yeast", "5½ cups \"00\" flour, preferably Caputo Pizzeria Flour (1 lb. 12 oz.)", "2 tbsp. kosher salt (¾ oz.)"], "directions": ["Combine sugar, oil, yeast, and 2 cups cold water in bowl of a stand mixer fitted with a dough hook; let sit until foamy, 8-10 minutes. Mix flour and salt in a bowl. With motor running, slowly add flour mixture; mix until a smooth dough forms, 8-10 minutes. Transfer dough to a greased baking sheet; cover with plastic wrap. Let sit at room temperature 1 hour.", "Divide dough into 4 balls; transfer to a greased 9\" x 13\" dish; brush tops with oil. Cover with plastic wrap; refrigerate 48 hours."]}, {"id": "KWhi", "title": "Pecan Apple Muffins", "image": "https://images.yumprint.com/p1yumprint0v/0vpQfyE_HO7PziLwMh0DuDIfyo929qtS43U-HP-9jYf82v4XYY_PkYK8KJsDip3l", "link": "https://hormonesbalance.com/recipes/pecan-apple-muffins/?utm_source=facebook&utm_medium=post&fbclid=IwAR1D5KLWVQj8EvioOItdG66laKMLfu2zC4lVH9nyUCHHjJG1vvo4NudiIu4", "ingredients": ["1 cup oat flour", "1 cup teff flour (highly nutritious Ethiopian grain but found in our stores now too) or buckwheat or rice flour", "½ cup cornmeal flour (mainly to add some rough texture)", "1 tbsp baking powder", "½ tsp salt", "1 tsp ground cinnamon", "1.5 tsp ground cardamon", "2 tbsp flaxseed meal + 3 tbsp of water (this will replace the eggs)", "½ cup agave syrup", "½ cups almond milk", "1 cup coconut oil (do not keep in the fridge or it will be too hard) or olive oil", "1 inch fresh ginger or ½ tsp of dry ginger", "2 green apples", "1½ cups of pecan nuts"], "directions": ["Pre-heat the oven to 375F or 190C.", "Combine flaxseed meal + water and let it stand for a few minutes.", "Grate apples and ginger.", "Chop pecans to about quarter their full size.", "Combine all dry ingredients (flours, salt, baking powder, spices).", "Combine all wet ingredients (agave, coconut oil, milk).", "Mix dry, wet ingredients and flaxseed into a liquid dough; if it’s not liquid enough, add more almond/soy milk.", "Mix in apples and pecans.", "Bake for 25-30 min or till tops are firm."]}, {"id": "tVTd", "title": "Pineapple Zucchini Bread Recipe", "image": "https://images.yumprint.com/p1yumprintbd/bd8nlIWUEUnWBQL8bLxMxGZz83kxFNTRehp5VzBLT6WDjlMBbg1NWu5MmnOjIGvh", "link": "http://www.motherearthliving.com/food-and-recipes/recipes/pineapple-zucchini-bread-recipe-ze0z1304zwar.aspx", "ingredients": ["• 3 cups whole wheat flour", "• 1 teaspoon baking powder", "• 1 tablespoon baking soda", "• 1/2 tablespoon salt", "• 1/4 teaspoon nutmeg", "• 1/2 tablespoon cinnamon", "• 1/4 teaspoon cloves", "• 1 cup chopped walnuts (optional)", "• 1 cup raisins"], "directions": ["Mix the wet ingredients in a large bowl. Add the zucchini and pineapple, and mix well. Mix the dry ingredients in a medium bowl, and stir. Add the dry ingredients to the wet ones, stirring until the two are just mixed (over-stirring creates tough muffins). Add the nuts and raisins.", "Oil two bread pans of a 9-inch by 5-inch by 3-inch size, and pour in the mixture. Preheat the oven to 375 degrees, and place the pans on the middle rack of the oven. Bake the bread for 55 to 60 minutes. When cooked fully, the loaves will be dark brown and should have pulled away from the sides of the loaf pans. Insert a sharp knife or toothpick into the middle of each loaf, and make sure that the implement comes out clean. If so, they’re done. If not, bake them for additional time. Pineapple Zucchini Bread serves 6 to 8."]}, {"id": "JXnK", "title": "Pomegranate, Cranberry & Brie Bruschetta", "image": "https://images.yumprint.com/p1yumprintkg/kgKj-ZaAsP7AMdefZFa9xpG3JsXW4tBmbL5SL6F3MYKI56pMAxPY5gWiPqXLFdDy", "link": "http://www.eatingwell.com/recipe/269209/pomegranate-cranberry-brie-bruschetta/?utm_medium=social&utm_content=link_diabeticliving_recipes&utm_campaign=eatingwell_eatingwell&utm_term=2D18E7F0-EDAF-11E8-83A3-59710F4A2151&utm_source=facebook.com&fbclid=IwAR1CmBVq3Vlztrt9J4xb67cG_pC9Tp08VSIYmavyJbPvYzqGfOlIASqaevE", "ingredients": ["¾ cup pomegranate seeds", "½ cup fresh or frozen chopped cranberries", "2 tablespoons sugar (see Tip)", "1 teaspoon orange zest", "Dash salt", "Cooking spray", "⅛ teaspoon ground pepper", "1 (6 ounce) log brie cheese, cut diagonally into 16 slices", "1 tablespoon finely chopped fresh basil"], "directions": ["Combine pomegranate seeds, cranberries, sugar, orange zest, and salt in a small bowl. Cover and chill up to 3 days. To serve, preheat oven to 350°F. Place bread slices in a parchment paper-lined 15x10-inch baking pan. Lightly coat both sides of bread with cooking spray; sprinkle with pepper. Bake 8 minutes, turning once. Top with cheese. Bake 4 minutes more or until cheese is softened. Stir basil into pomegranate mixture and spoon on top of bruschetta. Serve warm.", "Tip: If using a sugar substitute, we recommend Splenda Sugar Blend for Baking. Follow package directions to use product amount equivalent to 2 tablespoons sugar. Nutrition Per Serving with Substitute: Same as below, except 75 cal."]}, {"id": "p-wR", "title": "Pumpkin Banana Bread", "image": "https://images.yumprint.com/p1yumprintkk/KkmgjNXNEINccHkErRm_T6T6fTQL75LxkFEQGNMv9U_4kVocTOLjns9IK5Dy9iai", "link": "http://www.confessionsofachocoholic.com/recipes/pumpkin-banana-bread", "ingredients": ["1 2/3 all-purpose flour", "1 teaspoon baking soda", "1 teaspoon pumpkin pie spice", "1/2 teaspoon salt", "1 cup plus 2 tablespoons sugar", "1 egg", "3/4 cup pumpkin puree", "3 1/2 bananas, very ripe, mashed", "2 tablespoons sour cream", "1 teaspoon vanilla extract", "1/4 cup dark rum", "2/3 cup walnuts, toasted"], "directions": ["Preheat oven to 350 degrees F.", "Line the bottom of a loaf pan (or three mini loaf pans) with parchment paper. You can also just spray it with baking spray or lightly brush it with butter.", "Sift together the flour, baking soda, pumpkin pie spice and salt.", "In a separate mixing bowl, beat sugar and egg with a whisk until light and fluffy, about 10 minutes.", "Add pumpkin puree, mashed bananas, sour cream, vanilla, and rum. Mix to combine. Fold in dry ingredients and nuts.", "Pour into a loaf pan/s and bake for about 45 minutes."]}, {"id": "x1Wt", "title": "Pumpkin Raisin Banana Bread", "image": "https://images.yumprint.com/p1yumprintjk/jkghE4uPna_QLE-Ga6puoyq0fjO5wfkGewihoObTV2osr-k0m29y__oBh0HO75As", "link": "https://www.swansonvitamins.com/blog/recipes/pumpkin-raisin-banana-bread?url=/blog/recipes/pumpkin-raisin-banana-bread&SourceCode=INTESDBR&rid=84779178&utm_source=exacttarget&utm_medium=email&utm_content=main-call-to-action-button&utm_campaign=INTESDBR", "ingredients": ["1 cup whole-wheat flour", "1/2 cup almond meal/flour", "1 cup old-fashioned oats", "1 teaspoon baking soda", "1 teaspoon baking powder", "1/2 teaspoon salt", "1 tablespoon cinnamon", "1/4 teaspoon ginger", "1/4 teaspoon nutmeg", "1/4 cup brown sugar (loosely packed)", "2 large bananas, mashed", "1 cup pumpkin puree", "2 eggs", "1/2 cup unsweetened applesauce", "3/4 cup raisins (or nuts or chocolate chips) (optional)"], "directions": ["Preheat the oven to 350° F.", "In a large mixing bowl, add all of the dry ingredients and stir until combined.", "Add all of the wet ingredients and mix until combined.", "Stir in the raisins (or nuts, chocolate chips, etc.).", "Pour into a lightly greased 9x5” loaf pan.", "Bake for 55-60 minutes, or until a toothpick comes out of the center clean.", "Let cool, slice and enjoy."]}, {"id": "vzI4", "title": "Sage and Roasted Parsnip Rustic White Bread", "image": "https://images.yumprint.com/p1yumprintkk/Kkx6LGVqXBnMI416pAVNE-MaBQRSRbGbjb-kW5j9QRHkvsdr3jsFsFlzFgBbloon", "link": "http://www.woodlandkeep.space/journal/2014/4/21/n9pycko0ewspzr4scphcbovkgufuoj", "ingredients": ["3 1/2 cups bread flour", "3/4 cup spelt flour", "1 1/2 cup grated roasted parsnip", "1 teaspoon instant yeast (2 teaspoons dry active yeast)", "2 1/2 teaspoons salt", "2 cups warm water"], "directions": ["Heat the oven to 425 and roast the grated parsnip for about 20 minutes, being sure to turn it in the pan about every five minutes.  Take out of oven and let cool.", "II.  Reserve about 1/4 cups of the bread flour and place it on a clean counter top.  Place the remaining flour with spelt flour and the roasted parsnip in a medium sized bowl.  Measure the salt and put it on one side of the flour and measure the yeast and put it on the other side of the flour.  Pour the warm water in the middle and begin to mix.  If you have a stand mixer, use the paddle attachment and mix on low speed until the dough just comes together.  If you don't have a stand mixer (like me!) than you can do this by hand, I find it to be therapeutic.  Just mix it together with a wooden spoon until it comes together, you can use your hands to help it a bit too.", "III.  Once your dough has formed a mass you can switch to the dough hook and mix on medium speed for about two minutes.  Or if you are doing it by hand you can continue mixing with a wooden spoon for about 5 minutes, occasionally putting the spoon in the middle of the dough and mixing from there.  If the dough is too sticky or dry feel free to add water or flour by the tablespoon.  After it has mixed let it rest for about 5 minutes.", "IV.  Add in your chopped sage and then let the dough mix for another 3 minutes, or another 5 minutes of hand mixing.  Place the dough on the counter and, using the flour reserved on the counter, knead the dough by hand.  If the dough already feels soft and firm you may only need to knead for a couple of minutes.", "Place the dough in a lightly oiled bowl, turning the dough over to coat the whole thing in oil.  Cover with a kitchen towel and place to rest in a warm spot for an hour and a half.  The dough should double in size.  Remove the dough from the bowl and then lightly punch the dough down and then reform it into a ball.  Return to bowl and allow to rest for another 30 minutes.", "VI.  After the second short rest place the dough on a lightly floured surface and cut into two pieces.  Form each piece into a round ball, tucking any haggard edges underneath the dough.  Cover with a damp cloth and then let rest for 45 minutes to an hour.", "VII.  During the last 20 minutes of the resting period preheat the oven to 425 degrees Fahrenheit.  Leave a baking sheet or stone to heat in the oven as well.", "VIII.  Right before the boules go in the oven slash the tops with a very sharp knife or a razor blade if you have it with 2 - 4 slashes.  I did squares, but x's or any design you'd like would work!  Carefully transfer the dough to the baking sheets and return to the oven.", "IX.  If you want a bit of caramel coloring on the crust of your bread - create steam in the oven!  You can pour about 1/4 cup of water on the bottom of the oven or take a water filled spray bottle and spray around the edges of the oven.  Wait 2 minutes and then repeat the process.", "Bake the loaves for 25-30 minutes.  They'll be golden and beautiful.  Let cool and then enjoy with honey or jam!"]}, {"id": "jFSJ", "title": "Savory Onion Muffins from the Grain Free Meal Plans", "image": "https://images.yumprint.com/p1yumprintnp/NPamVLWh32V_xsotVh8JXQdYd6g0PMqSfr0mrT2WCM0fKl428BzwHWe2BJmcUxMj", "link": "http://www.healthhomehappy.com/2014/09/savory-onion-muffins-gaps-diet-friendly.html?utm_source=rss&utm_medium=rss&utm_campaign=savory-onion-muffins-gaps-diet-friendly&mc_cid=571861b9be&mc_eid=f86acd7c8d", "ingredients": ["6 eggs", "2 small onions", "1/2 cup cheese ‘chunks’ (optional)", "1/4 cup coconut flour", "1/2 teaspoon salt"], "directions": ["Preheat oven to 375*", "Using a blender or food processor, puree onions. Add in coconut flour, eggs, and salt. Puree until coconut flour is well mixed in, then stir in optional cheese chunks.", "Grease a muffin pan or put in muffin liners. Fill the cups 1/2 full with batter, it should make 12. Bake for 17-20 minutes or until a knife inserted comes out clean. Allow to cool slightly before removing."]}, {"id": "Ej5p", "title": "Seeded Whole-Grain Quick Bread", "image": "https://images.yumprint.com/p1yumprinttu/TUcnZLQACoRsRTiQ-p5rLmdZ2PiWo0tYV3iI2vKuG-abVrebXGCukm2u2LadCwik", "link": "http://www.eatingwell.com/recipe/255165/seeded-whole-grain-quick-bread/", "ingredients": ["⅓ cup unsalted sunflower seeds⅓ cup unsalted pumpkin seeds3 tablespoons flaxseed3 tablespoons sesame seeds2 cups white whole-wheat flour", "½ teaspoon baking soda½ teaspoon salt1 tablespoon baking powder3 large eggs1½ cups buttermilk1 cup rolled oats½ cup avocado oil or extra-virgin olive oil2 tablespoons honey or pure maple syrup"], "directions": ["Preheat oven to 350°F. Coat a 9-by-5-inch loaf pan with cooking spray. Combine sunflower seeds, pumpkin seeds, flaxseed and sesame seeds in a dry medium skillet; toast over medium heat, stirring, until lightly brown and starting to pop, 5 to 7 minutes. Reserve 2 tablespoons of the seed mixture in a small bowl; transfer the remaining seeds to a large bowl. Add flour, baking powder, baking soda and salt to the large bowl; whisk to combine. Whisk eggs in a medium bowl, then stir in buttermilk, oats, oil and honey (or maple syrup). Pour the wet ingredients into the dry ingredients; stir and fold together until combined. Scrape the batter into the prepared pan. Sprinkle with the reserved seeds. Bake until golden brown and a toothpick inserted into the center of the loaf comes out clean, 45 to 55 minutes. Let cool in the pan for about 30 minutes before turning out onto a wire rack to cool completely."]}, {"id": "kaw1", "title": "Simple Paleo Tortillas", "image": "https://images.yumprint.com/p1yumprintdb/dbAimIsSCAoXS6eAyf1I4YgZiIPw5aPRSSuf-bLGaIjh3HxSmqGXwWU7-CvkwZTS", "link": "http://stupideasypaleo.com/2013/08/23/simple-paleo-tortillas/", "ingredients": ["2 eggs", "1t. melted ghee(sub melted coconut oil)", "(1T. water makes batter more spreadable/thin)", "1/4 cup arrowroot powder", "1 teaspoon coconut flour", "Pinch of salt", "If making crepes for a sweet application, add 1/4 teaspoon vanilla extract"], "directions": ["Crack the eggs into a medium-sized bowl and whisk in the melted ghee and water.", "Add the dry ingredients—arrowroot, coconut flour and salt—and beat well to combine.", "In a small (8″) skillet over medium heat, pour in about 1/3 of the batter and immediately roll it around to evenly coat the bottom. The tortilla should start to pull away from the edges as it cooks.", "Cook for 1 minute on each side."]}, {"id": "p-yf", "title": "Skinny Zucchini Banana Chocolate Chip Muffins {healthy, low-fat}", "image": "https://images.yumprint.com/p1yumprint2p/2PKtHB8P0_8R6E-lS8Wo2f1QTCvhu49QKfjXU9VtRR1AS3iotP8C92Co8ApC9dby", "link": "http://www.ambitiouskitchen.com/2013/08/skinny-zucchini-banana-chocolate-chip-muffins-healthy-low-fat/", "ingredients": ["1 1/2 cups whole wheat pastry flour", "1 1/4 teaspoon baking powder", "1/2 teaspoon baking soda", "1 1/2 teaspoons ground cinnamon", "2 small to medium ripe bananas, mashed", "1 teaspoon melted coconut oil", "1/4 cup honey", "1 teaspoon vanilla", "2 egg whites", "1 cup shredded zucchini (about 1 medium zucchini)", "2 tablespoons unsweetened applesauce", "1/3 cup nonfat plain greek yogurt (I used Fage)", "1/2 cup mini or regular chocolate chips (I like mini)", "Make a Cheesy Sausage Breakfast Casserole"], "directions": ["Preheat oven to 375 degrees F. Line 12-cup muffin tin with cupcake liners and generously spray inside of liners with nonstick cooking spray.", "Squeeze shredded zucchini of excess water with a paper towel! This is an important step.", "In medium bowl combine flour, baking powder, baking soda, and cinnamon; set aside.", "In bowl of an electric mixer, add mashed banana, oil, honey, vanilla and eggs; mix until smooth. Add in zucchini, applesauce, and yogurt and beat again until well combined. Slowly mix in dry ingredients until just combined. Remember not to over mix the batter -- we want moist muffins! Gently fold in 1/2 cup of chocolate chips.", "Evenly divide batter into muffin cups. The batter will probably reach the top of each muffin liner, but that's okay -- we're making big muffins! Alternatively you can reduce the size and bake 15 muffins. Bake for 20-25 minutes or until toothpick inserted into the middle comes out clean. Enjoy!", "Nutrition Information", "Serves: 12", "Serving size: 1 muffin", "Calories: 153", "Fat: 4.4g", "Carbohydrates: 27.2g", "Sugar: 12.6g", "Fiber: 3.0g", "Protein: 4.3g"]}, {"id": "KnDQ", "title": "Soft Gluten Free Sandwich Bread Recipe", "image": "https://images.yumprint.com/p1yumprintws/wSsoPRlkNqvYuJU1KeEfORtU5H4Ebc0QhnNM0pR7mnZKeLMJ_zHIW4c74tM2KRkI", "link": "https://alittleinsanity.com/soft-gluten-free-sandwich-bread-recipe/", "ingredients": ["2 Teaspoons Apple Cider Vinegar or Lemon Juice", "¼ Cup Olive Oil", "2 Large Eggs (see options for egg free below)"], "directions": ["Store any leftovers in a airtight bag on your counter for up to 2 days. Refrigerate or Freeze as needed, but be aware that Gluten Free bread will dry out quickly once chilled.  You can cover it & warm it in a microwave to help soften it again.", "Many thanks to Erika for the comprehensive instructions and to all who commented! Here are a few more tips, courtesy of Hodgson Mill. You can prepare the bread using either a 1 1/2 lb bread machine or a 9x5x3 bread pan, greased and dusted with cornstarch. If your bread machine does not have a gluten free cycle, your bread will not rise as high as it otherwise would. Heat the milk to 110 degrees and have all other ingredients at room temperature, so you may need to warm the eggs in a bowl of warm water. If you are using small eggs, use only two and add extra whites to equal 2/3 cup altogether. After you mix ingredients and place the thick batter in the pan, be sure to smooth the top with a wet spatula. After the short rise in the pan (25 to 30 minutes, or until dough reaches the top of the pan) bake in a preheated 375 degree oven for 60 to 65 minutes, but after the first ten minutes, cover with a double layer of foil, sealing the edges around the bread pan. After removing the bread from the oven (be sure to first check internal temperature, as Erika suggests!) turn the loaf out onto a wire rack. You should wait until it is completely cool before slicing. Refrigerate cooled loaves to preserve freshness. In lieu of rice flour, the Hodgson Mill mix contains garbanzo-fava flour and sorghum flour along with corn starch, tapioca starch and rice starch. Other ingredients that are not Erika’s recipe are soy lecithin and ascorbic acid, and the recipe does not call for baking powder."]}, {"id": "v-nS", "title": "Sourdough Bread (", "image": "https://images.yumprint.com/p1yumprintob/ObncdFWRH3zFRdHf5RPxkbXkA8uWDcFf-B9_KQCgEN8o42NGyUb-iS_AJb2F2Y2i", "link": "http://www.artofglutenfreebaking.com/2010/10/sourdough-bread-boule-gluten-free/", "ingredients": ["Special Equipment Needed", "-4 quart/3.8 liter Dutch oven w/a lid: Lodge, Le Creuset, Mario Batali, Martha Stewart, Dansk are all good brands", "-a 4 quart/3.8 liter bowl (one the same size as your Dutch oven)", "-heavy-duty stand mixer (this will work best, but a hand mixer will do in a pinch)", "-parchment paper and plastic wrap", "-spray bottle with water for spraying top of the crust", "-instant read thermometer is nice to double-check the interior temperature of finished bread, but you can do without it (they are cheap–get one!)30 oz/850 g (a bit less than 4 cups) sourdough starter (200% BP)", "15 oz/425 g (about 3 cups) mix of gluten-free flours", "–>I like a combo of equal parts sorghum, brown rice, and tapioca.  I have found that the bread works best with a mixture of 2 cups whole grain flours (I like sorghum and brown rice) and 1 cup tapioca flour.  It seems to work best if tapioca is one of the flours used–it’s a starch and it helps the bread be less dense than it already is. But don’t use all tapioca, white rice or sweet rice flours (100% BP)", "6 oz/170 g (3/4 cup) water (approximate–you may need more or less) (40% BP)", "2 teaspoon salt (2% BP)", "2 teaspoons xanthan gum (1% BP)", "2 tablespoon granulated sugar (4% BP)"], "directions": ["Place the mixing bowl from your stand mixer on the scale and set it to zero. Add the starter.  Add 5 oz/140 g  (about 1 cup) each of your 3 flours. Add salt, xanthan gum, and granulated sugar.", "Place bowl on mixer and fit with paddle attachment. Set the speed to low and mix for a few seconds–just until the dough comes together as a blob. The dough will now be extremely stiff and still fairly dry.", "Add your water, a bit at a time (about 1/4 cup at a time), mixing for a several seconds after each addition. The dough should gradually become like a stiff cake batter.", "You need to run the mixer for several seconds after each addition to be able to judge how the water is being absorbed. For me, in Seattle this fall, it’s routinely taken 6 oz/170 (3/4 cup) of water to make the appropriate dough consistency. Your area and conditions may need more or less water. You don’t want the dough to be too thin or soupy (like pancake batter), but you also don’t want it to be so stiff that it’s like Play Doh.  Once you have added all of the water, beat on high for about 3 minutes.  At the end of this time, your dough should be smooth.", "Line your rising bowl with a good-sized piece of parchment paper. It will be a bit wrinkly–do your best to smooth it down and fully cover the interior of the bowl.", "There should be some parchment paper hanging over the edges–you will use these edges later–don’t cut them off right now. The reason I have you use parchment paper instead of greasing the bowl is that you are going to transfer the risen dough to the Dutch oven for baking at a later point.", "Carefully scrape your dough into the lined bowl. Smooth top. Cut a few slashes in the top of the dough with a lame (a bread slasher) or a very sharp knife.", "Cover bowl with plastic wrap (I usually use a rubber band to keep it on the bowl) and place it in a warm-ish, draft-free place. Your oven with the light turned on in it is a nice place. Or, if you’re baking other things, on the top of the stove is great–so your dough can take advantage of the warmth to encourage rising. A friend of mine puts hers in a large pot with a lid and keeps it next to the stove while she’s cooking other things.", "Let the dough rise for 4 to 6 hours. I’ve let it rise all sorts of different time periods, and 4-6 hours seems to work well. I’ve let it rise overnight, for about 12 hours, and its been OK. There’s really no “shoulds” in this stage. Just go about your business and come back to it when you can.  The dough should approximately double in bulk.", "Of interest is the fact that a longer rise time does not necessarily correlate with a lighter baked bread.", "When you are ready to bake your bread, remove the bowl of dough from the oven (if you’ve been letting it rise in there). Place your Dutch oven, with lid, into your oven and pre-heat to 425 degrees F/220 degrees C/Gas Mark 7. Keep your Dutch oven in there for about 1/2 hour–so it gets nice and hot. When you’re ready, carefully remove the Dutch oven from the oven and remove the lid.  Remember: it will be extremely hot!", "Remove the plastic wrap from your rising dough. Grasp the edges of the parchment paper with your hands, making sure that you have got a firm hold on it, and carefully and gently transfer your dough to the Dutch oven–your dough will be risen and is in a fairly fragile state. Be very careful–it is easy to burn yourself at this step.  At this point, you can cut the parchment paper edges so there is not so much extra hanging over the sides.  Spray the top with a few sprays of water–this will help to create the crisp and chewy crust.  Place (hot) lid back onto your Dutch oven, and return to the oven.", "Bake for 45 minutes at 425 degrees F. Then remove lid and bake another 15 minutes uncovered to further brown the top crust.Remove from oven and check internal temperature of the bread with an instant-read thermometer if you have one. It should read at least 205+ degrees F. This indicates that the bread is thoroughly baked.", "Let sit for 15 minutes. After 15 minutes, carefully grasp the parchment paper again and transfer your bread to a cooling rack. You may remove the parchment paper now so the bread can cool. Please note that the bread is still cooking and the crumb is setting up at this point–let it cool completely before you slice it. It’s hard to wait, but you will be happy you did!", "This bread stores best on the counter, unwrapped at room temperature (not in the fridge). Do not wrap it in foil or plastic wrap–it will make the crust gummy.  Once you cut it, store it unwrapped with the cut side down on the cutting board at room temperature.  If you really want to wrap it, use a paper bag or something like Debbie Meyer Bread Bags–which are porous like paper bags and they let the bread breathe.  My local food co-op carries them."]}, {"id": "K8Ey", "title": "Spiced Sweet Potato Bread", "image": "https://images.yumprint.com/p1yumprintcc/CCcdWoApOeGHELevjelYlXJiz-lPzqYZoTMUbuI_TPMxF8AAq2OV4sbV7qj4CI1m", "link": "https://thechalkboardmag.com/grain-free-sweet-potato-bread-dr-mark-hyman", "ingredients": ["2 Tbsp coconut oil", "2 large sweet potatoes, peeled and thinly sliced, about 3 cups mashed", "½ cup coconut flour", "1 Tbsp ground cinnamon", "1 tsp ground nutmeg", "½ tsp ground mace", "1 tsp baking soda", "1 tsp baking powder", "1/8 tsp sea salt", "4 large eggs", "½ cup almond butter", "4 Tbsp unsalted, grass-fed butter, melted", "1 tsp organic almond extract", "opt. chopped walnuts"], "directions": ["Preheat the oven to 350°F. Grease a 9-by-5-inch loaf pan with the coconut oil. Cut a piece of parchment paper to fit in the bottom of the pan and lay the parchment in the pan.", "Place the sweet potato slices in a medium saucepan and cover with about 1 inch filtered water. Bring to a boil over high heat and cook until tender, about 5 minutes. Drain the potatoes in a colander, then return the slices to the saucepan.", "Using a potato masher, mash the potatoes until smooth and allow to cool to room temperature.In a bowl, combine the coconut flour, cinnamon, nutmeg, mace, baking soda, baking powder and salt.", "In a large bowl, whisk the eggs until combined. Add the mashed sweet potatoes and the almond butter, melted butter, and almond extract and whisk gently until well combined. Add the coconut flour mixture and mix with a rubber spatula until evenly moistened.", "Pour the batter into the prepared loaf pan and bake until a toothpick inserted into the center comes out clean, 50 to 60 minutes. Invert the bread out of the pan onto a wire rack and allow to cool completely.", "Cut the loaf into 1-inch slices and serve. Store tightly wrapped in plastic wrap at room temperature for up to 4 days."]}, {"id": "v-nJ", "title": "Super Easy Gluten Free Sourdough Starter", "image": "https://images.yumprint.com/p1yumprintqq/qqVAhVd7AtLcTdT_2JR2ZUgrMyaVVT5Gr7fvSzxumqBM5XVJlvKBm9aqshRz6mN_", "link": "http://wholenewmom.com/recipes/gluten-free-sourdough-starter/", "ingredients": ["1/2 cup of flour (whatever gluten-free flour or blend you like)", "scant 1/2 cup of filtered water"], "directions": ["Step 1. Combine 1/2 cup of flour (whatever gluten-free flour or blend you like) and a scant 1/2 cup of filtered water in the bowl.", "Whisk until smooth and cover with a plate, leaving approximately 1/2″ gap for air to circulate.", "Step 2. At least twice a day for the next six days, at regular intervals, add 1/2 cup of flour and scant 1/2 cup of filtered water to the existing starter.", "This is called feeding the starter.", "You do need to watch your starter carefully.", "Here are a three of the most common things that you might notice and what they mean:", "Too Much Starter – If after a few days the starter begins to outgrow the bowl, pour some off to make a batch of sourdough pancakes. Leave at least 1/2 cup of starter in the bowl to continue feeding.", "Liquid At the Top – Liquid may or may not collect at the surface of the starter. Either case is normal. (FYI: the liquid contains more lactobacillus and gives the bread its sourdough taste.)", "No Bubbles – If you do not see bubbles at the top or at the sides of the starter, add a third feeding. Try to keep the feeding intervals equal. For example, 6am, 2pm and 10pm are all equally apart at 8 hours.", "Another option is to add one to two tablespoons of water kefir, dairy kefir, kefir whey or kombucha in place of the water to for just one feeding. Since you are adding more bacteria “goodies” to the mix, you are boosting fermentation action.", "Step 3. When your starter is very bubbly and creates a dome on top 2-3 hours after each feeding (like the above picture), you are ready to make bread. This is often called the sponge.", "I mentioned earlier that I’m leaving the bread making up to Adrienne. My pantry is simply not properly equipped with the various gluten-free flours needed to make a successful loaf of bread."]}, {"id": "v-nL", "title": "Toasted Coconut and Banana Sourdough Pancakes", "image": "https://images.yumprint.com/p1yumprintwz/WZqGT4eHpeXfL6JmyUV6KpCbIxGiUCjM8MX6rqXALflYwxjhNUOqAipG98aRAADB", "link": "http://dontwastethecrumbs.com/2013/06/yummy-recipe-toasted-coconut-and-banana-sourdough-pancakes/", "ingredients": ["1 cup shredded or flaked coconut, toasted (see recipe for directions)", "2 Tbsp coconut oil, melted", "1 egg", "1 tsp baking powder", "1 tsp vanilla", "3 Tbsp honey", "1 banana", "2 cups sourdough starter", "INSTRUCTIONS"], "directions": ["While the coconut is toasting, preheat a griddle to 350 degrees or a skillet to medium. Melt coconut oil in a large mixing bowl. Add egg, baking powder, vanilla and honey and whisk thoroughly. Slice the banana into the bowl and combine well. If you prefer smaller pieces of banana in the pancakes, mash slightly while mixing.", "Add toasted coconut when done and mix well. Finally, measure and add sourdough starter, mixing well into the batter.", "Pour approximately ¼ cup of batter onto the griddle or skillet. Cook pancake until it is bubbly on top and cooked on the edges, approximately 2-3 minutes. The edges will not necessarily turn brown.", "Flip and cook the pancake for another 2-3 minutes, removing from the griddle or skillet when the bottom is golden to medium brown.", "Serve with maple syrup or honey. Yields 6-8 pancakes."]}, {"id": "HtQq", "title": "Whole Wheat Milk and Honey Sandwich Bread", "image": "https://images.yumprint.com/p1yumprintlk/lkSU8BrrPRNUi0gPTCZXBgIZ8zwdm-ncXrXU6e5_Ptay-L-dL75emlEkouEQ9iZX", "link": "http://nourishedkitchen.com/whole-wheat-milk-and-honey-bread/", "ingredients": ["½ cup butter, softened", "⅓ cup honey", "2 tablespoons instant yeast", "1 tablespoon sea salt", "olive oil, for oiling the bowl", "Glazing the Bread", "2 tablespoons heavy cream", "2 tablespoons rolled oats"], "directions": ["Working by hand, whisk flours together with ½ teaspoon instant yeast in a large mixing bowl with a tight-fitting lid (like this one), and then stir in the oats. Stir the water and milk together, then pour the liquids into the dry ingredients, stirring to create a loose, shaggy dough. Cover the mixing bowl tightly, and allow the dough to rest at room temperature at least eight and up to twelve hours.", "Dump the dough into the basin of a stand mixer (like this one), and then beat in the butter, honey, salt, and the remaining 2 tablespoons yeast. Continue beating all the ingredients together until they form a smooth dough, and then turn it out on a very generously floured surface. Knead by hand for ten to fifteen minutes, incorporating additional flour as necessary to keep dough from sticking, and kneading until the dough becomes smooth and elastic.", "Oil a large mixing bowl, and transfer the dough to the bowl. Cover tightly, and allow the dough to rise until doubled in volume.", "Transfer the dough to a well-floured surface, and split into two portions of approximately equal weight. Butter and flour two 4½-inch by 8½-inch loaf pans.", "Working one at a time, roll each lump of dough out into a large rectangle, about 8 by 16 inches. Working from the short end, roll the dough into a loaf, pinching the seam at the bottom of the loaf tightly to seal it. Place the dough, seam-side down, in a prepared loaf pan. Cover lightly with a kitchen towel, and allow it to rise until doubled in size, about two hours.", "While the dough rises, heat the oven to 400 F.", "Using a pastry brush, gently brush the top of the dough with cream, and then scatter one tablespoon rolled oats over each loaf. Transfer the loaves to the oven, and bake 5 minutes at 400 F. Then reduce the temperature to 350 F and continue baking until the crust is a dark brown and the bread reaches an internal temperature of 200 F about 45 minutes. Remove from the oven and allow the loaves to cool in their pans for five minutes, then turn out onto a wire rack, allowing the bread to cool completely before slicing."]}, {"id": "zJAG", "title": "Yuca plantain flatbread", "image": null, "link": "https://blog.realplans.com/yuca-plantain-flatbread-aip/", "ingredients": ["1 1/2 pounds yuca , (a.k.a. cassava)", "1 ripe plantain", "3 tablespoons avocado oil", "1 teaspoon garlic powder", "2 teaspoons coarse sea salt", "4 tablespoons coconut oil", "Yuca plantain flatbread method"], "directions": ["To peel the tough skin off the yuca, use a sharp, sturdy knife to first cut the pointy ends off. Then using a vegetable peeler or knife, remove all of the skin and brown spots. Chop white root into large two-inch chunks.", "Boil the yuca chunks for about 25 minutes on stovetop. Remove boiled yuca from heat and drain water.", "Combine cooked yuca, plantain, oil, and salt in a blender or food processor.", "Blend until pureed (mixture will be thick, like dough).", "Cut two pieces of parchment paper for making flat bread, plus a large piece to lay flatbread while waiting to cook.", "Take a handful of the dough mixture and between two pieces of parchment paper (placing the one you just laid out on the bottom) flatten by hand into a round flat bread about 1/4 inch thick.", "Repeat process to use all of the dough, laying out uncooked flat bread on the parchment.", "In a large skillet over medium high heat, warm some of the coconut oil until shimmering.", "Fry the flat bread until lightly browned on side. Serve as a wrap, side, or anytime when you’re in the mood for bread."]}, {"id": "vJP_", "title": "Zucchini & Sweet Potato Slice (Recipe)", "image": "https://images.yumprint.com/p1yumprint7e/7EIZtsS_dg7sUyA4x7ytqlS8wIusOkDDJPg8LFGxreQWK8PUWdBAnZczMUDH-q6x", "link": "http://foodmatters.tv/content/zucchini-sweet-potato-slice-recipe", "ingredients": ["1½ cups frozen peas", "2 tablespoons pesto", "1 cup baby spinach"], "directions": ["Preheat oven to 400°F (200°C) and line baking dish with parchment paper.", "If you have a food processor you can whip up this recipe super quick by using your grater blade and grate sweet potato, zucchini, onion and garlic.", "Mix zucchini, sweet potato, almond meal, rosemary, nutritional yeast (or organic cheese), baking powder and salt and pepper ingredients together in a large bowl.", "Make well in the mixture, add eggs and mix well.", "Spread evenly in baking tin (20cm x 30cm), or whatever you have. We used our loaf dish. Top with halved cherry tomatoes.", "Bake 40-50 minutes. This will depend on your dish you used, the slice is cooked once you insert a skewer and it comes out clean."]}, {"id": "I5nW", "title": "Zucchini Banana Bread", "image": "https://images.yumprint.com/p1yumprintyr/YRz7EKGs8BaEcZo3XOVAiLpeSSziebqyWTTYGmHPNDvofoobyjm3CxgFCFVQH0wp", "link": "http://www.eatingwell.com/recipe/263753/zucchini-banana-bread/?utm_source=facebook&utm_medium=social&utm_campaign=etg_20180726_editorialcontent", "ingredients": ["¾ cup all-purpose flour¾ cup white whole-wheat flour1 teaspoon ground cinnamon¾ teaspoon baking soda½ teaspoon salt2 large eggs", "¾ cup sugar¼ cup canola oil or melted unsalted butter1½ teaspoons vanilla extract1 cup shredded zucchini (about 1 medium)1 cup mashed ripe banana"], "directions": ["Preheat oven to 350°F. Coat a 9-by 5-inch loaf pan with cooking spray. Whisk all-purpose flour, whole-wheat flour, cinnamon, baking soda and salt in a large bowl; set aside. Whisk eggs, sugar, oil (or melted butter) and vanilla in a medium bowl. Stir in zucchini and banana until well combined. Add the wet ingredients to the flour mixture and stir until just combined. Transfer the batter to the prepared pan. Bake until a toothpick inserted into the center of the loaf comes out clean, 50 to 60 minutes. Let cool in the pan for 10 minutes, then turn the loaf out onto a rack to cool completely. Serve warm or at room temperature.", "To make ahead: Store in an airtight container at room temperature for up to 2 days or wrap in plastic wrap, then foil, and freeze for up to 2 months."]}, {"id": "rYqf", "title": "Zucchini Bread with Chocolate Chips", "image": "https://images.yumprint.com/p1yumprint16/169g1DkpDbdmcSDbrjGxS9kJa_596oIaJq_8jffUyRF-rlmsuSJ0TGPHhpdXjE-b", "link": "http://www.eatingwell.com/recipes/zucchini_bread_chocolate_chips.html?socsrc=ewfb0724155", "ingredients": ["3/4 cup low-fat milk", "2 large eggs", "3/4 cup sugar", "1/3 cup canola oil", "1 teaspoon vanilla extract", "2 cups shredded zucchini (about 2 small zucchini)", "2 cups white whole-wheat flour (see Note)", "2 teaspoons baking powder", "1 teaspoon ground cinnamon", "1/2 teaspoon salt", "1/2 cup chocolate chips"], "directions": ["Preheat oven to 350°F. Coat a 9-by-5-inch loaf pan with cooking spray.", "Whisk milk, eggs, sugar, oil and vanilla in a medium bowl. Stir in zucchini. Combine flour, baking powder, cinnamon and salt in a large bowl. Add the wet ingredients and chocolate chips to the dry ingredients; stir until just combined. Transfer the batter to the prepared pan.", "Bake until golden brown and a wooden skewer inserted in the center comes out clean, 50 minutes to 1 hour. Cool in the pan for 10 minutes, then turn out onto a wire rack. Let cool for at least 1 hour before slicing.", "Make Ahead Tip: Wrap and store at room temperature for up to 2 days or freeze for up to 3 months. | Equipment: 9-by-5-inch loaf pan"]}, {"id": "p-wk", "title": "Zucchini Carrot Banana Bread", "image": "https://images.yumprint.com/p1yumprint8w/8weGf6BMBrsHrfo-aBOTyZz0aVVK2va6KOClIqKmRrbgc8T-GIuT4DDDiAoDDosZ", "link": "http://www.confessionsofachocoholic.com/healthy/zucchini-carrot-bread", "ingredients": ["1 teaspoon butter to grease loaf pan", "1 2/3 cup all-purpose flour, plus more for dusting", "1 teaspoon baking soda", "1/4 teaspoon cinnamon", "1/2 teaspoon salt", "1/2 cup packed dark brown sugar", "1/2 cup sugar", "2 eggs", "1/2 cup coconut oil", "2 bananas, mashed", "1 cup grated zucchini(1 medium zucchini)", "1 cup grated carrots", "1/4 cup plain Greek yogurt (I used 2% Fage)", "2 teaspoons vanilla extract", "1/2 cup chopped walnuts", "1/2 cup raisins"], "directions": ["Preheat oven to 350 F.", "Butter a 9\" x 5\" loaf pan, then dust with flour.", "In a medium bowl, stir together flour, baking soda, cinnamon, and salt.", "In a separate mixing bowl, whisk together sugars and eggs. Add coconut oil, mashed bananas,grated zucchini, grated carrots, Greek yogurt, and vanilla. Mix to combine.", "Fold in flour mixture.", "Add walnuts and raisins.", "Pour into prepared loaf pan and bake for an hour, or until a toothpick inserted into the bread comes out clean."]}, {"id": "tVTc", "title": "Zucchini Muffins Recipe", "image": "https://images.yumprint.com/p1yumprintda/dAbtc0pn4fw6_RFFMGWTML-V-agwiy_J7l2UdvMxckzJTjTegTOsx4qoxN9FlmgW", "link": "http://www.motherearthliving.com/cooking-methods/zucchini-muffins-recipe-ze0z1205zwar.aspx", "ingredients": ["2 c spelt flour", "1 t .baking powder", "1 egg", "1/4 c olive oil", "2/3 c milk", "1 medium-sized zucchini, coarsely grated", "1 c grated Parmesan cheese", "1 T chopped fresh thyme", "Salt and pepper"], "directions": ["Preheat the oven to 375°F/190°C and grease eight cups of two large-capacity muffin pans.", "I make this in the stand mixer, but you can do it in a mixing bowl as easily. Start with the dry ingredients, sifting in the flour and baking powder. Slowly add the egg, oil, and milk, whisking all the while. Add the zucchini, cheese, and thyme and season to taste. Pour into the prepared cups and bake Zucchini Muffins for around 20 minutes, or until golden."]}, {"id": "Ads-", "title": "Zucchini Tortillas Recipe", "image": "https://images.yumprint.com/p1yumprintun/unk0NPug6CHkU8JcelHqIGN1hyQ7eg1Q913o2n521LcnC8lYvd538CtTbkM_lf8y", "link": "https://draxe.com/recipe/zucchini-tortillas/?utm_source=newsletter&utm_medium=email&utm_campaign=newsletter", "ingredients": ["3 cups grated zucchini (takes 4 medium zucchini to make 3 cups)", "1 cup + 3 tablespoons arrowroot flour", "1/2 cup coconut flour", "3 eggs", "1 teaspoon of each: smoked paprika, cumin, chili powder, salt, pepper"], "directions": ["Preheat oven to 350 F.", "Wash and grate zucchini.", "Squeeze the water out of the zucchini and place in a medium bowl, discarding the zucchini juice.", "Add in the arrowroot flour, coconut flour, eggs and spices.", "Mix until well combined.", "Line a 9 x 11 baking sheet with parchment paper.", "Using a 6cm ice cream scoop, scoop the tortilla batter on to the baking sheet, using your fingers to press the batter until thin round-shaped tortillas.", "Bake for 40 minutes or until tortilla is golden brown.", "Serve with your favorite taco toppings!"]}]}