{"title": "Asian", "recipes": [{"id": "wte4", "title": "30-Minute Thai Chicken Curry", "image": "https://images.yumprint.com/p1yumprint3o/3OrSOrCAKVNKq5W9xk4qCanWV0nSyIRAGZQ7vaYnyOC_x82c0SRvckxmZXLQ5FkK", "link": "http://www.theroastedroot.net/30-minute-thai-chicken-curry/", "ingredients": ["Cooked Rice (1 cup dry, or 3 cups cooked recommended)", "Fresh cilantro, chopped", "Plain or Greek yogurt", "Lime wedges"], "directions": ["Start by preparing the rice, following package instructions, so that it can cook while you’re preparing the rest of the recipe. I found making 1 cup of dry rice was the perfect amount for serving the recipe.", "Add 1/3 cup of the coconut milk to a non-stick skillet, along with the chopped onion and grated ginger. Heat over medium-high and saute until onion is translucent, about 6 to 8 minutes.", "Lower the heat to medium, add all of the spices and salt and cook an additional 3 minutes. Note: if at any point the contents of the pan begin to dry out, simply add more coconut milk.", "Add the rest of the coconut milk and bring to a full boil and cook 2. Add the chopped chicken and stir well. Cook, stirring occasionally, until chicken is cooked through, about 5 to 6 minutes."]}, {"id": "FxcR", "title": "4-Ingredient Easy Potstickers", "image": "https://images.yumprint.com/p1yumprintuy/UYoRZSVxx0J6ehLt6CH3NyQNdl7NE6YuPqL0gcMB8e5ctFm7azsVHHkOOx_bBnjH", "link": "https://www.littlebroken.com/2015/01/30/4-ingredient-easy-potstickers/", "ingredients": ["4 Italian mild sausages, removed from casing", "½ lb. ground chicken", "½ small onion, finely chopped or grated", "1 pkg. (12 oz.) square won ton wrappers", "vegetable or canola oil", "Dipping Sauce (optional)", "3 Tbsp. low-sodium soy sauce", "4 tsp. worcestershire sauce", "4 tsp. sesame oil", "1 tsp. sriracha sauce", "1 Tbsp. minced cilantro", "Get Ingredients Powered by Chicory"], "directions": ["In a medium bowl, combine the sausage meat, ground chicken, and onion.", "Spoon one teaspoon of the filling into the center of each wrapper; moisten the edges of the wrapper with water and fold to create a triangle. Repeat with the rest of the wrappers and filling.", "To cook: add just enough oil to cover the bottom of a non-stick pan and cook the potstickers over medium heat, about 2-3 minutes on each side or until golden crisp. Remove to a paper lined plate.", "Serve immediately with dipping sauce, if desired.", "Whisk together all ingredients until incorporated.", "I completely omitted salt and pepper from the meat filing since the dipping sauce is salty but you may want to season lightly depending on how you're serving."]}, {"id": "uDVP", "title": "Asian Beef Meatballs", "image": "https://images.yumprint.com/p1yumprintgl/gLOK5rbyJKiJi-DaL9fuXETvBrW8vyZWk8cG-ok0X2Bhi384R3AP01h4uyJSC3QT", "link": "http://www.eatingwell.com/recipes/asian_beef_meatballs.html?socsrc=EWfb1111154", "ingredients": ["8 ounces mushrooms, chopped", "1 small onion, chopped", "1 stalk celery, sliced", "4 cloves garlic", "1 tablespoon extra-virgin olive oil", "1/2 cup fine dry breadcrumbs", "1 8-ounce can water chestnuts, drained and finely chopped", "1/4 cup finely chopped scallions", "2 tablespoons Shaoxing or dry sherry", "1 tablespoon finely chopped fresh ginger", "1/2 teaspoon salt", "1/2 teaspoon ground pepper", "1 pound lean ground beef"], "directions": ["Finely chop mushrooms, onion, celery and garlic in a food processor. Heat oil in a large skillet over medium-high heat. Add the vegetable mixture and cook, stirring occasionally, until the liquid has evaporated, 6 to 8 minutes. Transfer to a large bowl and let cool for 10 minutes.", "Preheat oven to 450°F. Line a large rimmed baking sheet with foil and coat with cooking spray.", "Add breadcrumbs, water chestnuts, scallions, Shaoxing (or sherry), ginger, salt and pepper to the cooled vegetables; stir until combined. Add beef and mix gently to combine (do not overmix). Form into 30 meatballs (a scant 2 tablespoons each) and place on the prepared baking sheet.", "Bake the meatballs until an instant-read thermometer inserted in the center registers 165°F, about 15 minutes.", "Make Ahead Tip: Freeze baked, cooled meatballs in a single layer on a baking sheet, then transfer to an airtight container. Freeze for up to 3 months. Reheat from frozen in a 350°F oven for about 25 minutes."]}, {"id": "Dr5D", "title": "Asian-Inspired Chicken Soup", "image": "https://images.yumprint.com/p1yumprinty7/Y7U1Mh9xJTBZGAhaUHbfDc9wOuLn8_kCoErZF4HYlQgStZTNnhGwZmAX8jTYRLTT", "link": "http://www.eatingwell.com/recipe/252321/asian-inspired-chicken-soup/", "ingredients": ["½ ounce (about ½ cup) dried shiitake or mixed dried mushrooms", "3 cups boiling water1 tablespoon peanut oil or canola oil2 cups diced onion3 cloves garlic, thinly sliced6⅛-inch-thick slices peeled fresh ginger6 cups reduced-sodium chicken broth¼ cup reduced-sodium soy sauce1 2-to-3-inch cinnamon stick1 whole star anise1 teaspoon freshly ground pepper2 pounds boneless, skinless chicken thighs, trimmed and cut into 1-inch pieces1 bulb fennel, cored and cut into 1-inch pieces8 scallions, whites cut into 2-inch pieces and greens chopped, divided1 pound bok choy, preferably baby bok choy, white stems sliced lengthwise and greens chopped, divided2 cups (4 ounces) mung bean sprouts (see Note)½ cup chopped fresh cilantro2 teaspoons toasted sesame oilLime wedges for garnish"], "directions": ["Place mushrooms in a heatproof measuring cup and cover with boiling water. Soak for at least 30 minutes or up to several hours. Remove the mushrooms from the water, remove and discard stems (if any) and cut into ⅛-inch slices; set aside. Strain the soaking liquid and reserve. Heat oil in a large soup pot or Dutch oven over medium heat. Add onion, garlic and ginger and cook, stirring, for 5 minutes. Pour in the reserved mushroom liquid, broth, soy sauce, cinnamon stick, star anise and pepper. Bring to a boil. Reduce to a simmer and stir in chicken. Simmer for 20 minutes. Stir in fennel, scallion whites and the reserved mushrooms and cook for 5 minutes. Add bok choy stems, return to a simmer and cook for 3 minutes more. Stir in bok choy greens and bean sprouts. Cook until the greens are just wilted, about 2 minutes more. Discard the cinnamon stick and star anise. Ladle the soup into bowls. Garnish each bowl with scallion greens, cilantro and a ¼-teaspoon drizzle of sesame oil. Serve with lime wedges, if desired."]}, {"id": "xOD_", "title": "Asian-Inspired Chicken Soup", "image": "https://images.yumprint.com/p1yumprinttq/tqZFeKHNbratJeY7rrmSb3T_WG4A_gl_1TVZGs3gQDQyCMpVXBykBBmiSAQSsHEf", "link": "http://www.eatingwell.com/recipes/asian_chicken_soup.html", "ingredients": ["1/2 ounce (about 1/2 cup) dried shiitake or mixed dried mushrooms", "3 cups boiling water", "1 tablespoon peanut oil or canola oil", "2 cups diced onion", "3 cloves garlic, thinly sliced", "6 1/8-inch-thick slices peeled fresh ginger", "6 cups reduced-sodium chicken broth", "1/4 cup reduced-sodium soy sauce", "1 2-to-3-inch stick cinnamon", "1 whole star anise", "1 teaspoon freshly ground pepper", "2 pounds boneless, skinless chicken thighs, trimmed and cut into 1-inch pieces", "1 bulb fennel, cored and cut into 1-inch pieces", "8 scallions, whites cut into 2-inch pieces and greens chopped, divided", "1 pound bok choy, preferably baby bok choy, white stems sliced lengthwise and greens chopped, divided", "2 cups (4 ounces) mung bean sprouts (see Note)", "1/2 cup chopped fresh cilantro", "2 teaspoons toasted sesame oil"], "directions": ["Place mushrooms in a heatproof measuring cup and cover with boiling water. Soak for at least 30 minutes or up to several hours. Remove the mushrooms from the water, remove and discard stems (if any) and cut into 1/8-inch slices; set aside. Strain the soaking liquid and reserve.", "Heat oil in a large soup pot or Dutch oven over medium heat. Add onion, garlic and ginger and cook, stirring, for 5 minutes. Pour in the reserved mushroom liquid, broth, soy sauce, cinnamon stick, star anise and pepper. Bring to a boil. Reduce to a simmer and stir in chicken. Simmer for 20 minutes.", "Stir in fennel, scallion whites and the reserved mushrooms and cook for 5 minutes. Add bok choy stems, return to a simmer and cook for 3 minutes more. Stir in bok choy greens and bean sprouts. Cook until the greens are just wilted, about 2 minutes more.", "Discard the cinnamon stick and star anise. Ladle the soup into bowls. Garnish each bowl with scallion greens, cilantro and a 1/4-teaspoon drizzle of sesame oil. Serve with lime wedges, if desired."]}, {"id": "KO4R", "title": "Asian-Style Cabbage Wraps", "image": "https://images.yumprint.com/p1yumprintqg/Qg-GsnsZKz0TN30U62QoMS10bjK6OioT0pShr1qNojax3R7EpLNaoI9zMTlrwAmi", "link": "https://blog.paleohacks.com/cabbage-wraps/", "ingredients": ["3 T coconut aminos", "2 T sesame oil", "1/3 C cilantro, chopped", "1 garlic clove, minced", "1 inch piece of ginger, peeled and grated"], "directions": ["In a medium pan, begin to brown ground turkey.", "While turkey cooks, bring a large pot of water to boil and place cabbage leaves in water to tenderize, for about 5 minutes. Remove from pot and set aside on paper towel.", "Once turkey is browned, pour into a mixing bowl. Add carrots, onion, and water chestnuts. Mix.", "In a separate small bowl, whisk together sauce ingredients. Pour over vegetable and turkey mixture. Stir to coat.", "Preheat oven to 350℉. Line a 9×13 baking pan with 6 cabbage leaves.", "Place 1/3 cup filling in the center of cabbage leaves. Fold in the sides and roll up from the bottom.", "Place in pan seam side-down. Brush cabbage with olive oil. Bake 35-40 minutes. Cabbage rolls should be lightly browned on top."]}, {"id": "zoVA", "title": "Beef Bulgogi", "image": "https://images.yumprint.com/p1yumprintxl/xLQr6pQ7SuXlrNhRcXwLSkV0igIpNlSoDYsw9G4pVpQgvkCFfrt4I_S_KEvMwiy8", "link": "http://www.nytimes.com/2011/06/05/magazine/mark-bittman-bulgogi-for-the-backyard-grill.html?_r=0", "ingredients": ["1 bunch scallions, roughly chopped", "8 or more garlic cloves, peeled and roughly chopped", "1 tablespoon sugar or honey", "1/2 teaspoon black pepper", "1/2 cup soy sauce", "1 tablespoon sesame oil", "2 pounds sirloin, rib-eye or skirt steak, thinly sliced, or 3 to 4 pounds beef short ribs, boned and thinly sliced", "Boston or loose-leaf lettuce leaves for serving"], "directions": ["Cook 1 / 3 cup sugar, 1 / 3 cup water and 1 sprig fresh rosemary or thyme over medium-low heat until the sugar dissolves; cool and remove the herb. Combine 1 bottle not-too-dry white wine (like Riesling), 1/4 cup gin, the juice of 1 lemon, 2 to 4 chopped plums and 1/4 cup of the rosemary syrup. Chill for at least 2 hours, taste and add more syrup if you like and serve."]}, {"id": "KkYB", "title": "Better Than Takeout Chicken Fried Rice", "image": null, "link": "https://thecookinchicks.com/better-than-takeout-chicken-fried-rice/?fbclid=IwAR0wNS3nNlajyVxKGdiIbYw--hub04Hj59mIH0DPCLkJPWK11l_9QMvPAAk", "ingredients": ["1 lb chicken, cooked and shredded", "3 cups cooked rice", "2 tbsp sesame oil", "1 onion, diced", "1 cup frozen peas and carrots, thawed", "2 tbsp soy sauce (more if desired)", "2 eggs, lightly beaten", "2 tbsp green onions, chopped (optional)"], "directions": ["Preheat a medium skillet or wok to medium heat.", "Add the sesame oil, onion, and peas/carrots.", "Allow to cook until tender.", "Slide the onion, carrots, and peas to one side of skillet and add in the lightly beaten eggs to the other side.", "Using a spatula, scramble the eggs.", "Once eggs are fully cooked, combine with the onion/peas/carrots.", "Add the cooked rice and shredded chicken into the skillet and combine with the egg mixture.", "Pour the soy sauce on top and stir to combine evenly.", "Add in the green onions, if using. Serve!"]}, {"id": "BdHF", "title": "BETTER-THAN-TAKEOUT CHICKEN FRIED RICE", "image": "https://images.yumprint.com/p1yumprintfp/fpMCNQDvT2gjCnaQZNXC1Mib_h8dIEL6H52B8fA0LQhCTjEhWIgP-EE-tZBxR2f7", "link": "http://rachelschultz.com/2012/07/14/better-than-takeout-chicken-fried-rice/", "ingredients": ["1 cup rice", "3 chicken breasts, cooked and shredded (I recommend SLOW COOKER CHICKEN TERIYAKI)", "1 onion, diced", "2 cloves garlic, minced", "1/2 cup frozen peas", "4 carrots, diced", "2 eggs", "3 tablespoons sesame oil", "1/4 cup soy sauce"], "directions": ["Prepare 1 cup rice with two cups water in a rice cooker or on the stovetop. Meanwhile, heat sesame oil in a large skillet over medium heat. Add onion, garlic, peas, and carrots. Cook for 5-7 minutes. Crack eggs into pan and scramble, mixing with vegetables.", "Add rice, chicken, and soy sauce to pan. Stir to combine and remove from heat."]}, {"id": "wRDM", "title": "Brothy Chinese Noodles", "image": "https://images.yumprint.com/p1yumprintbp/bPmJN3bgi3fGhtlquc34oBrzuZsB242DOeORjnZZ1FescdxDLswgEGGYLopS6WOK", "link": "http://www.eatingwell.com/recipes/brothy_chinese_noodles.html?socsrc=EWfb0208164", "ingredients": ["2 tablespoons hot sesame oil (see Note), divided", "1 pound 93%-lean ground turkey", "1 bunch scallions, sliced, divided", "2 cloves garlic, minced", "1 tablespoon minced fresh ginger", "4 cups reduced-sodium chicken broth", "3/4 cup water", "3 cups thinly sliced bok choy", "8 ounces dried Chinese noodles (see Note)", "3 tablespoons reduced-sodium soy sauce", "1 tablespoon rice vinegar", "1 small cucumber, sliced into matchsticks, for garnish"], "directions": ["Heat 1 tablespoon oil in a large saucepan over medium heat. Add ground turkey, all but 2 tablespoons of the scallions, garlic and ginger and cook, stirring and breaking up the turkey, until no longer pink, about 5 minutes. Transfer to a plate.", "Add broth, water, bok choy, noodles, soy sauce, vinegar and the remaining 1 tablespoon oil to the pan. Bring to a boil over medium-high. Cook, stirring occasionally, until the noodles are tender, 3 to 5 minutes. Return the turkey mixture to the pan and stir to combine. Serve garnished with the reserved 2 tablespoons scallions and cucumber (if using).", "Ingredient notes: Hot sesame oil can be found in the Asian-food section of most supermarkets."]}, {"id": "x2iO", "title": "Carrot, Snow Pea & Chicken Stir-Fry", "image": "https://images.yumprint.com/p1yumprintmu/MuKN2IRgiKgbGnZlnOd3YdUnbY0rV5BqdUILOsGV5yQgRAkFqsqQwGCA-pZLmdeC", "link": "http://www.eatingwell.com/recipes/carrot_snow_pea_chicken_stir_fry.html", "ingredients": ["3 tablespoons peanut oil or canola oil, divided", "1 pound boneless, skinless chicken thighs, trimmed and cut into 1-inch pieces", "3 cups 1/2- to 1-inch carrot slices", "1 bunch scallions, trimmed and cut into 1-inch pieces", "3 cloves garlic, minced", "3 cups snow peas, trimmed"], "directions": ["To prepare sauce: Combine lime juice, orange juice, cilantro, olive oil, cornstarch, salt, cumin, oregano and pepper in a small bowl. Place near the stove.", "To prepare stir-fry: Heat a 14-inch flat-bottom carbon-steel wok over high heat. (You’ll know it’s hot enough when a bead of water vaporizes within 1 to 2 seconds of contact.) Add 1 tablespoon oil and swirl to coat. Add chicken and stir-fry until just cooked, 2 to 4 minutes. Transfer to a large plate.", "Swirl in another 1 tablespoon oil; add carrots and scallions. Stir-fry for 2 minutes.", "Swirl in the remaining 1 tablespoon oil; add garlic and snow peas. Stir-fry until the vegetables are tender, 2 to 4 minutes more.", "Return the chicken to the wok. Add the reserved sauce and cook, gently stirring, until well coated and hot, 1 to 2 minutes.", "Make Ahead Tip: Refrigerate the sauce (Step 1) for up to 3 days"]}, {"id": "zghL", "title": "Cauliflower Chicken Fried \"Rice\"", "image": "https://images.yumprint.com/p1yumprintjd/JDJBUjRCLbWupepZGFbcfc8pdyalgINEG4RO1DZ7QpCRCmFmchi7bRGJmXczYrLT", "link": "http://www.eatingwell.com/recipes/cauliflower_chicken_fried_rice.html?socsrc=ewfb0607164link", "ingredients": ["1 teaspoon peanut oil plus 2 tablespoons, divided", "2 large eggs, beaten", "3 scallions, thinly sliced, whites and greens separated", "1 tablespoon grated fresh ginger", "1 tablespoon minced garlic", "1 pound boneless, skinless chicken thighs, trimmed and cut into 1/2-inch pieces", "1/2 cup diced red bell pepper", "1 cup snow peas, trimmed and halved", "4 cups cauliflower rice (see Tip)", "3 tablespoons reduced-sodium tamari or soy sauce", "1 teaspoon sesame oil (optional)"], "directions": ["Heat 1 teaspoon oil in a large flat-bottomed carbon-steel wok or large heavy skillet over high heat. Add eggs and cook, without stirring, until fully cooked on one side, about 30 seconds. Flip and cook until just cooked through, about 15 seconds. Transfer to a cutting board and cut into 1/2-inch pieces.", "Add 1 tablespoon oil to the pan along with scallion whites, ginger and garlic; cook, stirring, until the scallions have softened, about 30 seconds. Add chicken and cook, stirring, for 1 minute. Add bell pepper and snow peas; cook, stirring, until just tender, 2 to 4 minutes. Transfer everything to a large plate.", "Add the remaining 1 tablespoon oil to the pan; add cauliflower rice and stir until beginning to soften, about 2 minutes.", "Return the chicken mixture to the pan; add tamari (or soy sauce) and sesame oil (if using) and stir until well combined. Garnish with scallion greens.", "TIPS & NOTES", "Look for prepared cauliflower rice (or cauliflower crumbles) with other prepared vegetables in some supermarkets. To make your own, place cauliflower florets in a food processor and pulse until broken down into rice-size granules. One 2-pound head of cauliflower yields about 4 cups of cauliflower rice."]}, {"id": "k7Fy", "title": "Chicken and Spaghetti Squash Pad Thai", "image": "https://images.yumprint.com/p1yumprintcs/csxDzJNwWvYLcugz-fwztO66v1cloqIPe_NSc0bqAs9pt0-Dw2nlmhuoDIV4wb7d", "link": "http://www.doctoroz.com/recipe/chicken-and-spaghetti-squash-pad-thai", "ingredients": ["1 medium spaghetti squash", "2 tbsp coconut oil, plus additional for greasing baking dish", "1 large sweet onion, roughly chopped", "3 garlic cloves, minced", "1-inch piece of ginger root, peeled and minced", "4 carrots, peeled and sliced thinly", "8 oz bag sugar snap peas, ends chopped off and discarded", "1 cup thinly sliced radishes", "1/3 cup crushed cashews, more to taste", "1/4 cup canned coconut milk", "3 tbsp sunflower seed butter", "1 tbsp apple cider vinegar", "1/2 tsp sea salt", "1 tbsp gluten-free fish sauce", "1 tbsp coconut aminos", "2 chicken breasts, butterflied and cooked", "4 tbsp green onions, sliced for garnish", "4-6 lemon wedges, for garnish"], "directions": ["Preheat oven to 350 degrees F. Cut spaghetti squash in half lengthwise and place face down on a baking dish greased with coconut oil. (You can also do this step ahead of time when you're using the oven for another dish.) Let cook for about 45 minutes or until soft.", "Heat large pan (best option for this dish is a wide and deep stainless-steel pan) with coconut oil over medium heat. Add onion and cook for 3 to 5 minutes. Add garlic and ginger. Cook for a couple of minutes then add carrots, snap peas, radishes and cashews. When vegetables begin to soften, after about 10 minutes, mix in coconut milk, sunflower seed butter, apple cider vinegar, sea salt, fish sauce and coconut aminos. Stir in chicken and spaghetti squash. Continue to let cook for a couple of minutes to let flavors blend together. Top with green onions and additional cashews. Serve with lemon wedge."]}, {"id": "A52V", "title": "Chicken and Vegetable Miso Soup", "image": "https://images.yumprint.com/p1yumprintsx/sXjUAV5xYGw5E4ardOjMJCVrcKd7olmTa0F05zlnO3fFvduSFvVQP1dj3yHoHrFx", "link": "http://www.bonappetit.com/recipe/chicken-and-vegetable-miso-soup", "ingredients": ["1 medium onion, chopped", "6 oz. shiitake mushrooms, stems removed, caps sliced", "2 celery stalks, thinly sliced", "Kosher salt", "2 Tbsp. vegetable oil", "3 Tbsp. white miso (fermented soybean paste)", "2 skinless, boneless chicken breasts (about 1 lb.), each cut crosswise into 3 pieces", "4 heads baby bok choy (about 12 oz.), trimmed, cut into bite-size pieces", "Chopped avocado, lime wedges, hot chili paste and cilantro leaves (for serving)", "6 cups low-sodium chicken broth", "Ingredient Info:", "White miso can be found at Japanese markets, natural foods stores, and in the refrigerated section of some supermarkets. Hot chili paste can be found at Asian markets and in the Asian foods section of many supermarkets."], "directions": ["Heat oil in a large pot over medium-high heat. Add onion, mushrooms, and celery; season with salt. Cook, stirring, until vegetables are just beginning to soften and beginning to brown, 5–7 minutes.", "Add broth and miso and bring to a boil. Add chicken, reduce heat, and simmer, partially covered, until chicken is cooked through, 15–20 minutes. Remove chicken from broth, shred with 2 forks, and return to pot. Add bok choy, cover pot, and cook until bok choy is wilted, about 3 minutes.", "Serve soup with avocado, lime wedges, chili paste, and cilantro."]}, {"id": "nVBQ", "title": "Chicken Lettuce Wraps Recipe", "image": "https://images.yumprint.com/p1yumprintk3/K36u3DBUg-b__0yMzxUzeyfXdnVdtxKzdwrNHQoiPCvqzab9EzSwqDn_98K7qtOj", "link": "http://www.tasteofhome.com/recipes/chicken-lettuce-wraps", "ingredients": ["1-1/2 pounds boneless skinless chicken breasts, cubed", "1 tablespoon plus 1-1/2 teaspoons peanut oil, divided", "3/4 cup chopped fresh mushrooms", "1 can (8 ounces) water chestnuts, drained and diced", "1 tablespoon minced fresh gingerroot", "2 tablespoons rice vinegar", "2 tablespoons reduced-sodium teriyaki sauce", "1 tablespoon reduced-sodium soy sauce", "1/2 teaspoon garlic powder", "1/4 teaspoon crushed red pepper flakes", "1-1/2 cups shredded carrots", "1/2 cup julienned green onions", "12 Bibb or Boston lettuce leaves", "1/3 cup sliced almonds, toasted"], "directions": ["In a large nonstick skillet coated with cooking spray, cook chicken in 1 tablespoon oil for 3 minutes; drain. Add the mushrooms, water chestnuts and ginger; cook 4-6 minutes longer or until chicken is no longer pink. Drain and set aside.", "In a small bowl, whisk the vinegar, teriyaki sauce, soy sauce, garlic powder, red pepper flakes and remaining oil. Stir in the carrots, onions and chicken mixture.", "Spoon onto lettuce leaves; sprinkle with almonds. If desired, fold sides of lettuce over filling and roll up. Yield: 6 servings."]}, {"id": "lESt", "title": "Chicken Pho", "image": "https://images.yumprint.com/p1yumprint8z/8ZghW14D3M4O85AkD5db3KDD7rT3ZcXrkd5pfd7AjInnO4ANGUuo2GJtmAW6cuzX", "link": "https://www.yahoo.com/food/michelle-phans-mom-shares-her-chicken-pho-recipe-103211565566.html", "ingredients": ["1 3.5-4-lb. chicken", "2 large pieces fresh ginger (about 2” each), 1 sliced, 1 one left whole", "1 red onion, peeled", "2 32-oz. boxes chicken broth (Phan likes Swanson brand)", "1 packet pho spice", "Black pepper, to taste", "Fish sauce, to taste (Phan likes Phu Quot brand)", "3 spring onions, white parts finely chopped, green parts reserved for garnish", "1 14-oz. package fresh or dry banh pho rice noodles", "1 bunch fresh basil leaves", "1 bunch cilantro leaves", "1 package bean sprouts (a couple handfuls)", "1 jalapeño, thinly sliced crosswise", "1 lime, cut into wedges", "Sriracha", "Hoisin Sauce"], "directions": ["Using kitchen shears, remove the skin and fat from the chicken and discard. Break down the chicken: remove the legs, and cut the breasts from the breastbones. Set aside the breast meat.", "Bring a large pot of water to a boil. Add the chicken legs, carcass, and sliced ginger and cook about 10 minutes. (This first cooking step is to boil away any extra fat and “clean” the chicken.)", "Meanwhile, “burn” the red onion and whole ginger over an open flame, turning every so often until the outer layers are slightly charred. Slice the ginger and set both aside.", "Thinly slice the chicken breast and place in a bowl. Add black pepper, fish sauce, and chopped spring onion and stir to combine. Marinate about 15 minutes.", "Transfer the boiled chicken pieces to a clean pot. Add the chicken broth, pho spice, red onion, and ginger and simmer until fragrant, about 20 minutes. Meanwhile, ladle about 2 cups broth into another small pot and bring to a simmer over medium heat. Add chicken breast slices and cook through, about 3 minutes.", "Rinse fresh pho noodles under hot water and then cook according to package instructions. If using dry, cook according to package instructions.", "Distribute noodles and then chicken breast among 4 bowls. Ladle broth over each and garnish each with green onion tops, basil, cilantro, and bean sprouts. Serve with jalapeños, limes, Sriracha, and hoisin."]}, {"id": "dVyv", "title": "chicken yakisoba", "image": "https://images.yumprint.com/p1yumprints0/S04pW6NRPPopAwatf6a_i05w9ZPXqHaKxCnovekb5P4lVojZcP8SR7PoE7mctASZ", "link": "http://recipesweet.net/chicken-yakisoba/", "ingredients": ["½ head green cabbage", "1 medium yellow onion", "2 medium carrots", "1 small crown broccoli", "2 inches fresh ginger", "1 large chicken breast", "2 Tbsp vegetable oil", "2 (3 oz.) packages ramen noodles", "seasoning packets discarded", "1 tsp sesame oil (optional)", "¼ cup soy sauce", "1/4 cup worchestershire sauce", "2 Tbsp ketchup", "(up to) 1 Tbsp sriracha hot sauce", "1 Tbsp sugar"], "directions": ["Before you begin, prepare the meat and vegetables for stir frying. Peel the ginger with either a vegetable peeler or the side of a spoon and then grate it with a cheese grater. Peel and grate the carrots with a large holed cheese grater. Remove the core from the cabbage and cut into thin strips. Slice the onion into thin strips. Cut the broccoli into bite-sized pieces. Slice the chicken into thin strips.", "Begin boiling a medium pot full of water for the noodles. Heat the vegetable oil in a large skillet over medium-high heat. When the oil is hot, add the grated ginger, saute for about 30 seconds to one minute (its okay if it sticks to the pan but don’t let it burn). Add the chicken strips and cook until they are no longer pink (about five minutes).", "Once the chicken is cooked through, add all of the vegetables. Stir and cook until wilted (about 5-10 minutes). Meanwhile, once the water boils, add the noodles and cook just until tender (2-3 minutes). Drain, return to the pot (with the heat turned off) and toss with the sesame oil to keep from sticking.", "In a small bowl, combine the soy sauce, worchestershire sauce, ketchup, sriracha, and sugar. Use only ½ tsp of sriracha if you don’t want it spicy, use up to 1 Tbsp if you like it hot. Stir until the ketchup and sugar are dissolved. Pour the sauce into the skillet with the chicken and vegetables with the heat still on medium high. Add the noodles, stir to coat everything in the sauce, and heat through (just a few minutes)"]}, {"id": "GSFA", "title": "Chicken Zoodle Pho", "image": null, "link": "https://www.parents.com/recipes/healthyeating/quick-and-easy-whole30-dinner-recipes/?utm_source=facebook&utm_medium=social&utm_campaign=etg_20180131_internal_crosspromo", "ingredients": ["1 tablespoon coconut oil", "1 large boneless, skinless chicken breast (about 8 ounces)", "2 cups Whole30-compliant chicken broth", "1 tablespoon minced fresh ginger", "2 teaspoons Red Boat fish sauce", "¹⁄8 to ¼ teaspoon red pepper flakes", "1 ½ cups packaged zucchini noodles; or 1 small zucchini, spiralized", "½ cup packaged shredded carrots or 1 medium carrot, shredded", "¼ cup sliced green onions", "2 tablespoons chopped fresh cilantro, plus more for garnish if desired", "½ cup fresh bean sprouts", "2 tablespoons chopped fresh mint"], "directions": ["HEAT the coconut oil in a large saucepan over medium-high heat. Add the chicken and cook, turning once, until well-browned on both sides, 6 to 8 minutes. (The chicken will not be cooked through at this point.) Remove the pan from the heat. Carefully add the broth, ginger, fish sauce, and pepper flakes. Return to the heat and bring to a boil.  Reduce the heat and simmer, covered, until the internal temperature of  the chicken is 165°F, 5 to 6 minutes. Transfer the chicken to a cutting board to cool slightly.", "ADD the zucchini noodles and carrots to the hot broth. Cook over medium-high heat until the vegetables are crisp-tender, 1 to 2 minutes.", "USING two forks, coarsely shred the chicken. Add the chicken back to the pan and gently stir in the green onions and cilantro. Top servings with bean sprouts, mint, and additional cilantro if using."]}, {"id": "ytPa", "title": "Chinese Chicken Salad with Citrus-Miso Dressing", "image": "https://images.yumprint.com/p1yumprintvz/Vzx-bGsMhY1GZTXz7P2M_IURytCInFP6uzF664iehNtAB7fqcpNXoeB66BrBPFb1", "link": "http://www.eatingwell.com/recipes/chinese_chicken_salad_citrus_miso_dressing.html?socsrc=ewfb0426166", "ingredients": ["3/4 cup sesame seeds", "3/4 teaspoon sea salt", "DRESSING", "1/3 cup freshly squeezed clementine or orange juice (about 3 clementines)", "3 tablespoons rice vinegar", "2 tablespoons white miso paste (see Tip)", "1 tablespoon honey", "1 tablespoon toasted sesame oil", "2 teaspoons sambal oelek", "SALAD", "6 cups thinly sliced napa cabbage", "2 cups sugar snap peas, thinly sliced diagonally", "4 clementines or mandarins, peeled and sectioned", "2 cups shredded cooked chicken breast", "1/2 cup coarsely chopped fresh mint", "1/4 cup sliced scallions, white and green parts"], "directions": ["To prepare gomasio: Toast sesame seeds in a medium-size dry skillet over medium heat, stirring constantly, until golden brown, 4 to 5 minutes. Add salt and cook, stirring constantly, for about 1 minute more. Transfer to a plate or bowl and let cool completely.", "Transfer mixture to a spice grinder and pulse a few times to grind coarsely; there should be a few whole seeds remaining (or use a mortar and pestle).", "To prepare dressing: Whisk juice, vinegar, miso, honey, sesame oil and sambal oelek in a small bowl.", "To prepare salad: Combine cabbage, peas, clementines (or mandarins), chicken, mint and scallions in a large bowl. Drizzle with the dressing and toss gently to combine.", "Divide among 4 large salad plates or shallow bowls. Sprinkle each serving with 1 teaspoon of the gomasio (see Tip).", "Gomasio [goh-MAH-shee-oh] is a Japanese seasoning made with toasted sesame seeds coarsely ground with a small amount of sea salt. It has a wonderful nutty flavor that sparks up plain roasted or grilled vegetables, sautéed greens, salads and grilled fish. Store leftover gomasio in an airtight glass container in the refrigerator up to 3 weeks.", "Miso is fermented soybean paste made by inoculating a mixture of soybeans, salt and grains (usually barley or rice) with koji, a beneficial mold. Miso is undeniably salty, so a little goes a long way. White or sweet miso (Shiromiso), made with soy and rice, is yellow and milder in flavor; use for soup, salad dressings and sauces for fish or chicken. Look for it near tofu at well-stocked supermarkets."]}, {"id": "uS0x", "title": "Chinese Pork & Vegetable Hot Pot", "image": "https://images.yumprint.com/p1yumprintuh/uh2tZ9ejcrydXYID8BI9xZ4Z6l_Gf_kAipfq3qhIKV_Xiw7BCux42yDmMWKZJuSf", "link": "http://www.eatingwell.com/recipes/chinese_pork_vegetable_hot_pot.html", "ingredients": ["2 cups baby carrots", "2 medium white turnips, (8 ounces total), peeled and cut into 3/4-inch-wide wedges", "2 1/4 pounds boneless pork shoulder, (picnic or Boston-butt), trimmed and cut into 1 1/2-inch chunks", "1 bunch scallions, sliced, white and green parts separated", "1 14-ounce can reduced-sodium chicken broth", "1/2 cup water", "1/4 cup reduced-sodium soy sauce", "3 tablespoons medium or dry sherry, (see Ingredient Note)", "4 teaspoons brown sugar", "2 tablespoons minced fresh ginger", "1 tablespoon rice vinegar", "2-4 teaspoons Chinese chile-garlic sauce", "4 cloves garlic, minced", "1 star anise pod, (see Ingredient Note) or 1 teaspoon aniseed", "1 cinnamon stick", "4 teaspoons cornstarch mixed with 2 tablespoons water", "2 tablespoons toasted sesame seeds, (see Ingredient Note) for garnish"], "directions": ["Place carrots and turnips in the bottom and up the sides of a 4-quart or larger slow cooker. Top with pork and scallion whites. Bring broth, water, soy sauce, sherry, brown sugar, ginger, vinegar, chile-garlic sauce to taste and garlic to a simmer in a medium saucepan over medium-high heat. Pour over the pork and vegetables. Nestle star anise pod (or aniseed) and cinnamon stick into the stew. Cover and cook until the pork and vegetables are tender, 3 to 3 1/2 hours on high or 5 1/2 to 6 hours on low.", "Discard the star anise pod and cinnamon stick. Skim or blot any visible fat from the surface of the stew. Add the cornstarch mixture, cover and cook on high, stirring 2 or 3 times, until slightly thickened, 10 to 15 minutes. Serve sprinkled with scallion greens and sesame seeds.", "Ingredient Notes: Sherry is a type of fortified wine originally from southern Spain. Don't use the “cooking sherry” sold in many supermarkets—it can be surprisingly high in sodium. Instead, purchase medium or dry sherry that's sold with other fortified wines in your wine or liquor store.", "Star anise (named for its star-shaped pods) lends a distinctive licorice-like flavor to numerous Asian dishes. The pods come from a small evergreen tree that is native to China. Look for star anise in the bulk spice sections of natural-foods stores, in Asian markets or online at penzeys.com.", "Sesame seeds can be purchased already toasted. If you can't find them, toast your own in a small dry skillet over low heat, stirring constantly, until golden and fragrant, about 2 minutes."]}, {"id": "dR8N", "title": "Classic Summer Rolls", "image": "https://images.yumprint.com/p1yumprint9a/9AQGLi06gTXIGdWu4d-dRjbm5xeNuU6JjRRcN4aef67gHikANt5-8QMBXEKoIaaF", "link": null, "ingredients": ["White vinegar for cooking the shrimp", "6 to 8 medium to large raw shrimp, peeled and deveined", "Two 10-inch or three 8-inch rice paper wrappers", "Handful fresh bean sprouts", "3 or 4 sprigs mint, stemmed and shredded", "12 (approximately) sprigs cilantro, stemmed and shredded", "Chopped roasted salted peanuts, cooked rice or cellophane noodles, Thai basil, grated carrots, lettuce (optional)"], "directions": ["In a small saucepan, place enough vinegar to later submerge the shrimp, and bring to a boil. Add shrimp and simmer, stirring gently, until just pink (about 2 minutes). Drain and rinse. Assemble the other prepared ingredients by your cutting board.", "Rinse a rice paper wrapper with water (the temperature's not terribly important — anywhere from cool to warm) — just enough to moisten both sides — and shake it off. Now you'll need to work quickly, as you have about a minute and a half between when the wrapper softens enough to fold and when it becomes too limp and sticky.", "Lay the damp wrapper on cutting board and, working quickly, assemble a line of ingredients on the lower third of the wrapper. Fold in the left and right edges. You should now have straight sides, and the line of ingredients should be just covered by folded wrapper on each end. Press down the edges to help them stick, and then start rolling away from you, tucking in the ingredients as you go. By the time you get to the end, the wrapper will eagerly stick to itself, making a neat package. Do not try to unroll it.", "Makes 2 or 3 rolls"]}, {"id": "yZAM", "title": "Crock Pot Cashew Chicken", "image": "https://images.yumprint.com/p1yumprinthy/HyGZq0QQTf6EAqSSiv44obe_jKHFjVw3afF_96nAY37jFAi4WLRDDwaho-7-ZUj5", "link": "http://www.daydreamkitchen.com/2012/09/crock-pot-cashew-chicken/", "ingredients": ["2 lbs boneless & skinless chicken breast tenders", "1/2 cup cashews", "1 garlic clove, minced", "4 tbsps rice wine vinegar", "2 tbsp brown sugar", "1 tbsp canola oil", "1 tsp grated fresh ginger", "1/4 cup all purpose flour", "1/2 cup soy sauce", "1 tsp black pepper", "1/4 tsp red pepper flakes", "4 tbsps ketchup"], "directions": ["Mix flour & pepper in a big resealable food storage bag.", "Mix again, this time with the chicken.", "Heat oil in a pan over high flame.", "Add the chicken for 4 mins while flipping sides.", "Put the chicken in bag for slow cooking.", "Make the sauce in a bowl by combining soy sauce, vinegar, ketchup, sugar, garlic, ginger, and pepper flakes.", "Pour over chicken and cook (on low!) for 3 hrs.", "Mix with the cashews.", "Combine with rice for the complete experience.", "Add the sauce."]}, {"id": "A78b", "title": "Crockpot Beef and Broccoli Recipe", "image": "https://images.yumprint.com/p1yumprint7t/7tRL8GAYQ3jQbOSYyl6KSjw2GQZA8_dni6KGm3p3pJLYSP846f8W7IJG6GJBCI4M", "link": "https://draxe.com/recipe/crockpot-beef-broccoli/?utm_source=newsletter&utm_medium=email&utm_campaign=sep_23_newsletter_a", "ingredients": ["1 pound thin beef ribeye, sliced into strips", "1/4 cup coconut aminos", "2 tablespoons white wine", "2 tablespoons apple cider vinegar", "2 teaspoons coconut oil", "2 cloves smashed and chopped garlic", "1/2 teaspoon red pepper flakes", "1 head of broccoli, broken into pieces", "1 tablespoon sesame seeds"], "directions": ["Add the liquid to the crockpot.", "Add garlic and stir in spices", "Toss meat in crockpot to coat.", "Cook on low for 6–8 hours", "Add broccoli about an hour before serving.", "Sprinkle sesame seeds over top and serve."]}, {"id": "D8g0", "title": "Cucumber Noodles with Asparagus and Ginger Scallion Sesame Sauce", "image": "https://images.yumprint.com/p1yumprintdu/Du-kfs1qSothGe3bTAQYjKqYJjeOWccBhNfAbqIych6-NQIiGdRfhnHoqLL3-EaK", "link": "http://gourmandeinthekitchen.com/cucumber-noodles-asparagus-ginger-scallion-sesame-sauce/", "ingredients": ["2 to 3 small scallions (green onions), thinly sliced", "One 2 to 3 inch piece of fresh ginger, peeled and grated on a microplane or fine zester", "1 teaspoon/5ml toasted sesame oil", "2 Tablespoons/30ml olive oil (chose one with a fairly light and neutral flavor)", "1 1/2 Tablespoons/23ml coconut aminos or gluten-free tamari", "1 /8th teaspoon red pepper flakes , or more to taste", "Pinch of sea salt, to taste", "1 bunch asparagus, ends trimmed and sliced on the diagonal into 2 inch pieces", "2 English hothouse cucumbers, peeled", "2 Tablespoons/30g toasted sesame seeds to garnish (optional)"], "directions": ["In a large bowl whisk together the scallions, ginger, toasted sesame oil , olive oil, coconut aminos , red pepper flakes .", "Taste and add a pinch of salt if needed. Set aside while you make the asparagus and cucumber noodles. Bring a pot of salted water to a boil. Blanch the asparagus spears until crisp tender (about 2 minutes) then drain and shock in a bowl of ice water to stop the cooking and set color.Using a julienne peeler or spiralizer create long noodles from the peeled cucumbers. (If using a julienne peeler, run it lengthwise until you reach the core then turn a ¼ turn and repeat all the way around. Toss the cucumber noodles with the ginger scallion sauce, add the cooled blanched asparagus and toss gently again to combine. Sprinkle with toasted sesame seeds and serve."]}, {"id": "DJC9", "title": "Daikon Noodles with Red Cabbage, Spinach Slaw and Sesame Mustard Dressing", "image": "https://images.yumprint.com/p1yumprintis/isRWGz55WDDOYE9ffg2k6dESZpzT5Bw9noGszyYAf1MVRYk2YaZFuIVDMuu-Qgz8", "link": "http://gourmandeinthekitchen.com/daikon-noodles-with-red-cabbage-spinach-slaw-and-sesame-mustard-dressing/", "ingredients": ["3 to 4 large Daikon radishes, peeled", "1/2 large head red cabbage, thinly sliced", "4 oz baby spinach, thinly sliced", "2 Tablespoons/30ml extra virgin olive oil", "2 teaspoons/10ml toasted sesame oil (use un-toasted for a fully raw recipe)", "1 ½ Tablespoon/22ml apple cider vinegar", "1 teaspoon/5ml maple syrup (or use raw coconut nectar)", "2 teaspoons/10ml Dijon mustard", "A pinch of sea salt", "A pinch of freshly ground black pepper", "2 Tablespoons/30g white and black sesame seeds"], "directions": ["Using a spiralizer or julienne peeler , create long strips of daikon noodles.", "Whisk together the olive oil, sesame oil, apple cider vinegar, maple syrup, Dijon mustard and a pinch of salt and pepper together in a large serving bowl", "Toss the noodles with the dressing and thinly sliced red cabbage and spinach. Add the white and black sesame seeds and let site for at least 10 minutes before serving to allow the flavors to marry."]}, {"id": "KhUI", "title": "Easy Miso Soup", "image": "https://images.yumprint.com/p1yumprint0-/0-DkLEstm75gTiS2ynroQGJFsh-IfVPpyLScNdt4v4stcSfiRKSVwhJtwCxGC12I", "link": "https://hormonesbalance.com/recipes/easy-miso-soup/?fbclid=IwAR1TK0yEl_0WbDQ01YRFkBc-EjVcdObBZ-JyiG574LXa94aNQi0RZIOzG3A&utm_medium=post&utm_source=facebook", "ingredients": ["2 tablespoons dried wakame", "2 tablespoons dried arame", "1 cup hot water", "1 quart Classic Chicken Broth, divided", "1½ cups sliced shiitake mushrooms", "1 kelp sheet", "3 tablespoons sweet white miso paste", "9- to 12-ounce black codfish fillet, cut into ½-inch pieces", "2 cups firmly packed green leafy vegetables such as kale, spinach, or collard greens", "½ cup fresh broccoli sprouts", "2 tablespoons chopped scallions", "2 teaspoons roasted sesame oil"], "directions": ["In a medium bowl, soak the wakame and arame in the hot water. Set aside.", "In a medium saucepan, place 3 cups of the broth, mushrooms, and kelp. Cover, bring to a boil, and simmer for 10 minutes.", "In a small bowl, whisk the remaining broth with the miso paste until fully dissolved. Set aside.", "Add the cod to the saucepan, turn off the heat, and cover for 3 minutes.", "Gently fold in the green leafy vegetables to the saucepan and cover again for another 3 to 5 minutes or until greens have withered.", "Gently stir in the miso paste to the saucepan.", "Remove the kelp sheet before serving. Ladle into bowls and top with drained wakame, arame, sprouts, scallions, and sesame oil."]}, {"id": "BrFv", "title": "Easy Miso-Chicken Ramen", "image": "https://images.yumprint.com/p1yumprintq6/Q6lRbzcLmq3WBC7ygwwOR5OJC7RjWfFDiTXbAgEyLzVgQ7pRUjp7mdFyQuw8PVBX", "link": "http://www.eatingwell.com/recipe/252520/easy-miso-chicken-ramen/", "ingredients": ["2 tablespoons toasted sesame oil, divided1 bunch scallions, sliced, white and green parts separated4 cloves garlic, minced1 tablespoon finely grated fresh ginger4 cups water3 tablespoons white miso (see Tip)1 1/2 tablespoons reduced-sodium soy sauce1 1/4 pounds boneless, skinless chicken thighs, trimmed, cut into bite-size pieces8 cups chopped bok choy4 ounces dried Chinese noodles, broken in half4 ounces shiitake mushrooms, stemmed and sliced (2 cups sliced)"], "directions": ["Heat 1 tablespoon oil in a large saucepan or Dutch oven over medium-high heat. Add scallion whites, garlic and ginger and cook, stirring, until fragrant, about 1 minute. Add water, miso, soy sauce and the remaining 1 tablespoon oil; bring to a boil. Stir in chicken, bok choy, noodles and mushrooms. Cover and return to a boil. Uncover, reduce heat to medium and cook, stirring, until the chicken is cooked through and the vegetables are tender, 3 to 5 minutes. Serve sprinkled with the scallion greens."]}, {"id": "ry4t", "title": "Easy Pad Thai with Chicken", "image": "https://images.yumprint.com/p1yumprintki/KIJjnRf0M4iEAOyuq3XPWCLZEeNpYS5AUU_MkMECO9RGJz9fVTpyHh7IyfRr4OGU", "link": "http://www.justataste.com/easy-best-pad-thai-chicken-recipe/", "ingredients": ["8 ounces Thai rice noodles", "2 large boneless skinless chicken breasts", "1 teaspoon cornstarch", "3 Tablespoons low sodium soy sauce", "Vegetable oil, for stir-frying", "4 cloves garlic, minced", "1/4 teaspoon crushed red pepper flakes", "2 cups fresh bean sprouts", "1/4 cup chicken stock", "1/2 cup sliced carrots, for garnish", "1/2 cup shredded red cabbage, for garnish", "1/4 cup cilantro leaves, for garnish", "1/4 cup sliced scallions, for garnish", "1/3 cup roughly chopped peanuts, for garnish", "Lime wedges, for garnish"], "directions": ["A majority of the specialty ingredients in this recipe can be found in the Asian aisle of most supermarkets. My preferred brand of rice noodles is Annie Chun's Pad Thai Noodles.", "It's important to bring the sauce to a boil so that it will thicken enough as it cooks with the noodles.", "Make sure you have all of your ingredients prepped and ready to go before you start cooking. This is a fast recipe that comes together in less than 10 minutes once the garlic hits the pan."]}, {"id": "ftQZ", "title": "Easy Soy-Ginger Chicken (Low Carb & Gluten-Free)", "image": "https://images.yumprint.com/p1yumprintkp/KP3pFn4iKuA2y7z4FZsPlMkL-lKpXA0F6Ju1bx8ljx5ZVbaa1WG2949ejsx9JXxD", "link": "http://www.theironyou.com/2014/02/easy-soy-ginger-chicken-low-carb-gluten.html", "ingredients": ["1 lb / 453 gr free-range organic chicken breast, cut into 1½-inch chunks", "2 tablespoons arrowroot powder*, divided", "⅓ cup wheat-free soy sauce (or coconut aminos)", "2 tablespoons raw organic honey (or raw coconut palm sugar such as Madhava)", "2 garlic cloves, minced", "handful fresh cilantro, chopped", "1 piece fresh ginger (about 2-inches), peeled and finely chopped", "1 tablespoon balsamic vinegar", "1 teaspoon ground coriander", "½ teaspoon ground black pepper", "5 scallions, thinly sliced on the diagonal", "2 medium carrots, thinly sliced crosswise", "arrowroot powder acts like cornstarch."], "directions": ["In a saucepan whisk  1 tablespoon of arrowroot powder with 2 tablespoons of water until lumps are gone. Add soy sauce, honey, garlic, ginger, vinegar, coriander and pepper and bring to a boil over medium heat. Reduce to a simmer and cook until sauce thickens and coats the back of a spoon, about 5 to 6 minutes. Set aside.", "Combine chicken chunks and remaining 1 tablespoon of arrowroot powder, a pinch of salt and pepper in a Ziploc bag (or a shallow dish) and shake/toss until all chicken pieces are evenly coated.", "Heat one tablespoon of olive oil in a wok (or large skillet) over medium-heat until sizzling. Add chicken and cook for 3 minutes on one side. Turn and cook for another 3 minutes. Transfer to a plate and set aside.", "Heat remaining 1 tablespoon of olive oil in the wok (or skillet) over medium-high heat until sizzling. Add carrots and stir-fry for 2 minutes, add scallions and stir-fry for another minute.", "Add chicken and sauce, lower the heat to low and toss until combined.", "Transfer to a plate, top with chopped scallions, sesame seeds and serve.", "One serving yields 270 calories, 4 grams of fat, 16 grams of carbs and 36 grams of protein."]}, {"id": "KgBD", "title": "Edamame & Salmon Stir-Fry with Miso Butter", "image": null, "link": "http://www.eatingwell.com/recipe/251217/edamame-salmon-stir-fry-with-miso-butter/", "ingredients": ["3 tablespoons white miso (see Tips)2 tablespoons unsalted butter, melted1 tablespoon water2 tablespoons extra-virgin olive oil, divided1 pound salmon (see Tips), skinned and cut into 1-inch pieces1 cup sliced shallots (about 3 medium)1 medium zucchini, halved lengthwise and sliced8 ounces frozen shelled edamame (about 1½ cups), thawed¼ cup chopped fresh basil"], "directions": ["Whisk miso, butter and water in a small bowl. Heat 1 tablespoon oil in a 14-inch flat-bottomed wok or large cast-iron skillet over medium-high heat until very hot but not smoking. Add salmon and cook, stirring gently, until almost cooked through, about 3 minutes. Transfer to a plate. Add the remaining 1 tablespoon oil, shallots, zucchini and edamame to the pan; cook, stirring, until the vegetables are almost tender, 3 to 4 minutes. Stir in the miso sauce until well coated. Gently stir in the salmon and basil."]}, {"id": "IG7L", "title": "Egg Drop Soup", "image": null, "link": "https://tornadoughalli.com/egg-drop-soup/", "ingredients": ["4 cup chicken broth", "1/2-1 tsp fresh grated ginger", "1 Tbs soy sauce", "2 Tbs water", "2 Tbs cornstarch", "2 eggs beaten", "3 green onions chopped", "Salt and pepper"], "directions": ["In pot on stove add your broth, ginger and soy sauce and bring to a boil.", "Mix together your water and cornstarch and add to boiling broth and stir, reducing heat to medium.", "Using a whisk slowly pour in your beaten eggs into your broth and stir clockwise until all eggs are added.", "Whisk in (in the same direction) your chopped green onions, salt and pepper."]}, {"id": "Kj02", "title": "EGG ROLL IN A BOWL", "image": null, "link": "http://www.myrecipesdiaries.com/2018/10/egg-roll-in-bowl.html", "ingredients": ["2 Tbsp. Olive oil divided", "1 lb. ground turkey or beef 93/7", "1 ½ cup sweet onion finely diced", "1 cup carrots shredded", "½ tsp ginger minced", "3 cloves garlic crushed", "¼ cup chicken broth", "5 cups cabbage cut into ¼-inch shreds", "2 Tbsp. coconut aminos or soy sauce, gluten-free*", "2 tsp. apple cider vinegar", "½ tsp. salt to taste", "¼ tsp. pepper to taste", "1 tsp. toasted sesame oil"], "directions": ["In a large saute pan over medium heat drizzle 1 tablespoon olive oil and add ground turkey. Cook for 5-6 minutes, or until turkey is almost cooked through."]}, {"id": "sU25", "title": "Elise's Sesame Noodles", "image": "https://images.yumprint.com/p1yumprintfe/fET88kn-60ahQ__BfVhXbHfAij52Kv7uJzYH9FZWVLqMul26FQINVnX5mIj-kZKQ", "link": "http://www.eatingwell.com/recipes/elises_sesame_noodles.html", "ingredients": ["1 pound whole-wheat spaghetti", "1/2 cup reduced-sodium soy sauce", "2 tablespoons sesame oil", "2 tablespoons canola oil", "2 tablespoons rice-wine vinegar, or lime juice", "1 1/2 teaspoons crushed red pepper", "1 bunch scallions, sliced, divided", "1/4 cup chopped fresh cilantro, divided (optional)", "4 cups snow peas, trimmed and sliced on the bias", "1 medium red bell pepper, thinly sliced", "1/2 cup toasted sesame seeds"], "directions": ["Bring a large pot of water to a boil. Cook spaghetti until just tender, 9 to 11 minutes or according to package directions. Drain; rinse under cold water.", "Meanwhile, whisk soy sauce, sesame oil, canola oil, vinegar (or lime juice), crushed red pepper, 1/4 cup scallions and 2 tablespoons cilantro (if using). Add noodles, snow peas and bell pepper; toss to coat.", "To serve, mix in sesame seeds and garnish with the remaining scallions and cilantro.", "TIPS & NOTES", "Make Ahead Tip: Prepare through Step 2 up to 2 hours in advance.", "NUTRITION", "Per serving: 345 calories; 12 g fat (2 g sat, 5 g mono); 0 mg cholesterol; 51 g carbohydrates; 0 g added sugars; 12 g protein; 10 g fiber; 542 mg sodium; 336 mg potassium.", "Nutrition Bonus: Vitamin C (100% daily value), Fiber (40% dv), Vitamin A (40% dv)."]}, {"id": "FCyL", "title": "Homemade Teriyaki Sauce", "image": "https://images.yumprint.com/p1yumprintp2/p2MC0M6KVV5O36j3RmJTMFbjiy1oQSjccBH8vpOPn1WoNFCCHu9iHGK2mV7UjcQ7", "link": "https://www.onegoodthingbyjillee.com/gluten-free-teriyaki-sauce", "ingredients": ["1 1/2 cups cold water", "3/4 cup packed brown sugar", "1/2 cup soy sauce*", "1 tsp garlic powder or granulated garlic", "3 Tbsp corn starch", "1 tsp sesame oil"], "directions": ["Add the water, brown sugar, soy sauce, garlic powder, corn starch, and sesame oil to a saucepan. Whisk well and place on your stove over medium heat.", "Whisk the mixture continually while cooking, until the sauce has thickened and the color has darkened.", "Remove the sauce from heat, and transfer to an airtight container. Keep in your fridge for up to one week.", "We poured our teriyaki sauce over a bowl of rice, grilled chicken, broccoli, and bell peppers. Yum! It’s also great on fish, steak, and pork too!"]}, {"id": "ACRC", "title": "How To Make Summer Rolls", "image": "https://images.yumprint.com/p1yumprintkq/kQqVPNc1dBRAIKdVKgoHmq57dF548CZy7Ytt9vSJkiEe0HYp2-oGQS3FaHzsa1JZ", "link": "http://www.thekitchn.com/how-to-make-summer-rolls-234167?utm_source=facebook&utm_medium=social&utm_campaign=eatingwell", "ingredients": ["4 ounces dried cellophane noodles (also called bean threads)", "1/2 teaspoon Asian sesame oil", "16 (8 1/2-inch) rice paper wrappers", "30 fresh basil or mint leaves", "8 leaves bibb or butter lettuce, halved"], "directions": ["Cook the shrimp: Bring the water to a boil in a medium saucepan over high heat. Have an ice water bath ready. Add the shrimp to the boiling water and cook for 1 minute. Immediately remove the shrimp with a slotted spoon to the ice water bath. Let sit for 5 minutes, then drain. Slice the shrimp in half horizontally (also known as butterflying) and set aside. Reserve the warm water for cooking the noodles.", "Make the vegetable filling: Whisk the vinegar, sugar, fish sauce, and lime juice together in a large bowl. Add the cucumber, carrot, radishes, and scallion, and toss to combine; set aside.", "Cook the noodles: If the noodles are very long, break them into smaller bits. Return the pan of water from cooking the shrimp to a boil, then turn off the heat, add the noodles, and let sit until tender, about 10 minutes (check the package directions for times). Drain the noodles, transfer them to a bowl, add the sesame oil, and toss to combine; set aside.", "Soften a wrapper: Fill a pie plate halfway with room-temperature water. Immerse 1 wrapper in the water until it softens, about 30 seconds. Use both hands to pull it up out of the water, being careful so it doesn't collapse on itself, and immediately lay it flat on a clean work surface.", "Fill the wrapper: Place 2 to 3 mint or basil leaves down the wrapper, just slightly to the left of center. Place 3 to 4 pieces of shrimp cut-side up on the herbs. Place a piece of lettuce in your hand, then fill evenly with 1/4 cup of the vegetable mixture and 1 to 2 tablespoons of noodles. Place the lettuce cup to the right of the shrimp, leaving a small gap.", "Roll up the summer roll: Fold the top and bottom of the wrapper over the filling. Fold the left side over the shrimp and continue rolling tightly to the right until it's closed and snug. Place it on a baking sheet seam-side down and cover with a damp towel. Repeat with the remaining wrappers and filling, adding more water to the pie dish as needed.", "Serve: To serve, cut each roll in half crosswise if desired and serve with peanut sauce for dipping.", "Make ahead: These summer rolls can be made up to 2 hours in advance. Keep tightly covered in plastic wrap at room temperature."]}, {"id": "xvxk", "title": "Japanese Chicken Meatballs (Tsukune)", "image": "https://images.yumprint.com/p1yumprint4q/4qCrDM0Ku0M-PqVGIk1euR4mYNkA5Lor7I4_RUMI-WUWJEAvRMXeloUDlENyS5ZL", "link": "http://www.eatingwell.com/recipes/japanese_meatballs.html", "ingredients": ["18 scallions, trimmed", "1 teaspoon toasted sesame oil", "1 teaspoon sesame seeds, toasted (see Tips)", "Lime-Jalapeno Chicken"], "directions": ["To prepare meatballs: Place shiitakes in a small bowl; cover with boiling water and let soak for 45 minutes. Drain the mushrooms. Remove and discard the stems; finely chop the caps. Combine the chopped caps, ground chicken (or turkey), breadcrumbs, egg white, scallion whites, cornstarch, ginger, garlic, honey, salt and pepper in a large bowl. Gently mix and squeeze until well combined. Use a generous 2 tablespoons each to shape the mixture into 24 meatballs. Place on a plate, cover with plastic wrap and refrigerate for at least 30 minutes or up to 1 day.", "To prepare glaze: Combine mirin (or sherry), soy sauce, lemon juice, brown sugar and ginger in a small saucepan; bring to a boil over high heat. Stir in the cornstarch-water mixture, reduce heat to medium-low and cook, stirring frequently, until slightly thickened, 2 to 5 minutes.", "To prepare kebabs: Preheat half to two-thirds of a gas grill to medium-high (1 burner if you have a 2-burner grill; 2 burners on a 3-burner grill) or build a medium-high-heat fire on one side of a charcoal grill.", "Thread the meatballs onto flat metal skewers, 4 per skewer. Oil the grill rack (see Tips). Grill the kebabs over direct heat, turning once, until marked, 5 to 6 minutes per side. (If you try to turn the kebabs too early, the meatballs will stick to the grill. Let them cook for a minute or two longer before turning so the meat will release from the grill.) Move the kebabs to the unlit side. Brush the tops with the glaze and grill for 2 minutes. Turn the kebabs over, brush with more glaze and grill for about 2 minutes more. Remove to a clean large serving platter; tent with foil to keep warm.", "Grill scallions over direct heat, lightly brushing them with some of the glaze and turning frequently so the glaze doesn’t burn, until tender-crisp and with a few char marks, 2 to 3 minutes total. Transfer to the platter.", "Drizzle the kebabs with any leftover glaze and sesame oil; sprinkle with sesame seeds.", "Make Ahead Tip: Prepare meatballs and glaze (Steps 1 & 2), cover and refrigerate for up to up to 1 day. | Equipment: 6 (10- to 12-inch) flat skewers", "Note: Mirin is a low-alcohol rice wine essential to Japanese cooking. Look for it in the Asian section of the supermarket or at Asian markets. An equal portion of dry sherry or white wine with a pinch of sugar may be substituted.", "Tips: To make dry breadcrumbs, trim crusts from whole-wheat bread. Tear bread into pieces and process in a food processor until coarse crumbs form. Spread on a baking sheet and bake at 250°F until dry, about 10 to 15 minutes. (1 slice = about 1/3 cup dry breadcrumbs.) For store-bought coarse dry breadcrumbs we like Ian’s brand, labeled “Panko breadcrumbs.”", "To toast chopped nuts or seeds, cook in a small dry skillet over medium-low heat, stirring, until lightly browned, 2 to 4 minutes.", "Oiling a grill rack before you grill foods helps ensure that the food won’t stick. Oil a folded paper towel, hold it with tongs and rub it over the rack. (Do not use cooking spray on a hot grill.) When grilling delicate foods like tofu and fish, it is helpful to coat the food with cooking spray."]}, {"id": "BTSH", "title": "Japanese Chicken Noodle Soup", "image": "https://images.yumprint.com/p1yumprint-e/-e9w1cwpo45w7kPUYp9MsyVOOOcr_OeoWo7VypxblBUrAMWzFGkEh4ae_3_ZdOEa", "link": "http://www.eatingwell.com/recipe/251277/japanese-chicken-noodle-soup/", "ingredients": ["2 tablespoons extra-virgin olive oil1 cup chopped onion2 large cloves garlic, minced", "1 tablespoon minced fresh ginger8 cups low-sodium chicken broth2 pounds bone-in chicken breasts, skin removed", "3 cups sliced green cabbage2 cups sliced shiitake or enoki mushrooms2 cups julienned carrots1 1/4 teaspoons salt", "1/2 teaspoon ground pepper3 cups cooked udon noodles or whole-wheat spaghetti2 tablespoons white miso (see Tip)"], "directions": ["Heat oil in a large pot over medium heat. Add onion and garlic and cook, stirring occasionally, until softened, 2 to 3 minutes. Add ginger; cook, stirring, for 1 minute. Add broth and chicken. Cover, increase heat to high and bring to a simmer. Uncover and cook, turning the chicken occasionally, until an instant-read thermometer inserted into the thickest part without touching bone registers 165°F, 20 to 22 minutes. Skim any foam from the surface as the chicken cooks. Transfer the chicken to a clean cutting board. When cool enough to handle, remove the meat from the bones and shred. Meanwhile, add cabbage, mushrooms and carrots to the pot; return to a simmer. Cook until vegetables are tender, 4 to 10 minutes. Stir in the shredded chicken, salt, pepper and noodles and cook until heated through, about 3 minutes more. Remove from heat and stir in miso.", "Make Ahead Tip: Cover and refrigerate, without the noodles and miso, for up to 3 days. To serve,", "stir in noodles and reheat, then stir in miso.", "Miso is a fermented soybean paste that adds flavor to dishes like soups and sauces. It is available in different colors; in general, the lighter the color, the milder the flavor. Look for miso alongside refrigerated tofu. It keeps in the refrigerator for at least a year"]}, {"id": "BTSG", "title": "Japanese Chicken-Scallion Rice Bowl", "image": "https://images.yumprint.com/p1yumprintsv/sv1KkmEzv-KaJC2P-oZ3wCUVEtNlc9ODL4IB54CCKu7RXHZqXKmwpy9DLiBNiy_G", "link": "http://www.eatingwell.com/recipe/248923/japanese-chicken-scallion-rice-bowl/", "ingredients": ["1 1/2 cups instant brown rice", "1 cup reduced-sodium chicken broth", "1 1/2 tablespoons sugar2 tablespoons reduced-sodium soy sauce", "1 tablespoon mirin, (see Ingredient note)2 large egg whites1 large egg8 ounces boneless, skinless chicken breasts, cut into 1/2-inch pieces", "6 scallions, trimmed and thinly sliced"], "directions": ["Prepare instant brown rice according to package directions. Pour broth into a heavy medium saucepan, along with sugar, soy sauce and mirin. Bring to a boil; reduce heat to medium-low. Stir egg whites and whole egg in a small bowl until just mixed. Add chicken to the simmering broth. Gently pour in the egg mixture, without stirring. Sprinkle scallions on top. When the egg starts to firm up, after about 3 minutes, stir it with chopsticks or a knife. (The chicken will be cooked by now.) Divide the rice among 4 deep soup bowls and top with the chicken mixture.", "Ingredient Note: Mirin is a low-alcohol rice wine essential to Japanese cooking. Look for it in your supermarket with the Asian or gourmet ingredients. An equal portion of sherry or white wine with a pinch of sugar may be substituted for mirin.", "People with celiac disease or gluten-sensitivity should use soy sauces that are labeled \"gluten-free,\" as soy sauce may contain wheat or other gluten-containing sweeteners and flavors."]}, {"id": "z1CK", "title": "Japanese-Style Wasabi Steak Salad", "image": "https://images.yumprint.com/p1yumprintt6/t6wx-1_kkUqgPOEbmKvKqvTQFBaiPIEDt2HjmVjIVHZJjlALGfpbcJ6qA0Plx4Nb", "link": "https://www.pamperedchef.com/pws/kris/recipe/Main+Dishes/Asian/Japanese-Style+Wasabi+Steak+Salad/72965", "ingredients": ["6 tbsp (90 mL) rice vinegar", "2 tsp (5 mL) Asian Seasoning Mix", "1/2 tsp (2 mL) salt", "1/4 tsp (1 mL) coarsely ground black pepper", "1/2 cup (125 mL) dark sesame oil", "1 tbsp (15 mL) prepared wasabi paste", "Steak and Salad", "1 flank steak (about 1-1 1/2 lb/500-750 g)", "1/2 package (8 oz/2500 g) uncooked straight-cut rice noodles", "1 small carrot, peeled and cut into julienne strips", "3 radishes, sliced", "2 cups (500 mL) sugar snap peas", "1/2 seedless cucumber, scored and sliced", "1/4 cup (50 mL) toasted sesame seeds"], "directions": ["For marinade and dressing, combine first five ingredients in Small Batter Bowl. Slowly add oil, whisking until well blended. For steak, place flank steak in resealable plastic bag; add 1/4 cup (50 mL) of the marinade. Seal bag; turn to coat. Marinate in refrigerator 3 hours or overnight. (Cover remaining marinade and refrigerate for use as dressing.)", "Meanwhile, for salad, cook noodles according to package directions in (4-qt./4 L) Casserole. Drain and rinse under cold water; place in Stainless (4-qt./4 L) Mixing Bowl. Add carrot, radishes, and peas to noodles. Reserve 2 tbsp (30 mL) of the dressing. Pour remaining dressing over noodle mixture; toss to coat. Cover; refrigerate until ready to serve.", "Heat Grill Pan over medium heat 5 minutes. Remove steak from marinade; discard marinade. Grill steak 15-20 minutes or until Digital Pocket Thermometer registers 140°F (63°C) for medium-rare doneness or 155°F (68°C) for medium doneness, turning occasionally. Remove steak to cutting board; let stand 5 minutes. Carve steak diagonally across the grain into thin slices.", "For each serving, arrange noodle mixture, cucumber slices and steak on serving plates. Drizzle 2 tbsp (30 mL) reserved dressing over salad. Sprinkle with sesame seeds.", "Cook's Tips:", "Flank steak is a flat cut of beef that is best when marinated in order to tenderize it. Once cooked, it must be carved across the grain so that the slices are tender, rather than stringy and fibrous. To cut diagonally across the grain, check for the direction the meat fibers are running, then cut crosswise into thin slices, angling the knife slightly."]}, {"id": "Bx_6", "title": "Korean Beef Bulgogi", "image": "https://images.yumprint.com/p1yumprintwo/WOUac3buEBYHE4FPkRg0kqF9mhkD8fxdvQ_GlQ4fKUWm4lZB5r-muI3_I4eicR2X", "link": "http://www.cuisinerecipes.com/2015/04/16/korean-beef-bulgogi/2/", "ingredients": ["12 oz. rib-eye steak, cut into ¼-inch-thick strips", "Salt and black pepper", "Sliced scallions", "Toasted sesame seeds"], "directions": ["Prepare vermicelli according to package directions. Toss vermicelli with 2 Tbsp. scallions, 1 Tbsp. sesame oil, and 1 Tbsp. sesame seeds.", "Preheat grill to high. Brush grill grate with oil.", "Simmer brown sugar, vinegar, soy sauce, ginger, garlic, 2 tsp. sesame oil, and chili garlic sauce for the sauce in a small saucepan over high heat. Combine water and cornstarch, then whisk into sauce. Return sauce to a boil and simmer 1 minute; remove from heat.", "Season rib-eye strips with salt and pepper; grill 2 minutes per side, then toss in 2 Tbsp. sauce. Arrange strips on two plates and garnish with scallions and sesame seeds. Serve beef with vermicelli, Spicy Pickled Vegetables, and remaining sauce on the side."]}, {"id": "xL9X", "title": "Korean Beef Stir-Fry", "image": "https://images.yumprint.com/p1yumprinty4/y4y7V6NGKkwryhUAxreYYkvYRwEYOUhIBJ-bw4jTQXoKij5l4GQRq3he62IeHyyp", "link": "http://www.eatingwell.com/recipes/korean_beef_stir_fry.html", "ingredients": ["3 tablespoons mirin, (see Note)", "2 tablespoons reduced-sodium soy sauce", "2 teaspoons cornstarch", "1 tablespoon canola oil", "8 ounces flank steak, trimmed of fat and very thinly sliced against the grain (see Tip)", "1 tablespoon chopped garlic", "2 teaspoons chopped jalapeno pepper, or to taste", "1 1/2 teaspoons chopped fresh ginger", "4 cups mung bean sprouts", "1 6-ounce bag baby spinach", "1/4 cup chopped fresh cilantro", "1 teaspoon toasted sesame oil", "2 tablespoons toasted sesame seeds, (see Tip), optional"], "directions": ["Combine mirin, soy sauce and cornstarch in a small bowl.", "Heat oil in a large nonstick skillet over medium-high heat. Spread steak out in the pan and cook until seared on one side, about 1 minute. Add garlic, jalapeno and ginger and cook, stirring, until fragrant, about 30 seconds. Add bean sprouts and spinach (the pan will be very full). Pour the mirin mixture into the pan and stir gently until the sauce thickens and the spinach is wilted, about 3 minutes. Stir in cilantro and sesame oil. Serve topped with sesame seeds (if using).", "Note: Mirin is a low-alcohol rice wine essential to Japanese cooking. Look for it in the Asian or gourmet-ingredients section of your supermarket. An equal portion of sherry or white wine with a pinch of sugar may be substituted for mirin.", "Tips: If you have a little extra time before dinner, put the steak in the freezer for about 20 minutes to help make it easier to slice thinly.", "To toast sesame seeds, heat a small dry skillet over low heat. Add sesame seeds and stir constantly until golden and fragrant, about 2 minutes. Transfer to a small bowl and let cool."]}, {"id": "zoVC", "title": "Korean Sizzling Beef", "image": "https://images.yumprint.com/p1yumprintd0/D0veMEFrFfPb9mUCjcm2VJnd9kjMVucoMtN4CV4Z0nLTHrkuFCqU9m9A5squwIUW", "link": "http://www.foodandwine.com/recipes/korean-sizzling-beef", "ingredients": ["1/4 cup soy sauce", "2 tablespoons sugar", "2 tablespoons dry white wine", "2 large garlic cloves, very finely chopped", "1 tablespoon toasted sesame oil", "2 teaspoons crushed red pepper", "One 2 1/2-pound beef flank steak, cut across the grain into twenty 1/4-inch-thick slices", "16 scallions", "Vegetable oil, for rubbing", "Salt", "Get Ingredients"], "directions": ["In a large, shallow dish, combine the soy sauce with the sugar, white wine, chopped garlic, toasted sesame oil and crushed red pepper, stirring to dissolve the sugar. Add the sliced flank steak and coat thoroughly in the marinade. Cover and refrigerate the steak for at least 4 hours or overnight.", "Light a grill or heat a griddle. Rub the scallions all over with vegetable oil and grill them over high heat, turning once, until the scallions are just softened, about 2 minutes. Season with salt.", "Working in batches, grill the steak over high heat until the slices are richly browned and medium-rare, about 30 seconds per side. Transfer the steak to a serving platter and serve with the grilled scallions and steamed rice.", "Serve this with a structured, cassis-rich, tannic Bordeaux."]}, {"id": "x2Zz", "title": "Lemongrass Pork & Spaghetti Squash Noodle Bowl with Peanut Sauce", "image": "https://images.yumprint.com/p1yumprintul/ULiCVRbY7RwnLyBrmauVgxeMrvfYcdPsBAd2lH6eySOoKmDFEE1edYEfBO6mGRs0", "link": "http://www.eatingwell.com/recipes/lemongrass_pork_spaghetti_squash_noodle_bowl_peanut_sauce.html", "ingredients": ["2 tablespoons minced fresh ginger, divided", "2 tablespoons minced fresh lemongrass (see Tip)", "2 tablespoons light brown sugar", "2 tablespoons reduced-sodium soy sauce", "1 tablespoon fish sauce", "1 pound pork tenderloin, cut into 1/2-inch slices", "1 2 1/2- to 3-pound spaghetti squash, halved lengthwise and seeded", "3 tablespoons peanut oil, divided", "1 pound baby spinach", "1/2 cup “lite” coconut milk", "1/4 cup smooth natural peanut butter", "1/4 cup water"], "directions": ["Combine 1 tablespoon ginger, lemongrass, brown sugar, soy sauce and fish sauce in a shallow dish. Add pork, turn to coat and let stand, turning once or twice, for 20 minutes.", "Meanwhile, place squash cut-side down in a microwave-safe dish; add 2 tablespoons water. Microwave, uncovered, on High until the flesh is tender, about 10 minutes. (Alternatively, place squash halves cut-side down on a rimmed baking sheet. Bake in a 400°F oven until the squash is tender, 40 to 50 minutes.)", "Heat 2 tablespoons oil in a large skillet over medium-high heat. Add the remaining 1 tablespoon ginger and add spinach a few handfuls at a time, cooking and stirring until all the spinach has wilted, 1 to 2 minutes total. Transfer to a plate; cover to keep warm.", "Wipe out the pan, add the remaining 1 tablespoon oil and heat over medium-high. Add the pork (and marinade) and cook, turning once, until browned, about 2 minutes per side. Transfer the pork to the plate with the spinach and cover; leave the liquid in the pan.", "Add coconut milk, peanut butter and 1/4 cup water to the pan; cook, stirring and scraping up any brown bits, for 1 minute.", "To serve, scrape the squash from the shells with a fork and divide among 4 bowls. Drizzle each portion with 2 tablespoons of the peanut sauce, top with pork and spinach, then drizzle with the remaining peanut sauce.", "Find lemongrass—a woody, scallion-shaped herb with an aromatic lemon flavor—in the produce section of well-stocked supermarkets or Asian food shops. To use, trim off the root end and grassy top. Peel off the outer layer and thinly slice (or mince) the softer inner stalk."]}, {"id": "fcge", "title": "Lighter Sesame Noodles", "image": "https://images.yumprint.com/p1yumprintar/aRcCpDZZ6apNHtwPMK4i_MIroV_Z5hCP_j3QQElL4skaA0PdhLEDqiJ1Yh-x4CHI", "link": "http://shine.yahoo.com/food/recipes/lighter-sesame-noodles-317780-mslo.html", "ingredients": ["12 ounces whole-wheat spaghetti", "1 bunch broccoli, cut into florets, stalks peeled and thinly sliced", "2 red bell peppers (ribs and seeds removed), thinly sliced", "1 large onion, halved and thinly sliced", "1/4 cup creamy peanut butter", "3 tablespoons dark-brown sugar", "2 tablespoons rice vinegar", "2 tablespoons soy sauce", "1 tablespoon toasted sesame oil", "2 garlic cloves, minced", "1/2 to 1 teaspoon red-pepper flakes"], "directions": ["In a large pot of boiling salted water, cook spaghetti 3 minutes less than al dente. Add broccoli, bell peppers, and onion. Cook until pasta is al dente and vegetables are tender, 3 minutes more. Reserve 1/2 cup pasta water; drain pasta and vegetables.", "Meanwhile, in a large bowl, whisk together peanut butter, sugar, vinegar, soy sauce, oil, garlic, and red-pepper flakes. Add hot pasta and vegetables; toss to coat, thinning sauce with a little pasta water, if necessary. Serve at room temperature or chilled."]}, {"id": "x5lu", "title": "Mason Jar Asian Salad with Soy Ginger Dressing", "image": null, "link": "http://weeklyads.aldi.us/Aldi/ListingDetail/Index/?StoreID=2624255&ListingID=-2032898551&ItemDetailClickSource=grid", "ingredients": ["½ teaspoon minced fresh ginger", "1 teaspoon minced fresh garlic", "4 teaspoons Fusia Soy Sauce", "½ teaspoon Honey", "½ teaspoon Crushed Red Pepper", "4 teaspoons White Vinegar", "¼ cup Vegetable Oil", "1 ½ cups shredded green cabbage", "1 cup shredded carrots", "½ cup diced red pepper", "½ cup cooked Long Grain White Rice", "8 slices Mandarin Oranges", "1 tablespoon thinly sliced green onions"], "directions": ["For the dressing: In a small bowl, whisk together dressing ingredients until well blended.", "To assemble: In 2 16-ounce mason jars, pour 3 tablespoons of dressing in each jar. Divide the salad ingredients between the jars, layering them in the order listed.", "When ready to eat, shake jar to combine salad with dressing.", "TIP: To get a very fine mince, use a zester to grate the fresh garlic and ginger."]}, {"id": "BHB2", "title": "Mineral-Rich Vegetable Stir Fry Recipe", "image": "https://images.yumprint.com/p1yumprintao/aOYDWiHHemB9No5iGfbAmReYB2GOvNxVKfr0eEskh46Fg0A7knaONgu1lBp8DZqX", "link": "http://www.motherearthliving.com/food-and-recipes/recipes/vegetable-stir-fry-recipe-zmfz15sozhou", "ingredients": ["• 1⁄2 cup cubed tofu* processed with calcium sulfate (253 mg calcium, 3 mg iron)", "• 2 tablespoons sesame oil, divided", "• 2 cloves garlic, minced", "• 1 teaspoon fresh grated ginger", "• 1 cup broccoli florets (43 mg calcium, 19 mg magnesium, 0.66 mg iron)", "• 4 shiitake mushrooms, sliced (16 mg magnesium, 0.32 mg iron, 12 IU vitamin D)", "• 1 cup chopped Chinese cabbage or bok choy (74 mg calcium, 13 mg magnesium, 0.56 mg iron)", "• 1 cup shredded kale (24 mg calcium, 8 mg magnesium)", "• 2 tablespoons tamari", "• 1 tablespoon roasted sesame seeds (100 mg calcium, 40 mg magnesium, 1.64 mg iron)", "Or substitute a 3-ounce serving of chicken (sliced and sautéed), which contains 0.32 mcg B12, 8 mg calcium, 0.93 mg iron and 20 mg magnesium"], "directions": ["Sauté tofu in 1 tablespoon oil until golden. Remove from pan.", "In the same pan with remaining oil, sauté garlic, ginger, broccoli and mushrooms until mushrooms are soft and florets turn bright green.", "Return tofu to pan and add cabbage and kale. Stir in tamari and simmer 1 to 2 minutes.", "Top with roasted sesame seeds and serve immediately over brown rice or rice noodles, if you wish. Serves 2."]}, {"id": "sNlI", "title": "Miso Soup Recipe", "image": "https://images.yumprint.com/p1yumprintfp/fpm3iyEHS3mlkG8Fi8yAoeztKBr7x6YtqFoesSPxfFsdRYLsK-dqfLqNUdiCIaPW", "link": "http://www.motherearthliving.com/food-and-recipes/recipes/miso-soup-recipe-ze0z1303zsau.aspx", "ingredients": ["• 1/2 onion, finely sliced", "• 2 1/4 inch piece of wakame, immersed in water for 30 minutes, then sliced finely", "• 3 dried shiitake mushrooms, soaked in 1 cup water for 10 minutes, stems removed and thinly sliced (reserve the soaking water)", "• 1/2 carrot, cut into fine matchsticks", "• 1/2 daikon, thinly sliced into half moons", "• 1 tablespoon barley miso", "• 3 1/2 ounces Chinese cabbage or bok choy (pak choy), sliced into 2 cm (3/4 in) pieces", "• 2 tablespoons finely sliced spring onions (scallions)"], "directions": ["Bring the onion, wakame, shiitake and soaking liquid and 4 cups water to the boil over high heat.", "Reduce the heat to medium, cover and simmer for 15 minutes.", "Add the carrot and daikon and simmer for a further 3 minutes. Reduce the heat to very low so that the water stops boiling.", "Put the miso in a bowl, pour in some broth and mix until the miso dissolves.", "Add the diluted miso to the pan with the cabbage or bok choy.", "Increase the heat and simmer, without boiling, for another 3 minutes.", "Ladle the soup into bowls, top with spring onion and serve warm. Serves 4.", "Miso is a pick-me-up soup I enjoy as a winter breakfast, or a light evening meal. This soup is based on a few sliced vegetables in water, enriched with digestive-strengthening miso. White miso is sweet and creamy, while darker miso varieties, such as brown rice and barley miso, are more concentrated, saltier and deeply strengthening. A cup of miso a day keeps depression at bay!"]}, {"id": "KCRJ", "title": "Moo Shu Chicken Lettuce Wraps", "image": "https://images.yumprint.com/p1yumprintcf/cfq329KsnYeo-Mhu-PB6c5_unycdtksAKedJVb0lVvFm90QVW7WRjEEao3KoOneb", "link": "https://draxe.com/recipe/moo-shu-chicken/?utm_campaign=feed-posts&utm_medium=social&utm_source=facebook&utm_content=draxe&fbclid=IwAR2DSm_sKgAVle2RReYbMM9vKYlLowiKxwoPjbTRc49zRXWS5qav1zHsk2k", "ingredients": ["2 tablespoons avocado oil", "2 tablespoons balsamic vinegar", "1 tablespoon sesame oil", "2 tablespoons coconut aminos", "2 boneless skinless chicken breasts, thinly sliced", "¼ green cabbage, thinly sliced", "¼ red cabbage, thinly sliced", "¼ cup green onions, sliced", "½ cup mushrooms, chopped", "2 cloves garlic, minced", "1 teaspoon ginger, grated", "½ teaspoon sea salt", "½ teaspoon black pepper", "Carrots, shredded for garnishing", "Sprouts, for garnishing", "Sesame seeds for topping", "Butter lettuce for wraps"], "directions": ["In a medium-sized bowl, add sesame oil, balsamic, coconut aminos, ginger, garlic, salt, pepper and chicken. Mix thoroughly and set aside.", "Chop the vegetables accordingly.", "In a large pan over medium heat, combine avocado oil, onions and mushrooms. Sauté for about 5 minutes.", "Add chicken to brown, about 8 minutes.", "Add cabbage and reduce to low. Cover and let simmer for about 10 minutes, or until cabbage is soft. Stir occasionally.", "Serve with lettuce wraps and top with carrots, sprouts and sesame seeds."]}, {"id": "dR-K", "title": "Not-A-Sandwich Summer Rolls", "image": "https://images.yumprint.com/p1yumprintsl/sLd99HEFA_EVk-_1fS7uAelb8C6cbaQpcemYdkSvdm-xNakBuReb06376LL1iGSt", "link": "http://www.npr.org/2012/09/25/161752021/a-roll-for-all-seasons-wrapped-in-rice-paper", "ingredients": [], "directions": []}, {"id": "du-A", "title": "Okonomiyaki", "image": "https://images.yumprint.com/p1yumprintjd/JD8ELbQHjC261oF7WBaGd13X0Z7hSaW7jUuG0CFiDIjOtAfDZ4L5Cw-kBj0fuvSx", "link": "http://food52.com/recipes/12352-okonomiyaki", "ingredients": ["Sauce", "1/2c. mayonnaise", "2T. soy sauce", "2t. sriracha, more or less to taste", "Pancakes", "5 large eggs", "1t. soy sauce", "1t. sesame oil", "1t. sea salt", "1/3c. AP flour", "2c. cabbage, shredded with a mandoline or finely chopped", "1 bunch scallions, trimmed and chopped", "3/4c. (roughly) baby or chopped shrimp", "canola oil for frying", "1-2T.toasted sesame seeds", "bonito flakes (optional)"], "directions": ["Whisk the first set of ingredients together and voila, your sauce. Set aside while you make the pancakes. In a large mixing bowl, whisk eggs with the soy sauce, sesame oil, and salt. Gradually add the flour until incorporated. Fold in cabbage, scallions, and shrimp. Warm a couple glugs of canola oil in a skillet over medium-high heat until glistening. Ladle the batter into the skillet as you would for regular old pancakes. I usually make them about the size of saucer. Cook on each side for about 3 minutes or until golden brown. Keep pancakes covered in a warm oven as you make the rest. Scatter sesame seeds and/or bonito flakes on top of pancakes and serve with dipping sauce and a cold pilsner."]}, {"id": "KjYc", "title": "One Pot Keto Sesame Chicken and Broccoli", "image": null, "link": "https://peaceloveandlowcarb.com/one-pot-keto-sesame-chicken-and-broccoli/", "ingredients": ["1 pound boneless, skinless chicken breast, cubed", "12 ounces broccoli florets", "¼ cup coconut aminos, or soy sauce", "1 tablespoon avocado oil (I use this brand)", "1 teaspoon sesame oil", "1 ½ teaspoon arrowroot powder (get it here)", "1 clove garlic, minced", "½ teaspoon sesame seeds, plus extra for garnish", "Salt and pepper, to taste", "Red pepper flakes, for garnish", "Green onions, sliced, for garnish"], "directions": ["Place the broccoli florets in a microwave safe bowl with 1 tablespoon of water and cover with a damp paper towel. Microwave for 2 minutes until the broccoli is just becoming tender.", "In a small bowl, mix the coconut aminos and arrowroot powder and set aside", "In a large skillet over medium heat, add the avocado oil and garlic and sauté until fragrant, about 1 minute.", "Add the chicken to the skillet along with the salt and pepper, and sauté until cooked through, about 6 minutes.", "Once the chicken is just about done, add the sesame oil and broccoli to pan and sauté for an additional minute before pouring the coconut amino mixture over top.", "Sauté for 1 to 2 more minutes until all ingredients are well incorporated.", "Garnish with red pepper flakes, sesame seeds and green onions, before serving."]}, {"id": "pmQ_", "title": "Orange Teriyaki Beef Stew", "image": "https://images.yumprint.com/p1yumprintr5/r53Exui0lNtqPIJnUNKJpoUMLRXYY5G0hRXxQQL59MpFL4doZ4VZf_kGGCkHLS8Y", "link": "http://www.bhg.com/recipe/orange-teriyaki-beef-stew/", "ingredients": ["2 pounds boneless beef chuck roast, cut into 1-inch pieces", "1 tablespoon Chinese five-spice powder", "1/2 teaspoon salt", "1 tablespoon canola oil", "4 ounces fresh shiitake mushrooms, stemmed and sliced (1 1/2 cups)", "12 ounces bok choy, sliced crosswise, white and green portions separated", "3 cloves garlic, minced", "1 tablespoon grated fresh ginger", "1/2 teaspoon crushed red pepper", "2 cups lower-sodium beef broth", "1 cup orange juice", "1/2 cup reduced-sodium teriyaki sauce", "2 navel oranges, peeled and sliced"], "directions": ["Toss beef with five spice and salt. Heat oil in a 4-quart Dutch oven over medium-high heat. Add beef in batches and sear until browned all over, 5 to 8 minutes. Remove to a plate.", "Add mushrooms and white bok choy stems (reserve green leaves) and cook 2 minutes. Stir in ginger, garlic, and crushed red pepper and cook for 1 minute. Add broth, orange juice, and teriyaki sauce; bring to boiling, scraping pan bottom. Return beef to pan, cover and simmer over low heat for 45 to 60 minutes or until beef is tender. Add bok choy leaves the last 5 minutes of cooking. Garnish with oranges. Serve with hot cooked rice, if desired.", "Prepare as above, except after browning meat, add to a 4-quart slow cooker. Stir in mushrooms, white part of bok choy, ginger, garlic, crushed red pepper, beef broth, orange juice, and teriyaki sauce. Cover; cook on low-heat setting for 8 to 9 hours or on high-heat setting for 4 to 4 1/2 hours. Stir in green part of bok choy and garnish with oranges.", "Nutrition Facts (Orange Teriyaki Beef Stew )", "Per serving: 314 kcal cal., 19 g fat (7 g sat. fat, 1 g polyunsaturated fat, 8 g monounsatured fat), 99 mg chol., 665 mg sodium, 11 g carb., 1 g fiber, 8 g sugar, 25 g pro.", "Percent Daily Values are based on a 2,000 calorie diet"]}, {"id": "lENH", "title": "Paleo Cauliflower Fried Rice", "image": "https://images.yumprint.com/p1yumprint3b/3BIhDfnDPkG2lyjt-f7hBt3n2HRljh8rXwtW3cnxqlzKvUfxx1__XFud3lS7TYar", "link": "http://www.happychomp.com/paleo-cauliflower-fried-rice/", "ingredients": ["1 small head of cauliflower, grated", "Olive oil or bacon fat", "1 tbsp soy sauce", "salt and pepper, to taste", "Anything you want in your fried rice (I used onion, garlic, scallions, celery, mushrooms, cabbage, egg and ham)"], "directions": ["Grate cauliflower using a food processor or blender. If you don’t have either, you can use a cheese grater", "Dice the other ingredients you want to add into the fried rice", "Add oil or fat to frying pan on medium heat", "Add in the onions and garlic until they are translucent. Then add in all the other ingredients, except the cauliflower. Add soy sauce.", "When the veggies/meat are about done, add in the grated cauliflower and combine everything. 3-4 minutes should be enough time.", "Make a hole in the center of the fried rice and add in an egg. Mix everything together", "Salt and pepper, to taste and add some scallions on top!"]}, {"id": "j8g0", "title": "Paleo Fresh Spring Rolls", "image": "https://images.yumprint.com/p1yumprintdi/diuYN-twg3VYYZxPtDkR5DJuA6zNaeuRzrtHLuskUwA2ZxGARAo8Zw1IdYIpBPWM", "link": "http://stupideasypaleo.com/2013/06/24/paleo-fresh-spring-rolls/", "ingredients": ["1 large bunch of collard greens (you need one whole leaf per roll)", "6-7 medium-sized raw shrimp (about 1/4 pound)", "1 carrot, thinly sliced", "1/2 a cucumber, seeds removed and thinly sliced", "2 green onions, dark green tops removed and thinly sliced", "1 bunch of fresh mint, basil or cilantro leaves", "1 package kelp noodles (you’ll use about half), optional", "1/4 cup of Umami Mayo for dipping, optional"], "directions": ["You’ll need to blanch the collard leaves so they become more pliable and lose some of their bitter flavor (this can be done ahead of time). Set up a large bowl with ice water. Bring a very large pot of water to boiling. Dip the WHOLE collard leaves in the boiling water for 1 minute. Immediately place them in the ice water to cool and stop the cooking process. Drain and set aside.", "Peel and devein the shrimp, if needed. Into a small skillet over medium heat, place the raw shrimp and 2-3 tablespoons of water. Cover and steam until the shrimp are pink, about 2 minutes. Set aside to cool. Slice in half from head to tail.", "Rinse and drain the kelp noodles. Set aside.", "Prepare the carrot, cucumber and green onion. How thinly you slice them depends on how much chewing you want to be involved.", "Now that the collard leaves are cool, remove the tough stem with a sharp knife by cutting upward toward the top of the leaf in an upside-down V shape. The leaves will roll better.", "Now assemble a wrap: Lay the collard leaf on a flat surface. Place two halves of shrimp at the top of the leaf. Next, put a small amount of kelp noodles (a little less than a 1/4 cup worked for me). On top of that put a few mint leaves, and two or three slices EACH of carrot, cucumber and green onion.", "Now you’re ready to wrap, burrito-style. Gently but with a bit of pressure, roll from the shrimp end toward the stem end. Once you’ve rolled over once, fold in the sides and then finish rolling all way down.", "Repeat with the remaining ingredients.", "Slice each wrap in half and serve cold with your choice of dipping sauces, if desired."]}, {"id": "ggRn", "title": "Paleo Shrimp Chow Mein", "image": "https://images.yumprint.com/p1yumprintcz/cZIa75CVuwRLz9yJk5G7It4w_gSZvhgPo13Vu5bbLF57WTVYKLmWADxpGpbnZ_9o", "link": "http://www.thepaleomom.com/2012/04/recipe-paleo-shrimp-chow-mein.html", "ingredients": ["1 pound raw shrimp, deveined (tail on or off, it’s up to you)", "3 Tbsp dry white wine", "2 Tbsp extra virgin coconut oil (or other good cooking fat)", "1 small yellow onion", "2 cups snow peas (about ¾ pound)", "2 medium carrots", "1 5oz can Sliced Water Chestnuts", "1 5oz can Sliced Bamboo Shoots", "3 large Dried Shiitake Mushrooms", "1 clove garlic, finely minced", "¾ cups bone broth", "1 Tbsp Coconut Aminos", "1 pound Kelp Noodles", "1 green onion, chopped"], "directions": ["Soak dried mushrooms in warm water for 30 minutes (or follow the package directions).  Rinse and then slice into thin strips.", "Rinse and dry shrimp.  Toss with wine and let sit for 15 minutes.", "Slice carrots into 1” rounds, flip the rounds over and then slice into 1/8” rectangles.  Wash and trim stems off snow peas.  Slice onion into ½” wedges.  Mince garlic.  Drain and rinse water chestnuts and bamboo shoots.  Remove kelp noodles from package and rinse with cold water (or follow package directions).", "Heat a wok over medium-high heat.  Add coconut oil to hot walk.  Add garlic and stir until fragrant, about 1 minute.", "Add shrimp and wine to wok.  Cook, stirring frequently, until shrimp are cooked (until they just turn pink).  Remove shrimp from the walk (leave any juices in the wok though) and set aside.", "Add onion and carrot to the wok with bone broth and coconut aminos.  Cook, stirring frequently, for 3-4 minutes (just giving them a head start on the other vegetables).  The broth should be boiling.  If not, turn up to high heat.", "Add the remainder of the vegetables to the wok.  Cook ,stirring frequently, until the vegetables are cooked but still al dente, about 6-8 minutes.", "Add the shrimp (and any juices) back to the wok.  Stir to combine.", "Push the shrimp and veggies to the side of the wok to create a little hole in the middle.  Place the kelp noodles in the hole.  Let them simmer in the broth for 2-3 minutes, then start stirring to break up the kelp noodles and distribute throughout the chow mein (another 1-2 minutes).", "Garnish with chopped green onion and enjoy!"]}, {"id": "x735", "title": "Peanut-Chicken Cabbage Wraps", "image": "https://images.yumprint.com/p1yumprintms/mSStDktnL0RKT9KS4nJUJJOaClaxeTws-hO76lROikyn7rJ3cq-dt-gbxvsLpoU1", "link": "http://www.eatingwell.com/recipes/peanut_chicken_cabbage_wraps.html?socsrc=ewfb0407167", "ingredients": ["8 small napa or Savoy cabbage leaves or 4 large, cut in half crosswise", "1 tablespoon canola oil", "1 pound boneless, skinless chicken breast, trimmed and cut into bite-size pieces", "1/4 teaspoon salt", "5 tablespoons prepared peanut sauce", "1 tablespoon rice vinegar", "1 1/2 teaspoons lime zest", "1 cup julienned Asian pear", "1 cup julienned English cucumber", "1/4 cup finely chopped fresh cilantro"], "directions": ["Wash and dry cabbage leaves well and cut out any tough ribs or stems.", "Heat oil in a large nonstick skillet over medium-high heat. Add chicken, season with salt and cook, stirring often, until cooked through, 4 to 6 minutes.", "Meanwhile, whisk peanut sauce, vinegar and lime zest in a small bowl.", "Remove the pan from the heat, add the sauce mixture and stir to combine. Serve the chicken in the cabbage leaves, topped with pear, cucumber and cilantro."]}, {"id": "uBB9", "title": "Perfect Fried Rice in 5 Steps", "image": "https://images.yumprint.com/p1yumprintmk/mKUCPY2j_nxsLl5Lc_PWGLiWw-Ur68mvDiwn8EsJndFyrEpSP5v4A5NcEo0Ajmjx", "link": "http://www.eatingwell.com/blogs/healthy_cooking_blog/perfect_fried_rice_in_5_steps?socsrc=EWfb1110153", "ingredients": [], "directions": ["Add tons of fresh vegetables, such as broccoli, zucchini, carrots and eggplant, to the protein in the wok. Cook for 2 to 4 minutes, or until your vegetables have softened and the protein is cooked all the way through. Transfer all the contents of the wok to a large plate.", "Stir-Fry the Rice Separately", "Using cold brown rice (warm rice will stick to the wok), stir-fry the rice in oil until it’s hot. Use two wooden spatulas to pull the rice from the bottom to the top, tossing all around, so all the rice is evenly coated with the oil and cooked, about 2 minutes.", "Season Judiciously", "Return the protein, vegetables and egg to the wok with the rice. Add the seasonings, such as reduced-sodium soy sauce, lime juice, Japanese ponzu sauce or oyster sauce and stir to combine. When you have the option, elect for reduced-sodium sauces, because prepared sauces like soy sauce add great flavor but are often very high in sodium."]}, {"id": "Kfmc", "title": "Pho Ga (Vietnamese-Style Chicken Noodle Soup)", "image": "https://images.yumprint.com/p1yumprintla/lAZtTDhPteWj6su61Q_M07FeooHV22s7w_ARVxxD2oAmtp17o0BSaKrCa4RHMkET", "link": "https://nourishedkitchen.com/pho-ga-vietnamese-style-chicken-noodle-soup/?fbclid=IwAR3RM2FgFLH3iEqCQEfMRzGKzcfD89whMEbqcbw-zIJa1CovByBPv4ctPsU", "ingredients": ["1 whole chicken", "2 chicken feet, if available", "1 (4-inch) hand ginger", "1 bunch cilantro", "2 large shallots", "8 large green onions", "1 tablespoon coriander seeds", "2 star anise pods", "2 cloves", "2 tablespoons fish sauce (I like this brand)", "1 (8-ounce) package traditional flat rice noodles (find organic rice noodles here)", "1 white onion, thinly sliced", "2 jalapeno peppers, sliced about ⅛-inch thick", "2 limes, quartered", "Mung bean sprouts", "Hoisin (I use this brand.), for the table", "Sriracha (I use this brand.) or homemade fermented hot chile sauce, for the table"], "directions": ["Parboil the chicken and chicken feet by first tucking them into a stock pot. Cover the bird with water by 2 inches. Bring to a boil over high heat, and allow the chicken to boil for 5 minutes. Turn off the heat, drain off the liquid and rinse any foam or scum off the chicken. Wipe out the pot. Place the chicken and its feet back in the pot.", "Split the ginger crosswise. Stem the cilantro, reserving both the stems and the leaves. Cut the shallots in half lengthwise, and then separate the white and light-green parts of the green onions from the dark-green parts.", "Add the ginger, cilantro stems, shallots, and root tips of the green onions to the stock pot with the chicken, and then drop in the coriander, star anise and cloves. Pour enough water into the stock pot to cover the chicken by two inches. Bring the contents of the pot to a boil over high-heat, and then immediately turn down the heat to medium-low. Simmer for thirty minutes, and then remove the chicken from the pot. Cut the chicken breasts from the bone, slice them thinly and set them in an airtight-container in the fridge. Return the chicken to the pot, and continue simmering it a further 2 hours. Strain the broth, discarding the solids. Wipe out the stockpot, and pour the strained broth back into the pot. Keep it warm over low heat while you prepare the other ingredients.", "Soak the flat noodles in hot water for 10 minutes. While they soak, bring a pot of hot water to a boil. Plunge the soaked noodles into the boiling water about 20 to 30 seconds, until tender, and then drain them. Chop the dark green parts of the green onion very thinly.", "Arrange the noodles, sliced chicken breast, sliced green onions and sliced white onion in your bowls.", "Arrange the sliced jalapeno, mung bean sprouts, and remaining herbs on a platter.", "When you're ready to serve the soup, ladle hot broth over the contents of the boil. At the table, allow guests to add additional herbs, and a squeeze of lime, hoisin or sriracha as they like.", "Notes", "Yes, you can make the broth ahead of time. Just store it in the fridge, or in the freezer until you're ready to use it.", "Using a premade broth will save time. You can use a traditional, long-simmered premade chicken bone broth (like this one) if you like to save time. Simply simmer the cilantro stems, spices, ginger, shallot and green onions in the broth about 20 minutes before straining and serving."]}, {"id": "Hq-A", "title": "Pho Ga (Vietnamese-Style Chicken Noodle Soup)", "image": "https://images.yumprint.com/p1yumprintla/lAZtTDhPteWj6su61Q_M07FeooHV22s7w_ARVxxD2oAmtp17o0BSaKrCa4RHMkET", "link": "http://nourishedkitchen.com/pho-ga-vietnamese-style-chicken-noodle-soup/", "ingredients": ["1 whole chicken", "2 chicken feet, if available", "1 (4-inch) hand ginger", "1 bunch cilantro", "2 large shallots", "8 large green onions", "1 tablespoon coriander seeds", "2 star anise pods", "2 cloves", "2 tablespoons fish sauce (I like this brand)", "1 (8-ounce) package traditional flat rice noodles (find organic rice noodles here)", "1 white onion, thinly sliced", "2 jalapeno peppers, sliced about ⅛-inch thick", "2 limes, quartered", "Mung bean sprouts"], "directions": ["Parboil the chicken and chicken feet by first tucking them into a stock pot. Cover the bird with water by 2 inches. Bring to a boil over high heat, and allow the chicken to boil for 5 minutes. Turn off the heat, drain off the liquid and rinse any foam or scum off the chicken. Wipe out the pot. Place the chicken and its feet back in the pot.", "Split the ginger crosswise. Stem the cilantro, reserving both the stems and the leaves. Cut the shallots in half lengthwise, and then separate the white and light-green parts of the green onions from the dark-green parts.", "Add the ginger, cilantro stems, shallots, and root tips of the green onions to the stock pot with the chicken, and then drop in the coriander, star anise and cloves. Pour enough water into the stock pot to cover the chicken by two inches. Bring the contents of the pot to a boil over high-heat, and then immediately turn down the heat to medium-low. Simmer for thirty minutes, and then remove the chicken from the pot. Cut the chicken breasts from the bone, slice them thinly and set them in an airtight-container in the fridge. Return the chicken to the pot, and continue simmering it a further 2 hours. Strain the broth, discarding the solids. Wipe out the stockpot, and pour the strained broth back into the pot. Keep it warm over low heat while you prepare the other ingredients.", "Soak the flat noodles in hot water for 10 minutes. While they soak, bring a pot of hot water to a boil. Plunge the soaked noodles into the boiling water about 20 to 30 seconds, until tender, and then drain them. Chop the dark green parts of the green onion very thinly.", "Arrange the noodles, sliced chicken breast, sliced green onions and sliced white onion in your bowls.", "Arrange the sliced jalapeno, mung bean sprouts, and remaining herbs on a platter.", "When you're ready to serve the soup, ladle hot broth over the contents of the boil. At the table, allow guests to add additional herbs, and a squeeze of lime, hoisin or sriracha as they like.", "Notes", "Yes, you can make the broth ahead of time. Just store it in the fridge, or in the freezer until you're ready to use it.", "Using a premade broth will save time. You can use a traditional, long-simmered premade chicken bone broth (like this one) if you like to save time. Simply simmer the cilantro stems, spices, ginger, shallot and green onions in the broth about 20 minutes before straining and serving."]}, {"id": "xOD8", "title": "Pineapple-Teriyaki Chicken", "image": "https://images.yumprint.com/p1yumprint6t/6t8hu9v4aE62ujxoay0RQPv417yvLVEv9AkYyB0aNzK7XXt3k9rOwkrm04kgVt0U", "link": "http://www.eatingwell.com/recipes/pineapple_teriyaki_chicken.html", "ingredients": ["1/3 cup dry sherry, (see Note)", "1/4 cup reduced-sodium soy sauce", "2 tablespoons brown sugar", "1 20-ounce can pineapple rings, plus 1/3 cup juice from the can", "4 large boneless, skinless chicken thighs, (about 1 1/2 pounds), trimmed (see Tip)", "1 teaspoon cornstarch", "1 tablespoon butter"], "directions": ["Whisk sherry, soy sauce, brown sugar and the 1/3 cup pineapple juice in a large bowl. Add pineapple rings and chicken and gently stir to coat. Refrigerate for 15 minutes.", "Meanwhile, preheat grill to medium-high.", "Remove the chicken and pineapple from the marinade and pat dry; reserve the marinade. Oil the grill rack. Grill the chicken and pineapple until the chicken is cooked through and the pineapple is marked, 4 to 5 minutes per side.", "Whisk the reserved marinade and cornstarch in a small saucepan. Bring to a boil and cook, whisking, until reduced and thickened, 2 to 4 minutes. Stir in butter. Serve the chicken and pineapple drizzled with the sauce."]}, {"id": "gaAb", "title": "Plum & Chicken Stir-Fry", "image": "https://images.yumprint.com/p1yumprintmn/MNa1XkiAGHEW3ltSVHV4Raijl4M_-sufmfHXCiJxSn9Qo3aW1o-ybTuu6kUV1ltw", "link": "http://www.cuisinerecipes.com/2014/03/27/plum-chicken-stir-fry/2/", "ingredients": ["2 Tbsp. minced fresh ginger", "1 bunch bok choy, ribs bias-sliced, leaves cut into ribbons", "2 cups scallions (3-inch pieces)", "2 cups trimmed sugar snap peas", "2 cups each mung bean sprouts and sliced fresh plums", "2 Tbsp. chopped dry-roasted peanuts"], "directions": ["For the chicken, whisk together sherry, broth, jam, soy sauce, vinegar, chili garlic sauce, five-spice powder, and cornstarch; add chicken and toss to coat.", "Coat wok with nonstick spray. Heat oil in wok over medium-high. Remove half the chicken from the marinade. Stir-fry chicken until brown, 2–3 minutes; transfer to a plate. Stir-fry remaining chicken, reserving marinade; transfer to plate. Remove wok from heat; coat with nonstick spray and return to heat.", "Add ginger; stir-fry 30 seconds. Add bok choy ribs and scallions; stir-fry two minutes. Add peas and bok choy leaves; stir-fry 2 minutes. Return chicken and reserved marinade to wok and heat until marinade thickens. Add sprouts and plums; stir-fry 1 minute. Garnish servings with peanuts.", "Nutrition Information", "Per serving: 337 cal; 9g total fat (2g sat); 56mg chol; 360mg sodium; 37g carb; 8g fiber; 28g protein"]}, {"id": "z-Zu", "title": "Pork & Broccoli Thai Noodle Salad for Two", "image": "https://images.yumprint.com/p1yumprintdw/DWauX3A9K5UQ-J8TaY-S-3rjM9fT10JAKsETvDf3yj-Illo2oQRd6AiQT2KqMlac", "link": "http://www.eatingwell.com/recipe/251010/pork-broccoli-thai-noodle-salad-for-two/", "ingredients": ["4 ounces wide rice noodles (see Tips)", "8 ounces lean ground pork (see Tips)", "1 tablespoon chopped fresh mint, divided", "3 teaspoons fish sauce, divided", "1 tablespoon sweet red chili sauce", "1 tablespoon lime juice", "1 1/2 teaspoons toasted sesame oil", "6 ounces broccoli slaw (from a 12-ounce pkg)", "Lime wedges for serving"], "directions": ["Bring 5 cups water to a boil in a large pot over high heat. Add noodles and cook, stirring frequently, until just tender, 4 to 6 minutes, or according to package directions. Drain, rinse well with cold water and let stand in the colander to drain. Meanwhile, combine pork, 1/2 tablespoon mint and 1 teaspoon fish sauce in a medium bowl. Form the mixture into 4 patties 3 inches wide. Heat a grill pan or cast-iron skillet over medium-high heat. Coat with cooking spray, add the patties, partially cover and cook for 3 minutes. Turn over and cook for 3 minutes, then turn back over and cook on the first side again until cooked through, 1 to 2 minutes more. Combine the remaining 2 teaspoons fish sauce, chili sauce, lime juice and sesame oil in a medium bowl. Add the rice noodles and broccoli slaw and gently toss until well combined. Serve the pork patties on the noodles, sprinkled with the remaining 1/2 tablespoon mint. Serve with lime wedges, if desired.", "Depending on your supermarket, it might be hard to find a lean option for ground pork. But it's easy to make your own in a food processor. Choose a lean cut, such as loin or tenderloin. Cut into pieces and then pulse in a food processor until uniformly ground (being careful not to overprocess, turning the meat into mush). Or ask your butcher to grind it for you. Using lean pork instead of regular ground pork saves up to 164 calories and 5 grams of saturated fat per 3 ounces of cooked meat."]}, {"id": "x2je", "title": "Pork & Turnip Miso Ramen", "image": "https://images.yumprint.com/p1yumprintx9/X95DFa15IHh98PI_8_kFDzSbqDYt0fOc3I0wmAmic7N61IgrWzSY8A2KH19KB73Y", "link": "http://www.eatingwell.com/recipes/pork_turnip_miso_ramen.html", "ingredients": ["1 1/2 pounds purple-top turnips, peeled", "2 teaspoons peanut oil", "6 scallions, sliced into 1-inch pieces", "1 tablespoon minced fresh ginger", "1 large clove garlic, minced", "8 ounces pork tenderloin, cut into 1-inch pieces", "3 cups low-sodium chicken broth", "3 cups water", "2 tablespoons white miso (see Tips)", "1 tablespoon reduced-sodium soy sauce", "1 tablespoon Shao Hsing rice wine (see Tips) or dry sherry", "6 ounces mushrooms, sliced (about 3 cups)", "6 cups baby spinach"], "directions": ["Using a spiral vegetable slicer or a julienne or regular vegetable peeler, cut turnips into long, thin strands. You should have about 10 cups of turnip “noodles.”", "Heat oil in a large pot over medium heat. Add scallions, ginger and garlic and cook, stirring, until fragrant, about 30 seconds. Add pork and cook, stirring, until starting to brown, about 1 minute. Add broth, water, miso, soy sauce and rice wine (or sherry); bring to a boil. Stir in the noodles, mushrooms and spinach. Cook, gently stirring to submerge the vegetables in the broth, until the noodles are just tender, about 3 minutes.", "TIPS & NOTES", "Look for mild-flavored white (sweet) miso, made with soy and rice, near tofu at well-stocked supermarkets. It will keep in the refrigerator for at least a year.", "Shao Hsing (or Shaoxing) is a seasoned rice wine used in Chinese cooking to flavor sauces, marinades and stir-fries. Look for it in Asian specialty markets or with other Asian ingredients in large supermarkets. In a pinch, dry sherry is a good substitute."]}, {"id": "BHB_", "title": "Quick Beef & Napa Cabbage Pho", "image": "https://images.yumprint.com/p1yumprintve/veKBW-zNMlX-Nexygko0pW25SUkknGt_cGS-2sSv8w9Ywz0MoklH7Fsdu9Jzn6FU", "link": "http://www.eatingwell.com/recipe/255747/quick-beef-napa-cabbage-pho/?utm_source=facebook&utm_medium=social&utm_campaign=etg_638143183_ew_dinnertonight", "ingredients": ["1 tablespoon peanut or grapeseed oil 1 medium onion, cut into 6 wedges 1 (2 inch) piece fresh ginger, sliced 2 star anise (see Tip) 1 cinnamon stick 1 teaspoon cardamom pods 1 teaspoon coriander seeds 1 teaspoon fennel seeds 4 cups unsalted beef stock or low-sodium beef broth 2 cups water 2 1/2 tablespoons fish sauce 4 ounces thin rice noodles or rice sticks 8 napa cabbage leaves, cut into 2-inch pieces 12 ounces top sirloin or boneless rib-eye steak, very thinly sliced 2 cups mung bean sprouts 1 cup fresh mint and/or Thai basil leaves 1 jalapeño pepper, sliced"], "directions": ["Heat oil in a large pot over medium-high heat. Add onion and ginger; cook, stirring, until starting to brown, 2 to 3 minutes. Add star anise, cinnamon stick, cardamom pods, coriander and fennel seeds; cook, stirring, for 30 seconds. Add stock (or broth), water and fish sauce; bring to a boil. Reduce heat to maintain a lively simmer, cover and cook for 5 minutes. Prepare rice noodles according to package directions. Drain and rinse well with cold water. Divide among 4 large soup bowls. Carefully pour the broth through a fine-mesh sieve into a large bowl (discard solids). Return the broth to the pot and bring to a boil. Add cabbage, cover and cook until tender, about 5 minutes. Stir in beef and cook for 1 minute. Remove from heat. Divide the cabbage, beef and broth among the bowls. Top with bean sprouts, mint and/or basil and jalapeño."]}, {"id": "F-CQ", "title": "Quick Pho", "image": "https://images.yumprint.com/p1yumprintz2/Z2Lpkpx8Jz25kUG71n21_gHBJgz2gPPjicKS1iPnToRDzizl-fwL_QgeQpYmtCwb", "link": "http://nourishedkitchen.com/quick-pho-recipe/", "ingredients": ["1 1⁄2 pounds top sirloin", "1 yellow onion, halved", "1 (3-inch) knob fresh ginger, halved", "2 pods star anise", "1 cinnamon stick, about 3 inches long", "1 teaspoon whole coriander seeds", "1⁄2 teaspoon fennel seeds", "2 whole cloves", "2 quarts Long-Simmered Roasted Beef Bone Broth (recipe here or purchase it here)", "1⁄4 cup fish sauce (I recommend this additive-free version)", "8 ounces dried Vietnamese-style flat rice noodles (Find them here.)", "4 green onions, cut on the diagonal into 1-inch-wide slices", "1 bunch cilantro", "1 bunch Thai basil", "1 bunch mint", "2 limes, quartered lengthwise", "2 jalapeños, thinly sliced", "1⁄4 cup hoisin sauce", "1⁄4 cup Sriracha sauce"], "directions": ["Place the meat in the freezer, this will make the meat easier to slice thinly.", "Drop the yellow onion and ginger along with the star anise, cinnamon, coriander, fennel seeds, and cloves into a 4-quart pot and then pour the broth over the vegetables and spices. Add the fish sauce and bring it all to a simmer over medium-high heat.", "While the broth simmers, set the rice noodles in a deep mixing bowl and cover them with boiling water. Leave them in the hot water until tender but not mushy, about 10 minutes. When tender, drain them in a colander.", "While the rice noodles soak in the hot water and the broth simmers, arrange the green onions on a serving platter. Separate the leaves of cilantro, Thai basil, and mint from their stems. Arrange the herbs and bean sprouts, as well as the limes and jalapeños, on the serving platter alongside the green onions.", "Take the meat from the freezer, and then slice it against the grain into wafer-thin pieces. Arrange the sliced meat in a small bowl. Spoon the hoisin sauce and Sriracha sauce into separate bowls.", "Arrange about one-quarter of the noodles into a nest in each of four individual bowls and then strain about 1 1⁄2 cups broth over the noodles into each bowl, taking care that no spices from the simmering broth make their way into the bowls.", "Serve the bowls of steaming-hot noodle soup. Encourage everyone at the table to add herbs, peppers, meat, and hoisin sauce, individualizing the seasonings and additions in their bowl as it suits them."]}, {"id": "E-kD", "title": "Saucy Coconut-Chicken Stir-Fry", "image": "https://images.yumprint.com/p1yumprinteb/eBBa85W7wI7MIk4WHFCSYhnf4Dc_hlAPqShdPxdvKDbqZh57V_DN1VpoAInZ9H5m", "link": "http://www.eatingwell.com/recipe/250140/saucy-coconut-chicken-stir-fry/?utm_source=facebook&utm_medium=social&utm_campaign=etg_1004123074_ew_dailynosh", "ingredients": ["4 teaspoons canola oil, divided 1 pound chicken tenders, cut into bite-size pieces 1 jalapeño pepper, minced (optional) 1 bunch scallions, sliced, whites and greens separated 2 cups sliced shiitake mushroom caps 1 tablespoon minced fresh ginger ¾ cup “lite” coconut milk 2 tablespoons fish sauce (see Note) 4 teaspoons lime juice 1 tablespoon brown sugar 6 cups sliced napa cabbage ¾ cup chopped fresh basil"], "directions": ["Heat 2 teaspoons oil in a wok or Dutch oven over medium-high heat. Add chicken and cook, stirring often, until cooked through and lightly browned, about 5 minutes. Transfer the chicken to a plate. Heat the remaining 2 teaspoons oil in the wok or pot. Add jalapeno (if using), scallion whites, mushrooms and ginger and cook, stirring, until fragrant and the mushrooms start to soften, 30 seconds to 1 minute. Stir in coconut milk, fish sauce, lime juice and brown sugar; bring to a simmer. Cook, stirring occasionally, until the mushrooms are tender, 2 to 3 minutes. Stir in cabbage, the chicken and scallion greens; cook, stirring constantly, until the cabbage is slightly wilted, 2 to 3 minutes. Stir in basil just before serving."]}, {"id": "E___", "title": "Sausage Egg Roll In A Bowl", "image": "https://images.yumprint.com/p1yumprintih/ihZNJ_gz7fmHmwGFATN2XlhUlGJTG8Bhjg9PYTysiRAqbIRUbbWd2qVDm1-Wq2p-", "link": "http://www.bunsinmyoven.com/2015/08/24/sausage-egg-roll-in-a-bowl/", "ingredients": ["1 pound ground pork sausage", "6 cups coleslaw mix or shredded cabbage", "4 cloves garlic, minced", "1 tablespoon ginger, minced", "1 tablespoon soy sauce", "1/4 cup chopped green onions", "1 tablespoon sesame oil"], "directions": ["Heat a large skillet over medium heat. Add the sausage and cook, stirring often to crumble, until cooked through. Do not drain.", "Add the coleslaw mix, garlic, ginger, and soy sauce to the skillet with the sausage. Cook for 3-4 minutes or until cabbage has softened a bit.", "Remove from the heat and top with the green onions and drizzle with sesame oil.", "Serve immediately."]}, {"id": "AGoY", "title": "Shiitake & Noodle Hot & Sour Soup", "image": "https://images.yumprint.com/p1yumprint09/09bJxZ9Gj0w1a3coz4eHiFgeg43ik0t_eizeofGly31l07RR67d-ySwzEjo_flZg", "link": "http://www.eatingwell.com/recipe/252506/shiitake-noodle-hot-sour-soup/", "ingredients": ["24 dried shiitake or black Chinese mushrooms (2-3 ounces)2 carrots, cut into 1/2-by-2-inch sticks", "2 8-ounce cans bamboo shoots, rinsed2 14-ounce packages extra-firm water-packed tofu, drained1 teaspoon ground white pepper4 cups thinly sliced green cabbage4 1/3 cups water, divided4 cups mushroom or vegetable broth1/4 cup white vinegar or rice vinegar1/4 cup red-wine vinegar1/4 cup reduced-sodium soy sauce, plus more to taste1 tablespoon chile-garlic sauce (see Tip), plus more to taste1 tablespoon minced fresh ginger3 tablespoons cornstarch1 tablespoon toasted sesame oil3 cups cooked lo mein noodles (about 6 ounces dry)1 cup sliced scallions"], "directions": ["Discard mushroom stems and cut the caps into 1/2-inch pieces. Spread the mushroom pieces in a 6-quart or larger slow cooker. Add carrots and bamboo shoots. Cut tofu into 1/2-inch pieces, add to slow cooker and sprinkle with white pepper. Top with cabbage. Combine 4 cups water, broth, both vinegars, soy sauce, chile-garlic sauce and ginger in a bowl; add to the slow cooker. Cover and cook 4 hours on High or 7 to 8 hours on Low. Whisk the remaining 1/3 cup water, cornstarch and sesame oil in a bowl. Stir into the soup. Cover and cook on High for 20 minutes. Stir in noodles, cover and heat through for 10 minutes. Serve topped with scallions and with more soy sauce and chile-garlic sauce, if desired.", "Make Ahead Tip: Prep mushrooms and vegetables; combine the liquids and ginger used in Step 2. Refrigerate separately.", "Equipment: 6-quart or larger slow cooker", "Tip: Look for chile-garlic sauce, a blend of ground chiles, garlic and vinegar, in the Asian section of large supermarkets. Refrigerate for up to 1 year.", "For easy cleanup, try a slow-cooker liner. These heat-resistant, disposable liners fit neatly inside the insert and help prevent food from sticking to the bottom and sides of your slow cooker."]}, {"id": "KnE1", "title": "Shrimp & Boy Choy Noodle Soup", "image": "https://images.yumprint.com/p1yumprintyl/YlUNiJsx4vB5Lq-DmOdNocWJlTw9lcagKuV64m8LdS68k17ytQA7X4xOrenoTsqX", "link": "https://thenutritionadventure.com/shrimp-bok-choy-noodle-soup/", "ingredients": ["1 tablespoon olive oil", "2 green onions, white & green parts divided, sliced", "2 cloves garlic, minced", "6 ounces sliced baby portobello mushrooms", "6 cups vegetable broth", "1 tablespoon soy sauce", "1/2 teaspoon crushed red pepper flakes", "1/4 teaspoon ground ginger", "2 cup savoy cabbage", "1 head baby bok choy, sliced", "3 ounces dry soba noodles", "12 ounces peeled, deveined shrimp", "Cilantro, for garnish", "Shichimi Togarashi, if desired"], "directions": ["Heat the olive oil in a large stock pot over medium heat. Once hot, add the sliced white onions and garlic and saute for 2 minutes, stirring frequently. Add mushrooms and cook for 2 minutes.", "Add vegetable broth, soy sauce, crushed red pepper, ground ginger, cabbage, and bok choy. Reduce heat to medium-low and cook for 10 minutes.", "Meanwhile, in a medium-size saucepan, boil 3 cups of water. Once boiling, add soba noodles and cook for about 5-7 minutes, or until noodles are cooked through. Drain from water. Add noodles to stock pot.", "Before serving, add shrimp to soup and cook for 3-4 minutes over medium-low heat. Shrimp should turn pink when cooked through. Garnish with cilantro and shichimi togarashi, if desired."]}, {"id": "vzIO", "title": "Simple Thai Broth", "image": "https://images.yumprint.com/p1yumprintsg/SgR9nkVuzWtPbeV_4QpJbbvvqLfFhQ7SP3IuUsKm86FaM4XWefRrMC6UKyzREXVn", "link": "http://www.thenourishinggourmet.com/2013/02/simple-thai-broth-oh-so-soothing-delicious.html", "ingredients": ["6 cups/1.4 liters homemade chicken stock", "1 (14 ounce/414 ml) can full-fat coconut milk", "4 inch/10 cm piece of ginger, cut into thin slices, or 2 tablespoons grated ginger", "3 garlic cloves, smashed", "Pinch or two red chili flakes", "For More Flavor: 1 stalk lemongrass cut in half, 2 teaspoons Thai red curry (optional)", "To Serve: Unrefined salt or fish sauce, fresh limes, chopped cilantro, sliced green onions (optional)"], "directions": ["Place the stock, coconut milk, ginger, garlic, and red chili flakes (plus lemongrass and/or Thai red curry, if using) in a large pot on high heat and bring to a boil.", "Turn down the heat and simmer the broth for ten minutes.", "Salt the broth with unrefined salt or fish sauce to taste. Remove the lemongrass, ginger (if you are using sliced), and garlic. Serve with a slice of lime, chopped cilantro, and/or sliced green onions, if desired.", "To make it a full meal, serve it over rice noodles and cook thinly sliced chicken (or add in shredded roasted chicken) and perhaps a bunch of spinach or bean sprouts in the broth, which rounds it out into a light and easy meal."]}, {"id": "w2QT", "title": "Singapore-Style Chicken & Noodle Soup", "image": "https://images.yumprint.com/p1yumprint_a/_a6cvzZ06eVmL95YHv2nNbQcHDNfVesjDNl2biQRwSBHo-IpjOrC1g35ON1hcfEg", "link": "http://www.eatingwell.com/recipes/singapore_chicken_noodle_soup.html?socsrc=ewfb0216163", "ingredients": ["2 cups chopped onions", "2 small red or green chiles (such as serrano or jalape_o), seeded and diced", "1 2-inch piece fresh ginger, peeled and coarsely chopped", "2 cloves garlic, crushed", "1/4 cup macadamia nuts", "3 tablespoons fish sauce", "2 teaspoons dark brown sugar", "1 tablespoon ground coriander", "2 teaspoons ground cumin", "1 teaspoon curry powder", "1 teaspoon ground turmeric", "1 teaspoon ground or crushed fennel seed", "1 teaspoon ground pepper", "2 tablespoons peanut oil", "6 cups low-sodium chicken broth or stock (or see Slow-Cooker Stock recipe, below)", "1 pound boneless, skinless chicken breast, trimmed", "1 14-ounce can ”lite” coconut milk", "2 tablespoons lime juice, or to taste", "2 tablespoons reduced-sodium soy sauce", "1 14-ounce package extra-firm tofu, drained, cut into 1/2-inch cubes", "1 cup diced tomatoes or one 14-ounce can diced tomatoes, drained", "1 7-ounce package mung bean sprouts (about 3 cups)", "8 ounces bean thread noodles (see Tips)", "3 hard-boiled eggs, thinly sliced", "6 scallions, thinly sliced", "1/2 cup coarsely chopped fresh cilantro", "Sriracha or other hot sauce for serving", "Lime wedges for serving"], "directions": ["Make Ahead Tip: Cover and refrigerate the noodles, soup and toppings in separate containers for up to 2 days.", "Slow-Cooker Chicken Stock: Cut 1 medium carrot, 1 celery stalk and 1 small onion into 1-inch pieces. Combine with 4 pounds skinless chicken leg quarters, 6 sprigs fresh parsley, 2 sprigs fresh thyme, 1 bay leaf, 1 crushed garlic clove and 20 whole peppercorns in a 6-quart slow cooker. Add 9 cups water. Cook on High for 4 hours. Strain and let cool to room temperature before refrigerating airtight for up to 1 week or freezing for up to 3 months. Makes: about 10 cups.", "After straining, this stock has negligible calories, nutrients and sodium.", "Bean Thread Noodles: Look for bean thread noodles, sometimes labeled vermicelli, mung bean or cellophane noodles, in the Asian section of large supermarkets or at an Asian market. Prepare according to package directions and rinse well to prevent sticking."]}, {"id": "B8cV", "title": "Skip Take-Out And Make This Flavorful Quinoa “Fried Rice”", "image": "https://images.yumprint.com/p1yumprintcn/CNk3eiJhD11r6psPKAina24Z2czXrU0qjd7VHS3f7bfKG4DU9-WW3BZzoHpFoQLM", "link": "https://www.buzzfeed.com/robertbroadfoot/this-quinoa-fried-rice-will-curb-your-take-out-cravings", "ingredients": ["1 cup uncooked quinoa (roughly 3 cups cooked quinoa)", "2 tablespoons vegetable oil", "1 tablespoon garlic, minced", "1 tablespoon ginger, minced", "8 ounces mushrooms", "12 ounces broccoli florets", "2 medium carrots, sliced", "1 cup peas", "2-3 eggs", "4 tablespoons reduced sodium soy sauce", "2 scallions, sliced for garnish"], "directions": ["In a medium pot, cook quinoa according to package instructions. Once cooked, fluff with a fork, then set aside.", "In a large pan, heat oil, then sauté garlic and ginger until fragrant.", "Add mushrooms, broccoli, and carrots. Stir until vegetables are tender.", "Return cooked quinoa to the pan. Add peas and stir until well-mixed. Create a space in the middle of the pan, add the eggs and scramble. Once the egg is cooked, stir it in with the rest of the dish.", "Add the soy sauce and give the dish a final stir.", "Serve while hot. Garnish with sliced scallions (optional)."]}, {"id": "r0Sy", "title": "Slow Cooker Asian-Style Chicken Lettuce Wraps (GF)", "image": "https://images.yumprint.com/p1yumprintgr/gR5YNUbUjIJbvX2fV0pmIkxgI3SIdL7ZIq9HKlD1VTdI2TfdyeNktmkQ0xgXCMFT", "link": "http://thenourishinghome.com/2014/08/slow-cooker-asian-chicken-wraps/", "ingredients": ["16 leaves of Boston lettuce (from about two heads)", "1 red bell pepper, chopped", "Orange wedges (use the oranges zested for the sauce)", "Optional: Sesame seeds, chopped chives and cilantro"], "directions": ["Put a small amount of chicken in the lettuce cup, pour sauce on, and then top red pepper, other desired toppings, and a little squeeze of orange juice."]}, {"id": "BdIm", "title": "slow cooker teriyaki chicken", "image": "https://images.yumprint.com/p1yumprint0u/0UjPck7BaRK6OwRxkCZnhPgl_tN_rZLOJ0Jl9gzh570D9ff6BzVO4ZZSrvZzdxNt", "link": "http://rachelschultz.com/2012/07/25/slow-cooker-teriyaki-chicken/", "ingredients": ["4 boneless, skinless chicken breasts", "½ cup sugar", "½ cup soy sauce", "3 tablespoons cider vinegar", "¾ teaspoon garlic, minced", "Salt & pepper"], "directions": ["Whisk together sugar, soy sauce, vinegar, and garlic.", "Season chicken breasts with salt & pepper and arrange in basin of slow cooker.", "Pour sauce over chicken and cook on high for two hours.", "Remove chicken from slow cooker and shred with two forks.", "Serve with your favorite vegetables and steamed rice."]}, {"id": "uS0D", "title": "Slow-Cooker Chicken Pho", "image": "https://images.yumprint.com/p1yumprintrj/rJFhRdhVCWoaX4bi94eFmIPWPAF2IvRnQjYugEv7h_AVInPI0YEqiesoTrz2QEfl", "link": "http://www.eatingwell.com/recipes/slow_cooker_chicken_pho.html", "ingredients": ["8 cups low-sodium chicken broth (two 32-ounce boxes)", "2 tablespoons light brown sugar", "2 tablespoons fish sauce", "10 whole star anise (see Tip)", "6 whole cloves", "1 2-inch piece fresh ginger, peeled and thinly sliced", "1 cinnamon stick", "2 bone-in chicken breasts (about 2 1/2 pounds total), skin removed, trimmed", "6 ounces wide rice noodles", "6 cups chopped bok choy", "2 cups mung bean sprouts", "2 cups fresh basil leaves", "1 cup fresh mint leaves", "1 cup fresh cilantro leaves", "1 fresh Thai chile or serrano, thinly sliced", "1 lime, cut into 6 wedges"], "directions": ["Combine broth, brown sugar, fish sauce, star anise, cloves, ginger and cinnamon stick in a 5- to 6-quart slow cooker. Add chicken breasts, meat-side down. Cover and cook on High for 4 hours (or on Low for 8 hours).", "Transfer the chicken to a cutting board. Remove spices and discard. Add noodles and bok choy to the slow cooker. Cover and cook on High for 30 minutes.", "Remove the chicken from the bone and shred with two forks. When the noodles are tender, stir in the shredded chicken. Serve bowls of soup with bean sprouts, basil, mint, cilantro, sliced chile and lime wedges on the side so everyone can add their own toppings.", "To prep ahead: Combine seasonings with broth; prep chicken; cover and refrigerate separately for up to 1 day. | Equipment: 5- to 6-quart slow cooker"]}, {"id": "ydcz", "title": "Slow-Cooker Honey-Orange Chicken Drumsticks", "image": "https://images.yumprint.com/p1yumprint0w/0WYLVGQ_Fql2-wzFB0z5HQ3yXn3R8dRq-o7ZEG_0Hh8MiDx8lTud42sa06gwImAo", "link": "http://www.eatingwell.com/recipes/slow_cooker_honey_orange_chicken_drumsticks.html?socsrc=ewfb0410163", "ingredients": ["1/3 cup honey", "2 teaspoons orange zest", "Orange Cara Cara", "2 tablespoons orange juice", "3 tablespoons reduced-sodium soy sauce or tamari", "3 cloves garlic, minced", "1 1/2 tablespoons minced fresh ginger", "1 tablespoon rice vinegar", "1/4 teaspoon crushed red pepper", "12 medium chicken drumsticks (3-3 1/2 pounds), skin removed (see Tip)", "2 tablespoons chopped fresh cilantro", "2 teaspoons toasted sesame seeds"], "directions": ["Combine honey, orange zest, orange juice, soy sauce (or tamari), garlic, ginger, vinegar and crushed red pepper in a small bowl.", "Coat a 5- to 6-quart slow cooker with cooking spray. Add drumsticks, pour in the sauce and mix to coat. Cover and cook until an instant-read thermometer registers 165°F when inserted into the thickest part of the meat without touching bone, 2 to 3 hours on High or 4 hours on Low.", "Transfer the drumsticks to a bowl. Very carefully pour the liquid from the slow cooker into a medium skillet. Bring to a boil over high heat. Boil until reduced and syrupy, 10 to 15 minutes. Pour the sauce over the drumsticks and stir to coat. Serve sprinkled with cilantro and sesame seeds.", "To remove the skin from chicken drumsticks, grip the skin from the meaty end of the drumstick with a paper towel and pull down toward the exposed bone until it comes off completely."]}, {"id": "CkjZ", "title": "Southeast Asian Pho", "image": "https://images.yumprint.com/p1yumprint2i/2I8dhd-qp_1z6qm5AhoM5GsdG5I3KAAQaSSYlNDw7JIEau0XMfwMiKsY333VhAUC", "link": "https://food52.com/recipes/35845-southeast-asian-pho", "ingredients": ["1 teaspoon fresh ginger", "1/2 red chile pepper, or to taste", "3 scallions", "1/2 yellow pepper", "2 handfuls spinach", "2 ounces vermicelli rice noodles", "1/2 chicken or vegetable stock cube (or generous pinch of salt)", "1 lime"], "directions": ["handful fresh cilantro and basil Begin by preparing your bowl at home up to 48 hours in advance. Peel the ginger and mince it. Add it to a large heatproof jar or container with a sealable lid. Finely chop the chile pepper (remove seeds if you prefer less spice) and add it to the minced ginger. Chop the white part of the scallions and slice the yellow pepper lengthwise into thin strips. Add the spinach leaves and rice noodles along with the stock cube. Slice the lime in half and add both halves to the container, then finely chop the herbs and add them on top. At lunchtime: Boil a pot of fresh water either using your office microwave or kettle. Remove the lime from your jar and pour the boiling water over the soup mix until it just covers everything. Using a fork, stir the soup until the stock has dissolved. Close the lid and give it a good shake. Let the soup rest for a minute then squeeze the lime over top."]}, {"id": "ytRZ", "title": "Spicy Grilled Chicken Salad with Noodles", "image": "https://images.yumprint.com/p1yumprintir/IrYvigZzeR92FVdTD1XHqUnmJ2qheiC0bTCc-aftSVLw_0U_LqBlgb0dYof5Ec5s", "link": "http://food52.com/recipes/18091-spicy-grilled-chicken-salad-with-noodles", "ingredients": ["3 scallions, white and green parts, thinly sliced", "2 cups shredded Savoy cabbage", "1 cup julienned carrots", "1 cup thinly sliced sugar snap peas (sliced on the diagonal)", "1 red pepper, seeded and thinly sliced", "1 jalapeno, seeded and thinly sliced", "1/3 cup lime juice", "1 clove garlic, minced", "1 tablespoon rice wine vinegar", "2 teaspoons Sriracha", "1 tablespoon light brown sugar", "5 tablespoons fish sauce", "1 tablespoon toasted sesame oil", "6 tablespoons walnut oil", "Sea salt", "8 ounces pad thai rice noodles", "Small handful fresh basil leaves, roughly chopped", "Small handful fresh mint leaves, roughly chopped"], "directions": ["Small handfuls fresh mint leaves, roughly chopped Combine all of the prepared vegetables (leaving out the herbs) in a large bowl. Remove the chicken from the refrigerator and let it sit at room temperature while you make the rest of the salad. To make the dressing, whisk together the lime juice, garlic, rice wine vinegar, Sriracha, brown sugar, fish sauce, sesame oil, walnut oil and ½ teaspoon sea salt. Taste and add more salt if you like. Set aside. Bring a large pot of salted water to a boil. Toss the vegetables with a couple pinches of sea salt. When the water is boiling, break the noodles in half and drop them into the pot. Cook the noodles according to the package directions, until they’re tender but still have a little bite. Drain the noodles and run them under cold water for a minute or two to cool them and keep them from getting gummy. Drain them again and add to the bowl with the vegetables. Heat a grill or a grill pan to medium heat. Remove the chicken thighs from the marinade and sprinkle each lightly with salt on all sides. Start the thighs fat-side down on the grill, cooking for 7 minutes, until the fat is crisp and charred. Flip the thighs and cook for another 5 to 7 minutes (slice into one with a sharp knife to check that there isn't any pink remaining). Once the chicken is cooked, remove it from the grill and set it aside to cool for about 5 minutes. When the thighs are cool enough to handle, cut the meat off the bones and then slice it crosswise, so that each slice includes a little strip of charred, crispy fat. Toss the vegetables and noodles with about two thirds of the dressing, and taste a noodle. Add more dressing if you like. Fold in the chicken and the herbs and serve. If you want to make this ahead of time, or if you end up with leftovers in the fridge, I recommend warming the salad gently before serving (cold rice noodles can get quite stiff). You can either warm the salad for 30 to 45 seconds in the microwave, or put it in a large sauté pan over medium low heat, tossing frequently, until it starts to loosen and warm, about 5 minutes."]}, {"id": "CaNP", "title": "Spicy Ramen Cup of Noodles", "image": "https://images.yumprint.com/p1yumprinthg/Hgyt8P8l7C95FPEEVvqMaXxYf-Rp_E0OB5WD2WEVvXw8Y3WRGEmRtE5-avbotsnU", "link": "http://www.eatingwell.com/recipe/256287/spicy-ramen-cup-of-noodles/?utm_source=facebook&utm_medium=social&utm_campaign=etg_683908459_editorialcontent", "ingredients": ["1 1/2 tablespoons reduced-sodium vegetable bouillon paste 1 1/2 teaspoons white miso 1 1/2 teaspoons chile-garlic sauce 1 1/2 teaspoons grated ginger 3/4 cup shredded carrot 3/4 cup sliced shiitake mushrooms 1 1/2 cups chopped baby spinach 3 hard-boiled eggs, halved 1 1/2 cups cooked ramen noodles 3 tablespoons sliced scallions 3/4 teaspoon sesame seeds 3 cups very hot water, divided"], "directions": ["Place 1/2 tablespoon bouillon paste, 1/2 tablespoon miso, 1/2 tablespoon chili-garlic sauce and 1/2 tablespoon ginger in each of 3 pint-and-a-half size canning jars. Layer 1/4 cup carrot, 1/4 cup mushrooms, 1/2 cup spinach, 2 egg halves and 1/2 cup noodles in each jar. Top each with 1 tablespoon scallions and 1/4 teaspoon sesame seeds. Close the jars. Refrigerate for up to 3 days. To make one jar of noodles, add 1 cup of very hot water to one jar. Close the jar and shake to combine. Microwave uncovered on high in 1-minute increments until steaming hot, 2 to 3 minutes. Let stand 5 minutes. Stir before eating.", "To make ahead: Store pre-cooked jars covered in the refrigerator for up to 3 days.", "Equipment: 3 1-1/2-pint wide mouth canning jars"]}, {"id": "x1WG", "title": "Spicy Vegetable Lo Mein", "image": "https://images.yumprint.com/p1yumprintt5/T5JvTuLSiXdZRtoBe3nlFgSKojkilqpP3cpqI2zIp8bMkm9NuZl2PXNbXfXEAU5K", "link": "http://www.eatingwell.com/recipes/spicy_vegetable_lo_mein.html?socsrc=ewfb0401163", "ingredients": ["8 ounces lo mein noodles, linguine or spaghetti", "1 teaspoon toasted sesame oil", "12 ounces Chinese broccoli (see Tips) or broccolini", "2 tablespoons reduced-sodium soy sauce", "1 tablespoon Shao Hsing rice wine (see Tips) or dry sherry", "1 tablespoon sriracha or other Asian hot sauce", "2 tablespoons peanut oil, divided", "1 tablespoon minced fresh ginger", "1 tablespoon minced garlic", "6 ounces fresh shiitake mushrooms, stems removed and caps thinly sliced", "Pinch of salt"], "directions": ["Bring 2 quarts of water to a boil in a large pot. Add noodles and cook according to package directions. Drain and rinse with cold water. Shake well to remove excess water. Transfer the noodles to a cutting board and roughly cut into thirds. Return the noodles to the pot and toss with sesame oil. Set aside.", "Trim 1/4 inch off broccoli (or broccolini) stalks. If the stalks are thicker than 1/2 inch, cut in half lengthwise. Keeping them separate, cut stalks and leaves into 2-inch-long pieces. Combine soy sauce, rice wine (or sherry) and hot sauce in a small bowl.", "Heat a 14-inch flat-bottomed wok or large heavy skillet (not nonstick) over high heat until a bead of water vaporizes within 1 to 2 seconds of contact. Swirl in 1 tablespoon peanut oil, add ginger and garlic and stir-fry until fragrant, about 10 seconds. Add mushrooms and the broccoli (or broccolini) stalks and stir-fry until all the oil is absorbed, about 30 seconds. Swirl in the remaining 1 tablespoon oil and add the noodles and broccoli leaves; stir-fry until just combined, about 15 seconds. Stir the soy sauce mixture and swirl it in. Sprinkle with salt and stir-fry until the noodles are heated through, 1 to 2 minutes.", "TIPS & NOTES", "Chinese broccoli has a slight bitter flavor reminiscent of broccoli rabe, which is a good substitute (as is broccolini). Look for it in Asian markets, at farmers’ markets and some well-stocked supermarkets; opt for bunches with tight flower buds (open flowers are a sign of age).", "Shao Hsing (or Shaoxing) is a seasoned rice wine used in Chinese cooking to flavor sauces, marinades and stir-fries. Look for it in Asian specialty markets or with other Asian ingredients in large supermarkets. In a pinch, dry sherry is a good substitute."]}, {"id": "lESo", "title": "Spring Rolls", "image": "https://images.yumprint.com/p1yumprint4n/4Nhr5BmVvqJ5R7tH2Va3MypcGQgyjz7AbNQ8a7FysbG0gqK3BMMO7jEq4nvwjDW-", "link": "https://www.yahoo.com/food/spring-rolls-recipe-104173273641.html", "ingredients": ["15 medium shrimp, peeled and deveined", "8 ounces boneless pork shoulder", "1 egg yolk", "1⁄2 cup canola oil", "1⁄4 teaspoon kosher salt", "5 cups cooked rice vermicelli", "Ten 12-inch round sheets of rice paper", "1 head red leaf lettuce, leaves separated, washed, and dried", "30 mint leaves", "1 1⁄4 cup peanut sauce, for dipping"], "directions": ["Fill a pot with water and bring to a boil. Add the shrimp and blanch until the shrimp have turned bright pink, about 3 minutes. Using a slotted spoon or a spider, transfer the shrimp to a colander and rinse under cold running water. Drain the shrimp on paper towels and cut each shrimp in half length- wise. Set aside.", "Return the water to a boil and add the pork. Turn the heat down to low and simmer until the pork is cooked through, about 20 minutes. Check for doneness by removing the pork from the water and poking it with a chopstick; the juices should run clear. Let cool completely, then cut against the grain into slices 1⁄4 inch thick.", "To make the mayonnaise, put the egg yolk in a large mixing bowl and whisk well. Pour the shallot oil into a measuring cup with a spout and begin adding the oil to the egg yolk a few drops at a time, whisking constantly until the mixture thickens and emulsifies. Continue to add the oil in a slow and steady stream, whisking constantly, until all the oil is incorporated. The mixture will be very thick. Whisk in the salt and set aside.", "Fill a large bowl with very hot water. Dip one sheet of rice paper halfway into the water and quickly rotate to moisten the entire sheet. Lay the wet rice paper on a flat work surface. Arrange one lettuce leaf over the bottom third of the rice paper, flattening the lettuce to crack the rib. Spread a generous teaspoon of the mayo over the lettuce, then top with three mint leaves placed end to end and a few slices of pork. Top with about 1⁄2 cup of the noodles.", "Fold in the left and right sides of the rice paper, then fold the bottom edge up and over the filling tightly and roll toward the top end one full turn, enclosing the filling completely. Place three pieces of shrimp, cut side up and end to end, in a row on the rice paper, then roll another turn to enclose the shrimp. Continue rolling as tightly as possible toward the top edge, tucking in the sides, until you have a tight cylinder. Repeat with the remaining rice paper and ingredients.", "The rolls can be made up to two hours in advance. Cover with a damp towel until serving. Just before serving, cut each roll crosswise into thirds. Serve with peanut sauce."]}, {"id": "q4TP", "title": "Sriracha Sauce", "image": "https://images.yumprint.com/p1yumprint_x/_xFPrT4WPTuDVgRGoawWojwDHvefwctnpGuwnFLweqR31nfqZFPWnMnAizsA8s1W", "link": "http://www.budget101.com/content.php?r=5180-MYO-Sriracha-Sauce", "ingredients": ["1 1/2 lbs red jalapeños or fresno peppers, stems removed", "6 whole cloves garlic, peeled", "4 Tbs light brown sugar", "1 Tbs kosher salt", "1/2 cup rice wine vinegar"], "directions": ["In a food processor or blender combine the peppers, garlic, sugar, and salt, pulsing (blitz) until peppers are very finely chopped.", "Pour the mixture into a clean jar and cover, allowing it to set at room temperature to begin the fermentation process.", "Each day check the jar for fermentation. Between days 3-5, you'll be able to see little bubbles forming at the bottom of the jar.", "Each day, gently shake the jar to stir the mixture up, then return to a dark place to allow it to ferment until the peppers are no longer rising in volume (an additional 2-3 days).", "Once the fermentation process is complete ( at total of 7-10 days), transfer the mixture back to the blender, add the vinegar and puree until smooth.", "Strain the mixture through a fine mesh strainer into a heavy saucepan, pressing the juice through with a rubber spatula to speed up the process and ensure all the juice is extracted.", "Bring the mixture to a boil over medium high heat, then reduce the medium-low, simmering just until the sauce clings to the spoon (5 or 10 minutes). Cool, transfer to a jar (airtight) or vacuum seal the sauce. This will last 6 months refrigerated, or can be frozen in small recipe size packages for up to a year."]}, {"id": "duvt", "title": "Summer rolls help squeeze veggies into the picnic", "image": "https://images.yumprint.com/p1yumprintom/omvw1uB-CxXFedHsoac6vkVfI7JSKsG7lhe1UW2QvvLPji5dbwZDanexQEoxYhq0", "link": "http://news.yahoo.com/summer-rolls-help-squeeze-veggies-picnic-181156355.html", "ingredients": ["1 tablespoon rice vinegar", "In this image taken on May 13, 2013, summer rolls with spicy peanut dipping sauce are shown served o …", "1/2 teaspoon sugar", "Kosher salt", "1 cup coarsely shredded carrots", "1 cup shredded Napa cabbage", "Sixteen 8-inch rice paper wrappers", "1/2 medium jicama, cut into julienne strips (about 1 cup)", "1 cup thinly sliced red bell pepper strips", "1 cup blanched and thinly sliced snow peas", "32 large fresh mint leaves"], "directions": ["To make the dipping sauce, in a food processor or blender combine the peanut butter, hoisin, 2 tablespoons lime juice, the scallions, soy sauce, sesame oil, hot sauce and water. Puree until smooth. Taste and add more lime juice or hot sauce if desired, and additional water if necessary to thin the sauce to a good dipping consistency. Transfer to a bowl and set aside.", "To prepare the rolls, in a small bowl combine the rice vinegar, sugar and a hefty pinch of salt. Whisk until the salt and sugar are dissolved. Add the carrots and cabbage and toss well. Set aside.", "Fill a large bowl with hot water. Add 1 rice paper wrapper to the water and let soak for 10 to 15 seconds, or until just barely soft and pliable. Lay the wrapper flat on the counter. In the center of the wrapper, place a small, oblong mound of the carrot-cabbage mixture, then top with a bit each of jicama, bell pepper and snow peas. Top with 2 mint leaves.", "To fold the roll, start by folding the right and left sides of the wrapper over the fillings. Next, fold the end closest to you up over the fillings and sides. Holding the roll firmly, roll it away from you until the remaining wrapper is completely rolled up. Transfer the roll, seam side down, to a plate and cover with a damp paper towel. Repeat with the remaining wrappers and fillings.", "The vegetable rolls can be made up to 4 hours ahead, covered with a damp paper towel and plastic wrap and chilled. Serve with the dipping sauce.", "Nutrition information per roll: 140 calories; 60 calories from fat (43 percent of total calories); 7 g fat (1.5 g saturated; 0 g trans fats); 0 mg cholesterol; 16 g carbohydrate; 2 g fiber; 5 g sugar; 5 g protein; 250 mg sodium."]}, {"id": "yF7G", "title": "Summer Squash Pad Thai", "image": "https://images.yumprint.com/p1yumprintnm/nMMQhx-EC6yvRZQ4cmK5QtxaxIXGE-_D4pEvys_giVyBIug_lYSM3wdSui_SEDud", "link": "http://www.eatingwell.com/recipes/summer_squash_pad_thai.html?socsrc=ewfb0506163", "ingredients": ["1 1/4 pounds zucchini (2-3 medium)", "1 1/4 pounds yellow summer squash (2-3 medium)", "3 tablespoons rice vinegar", "2 tablespoons fish sauce", "1 tablespoon honey", "2 teaspoons chile-garlic sauce", "1 teaspoon peanut oil plus 1/4 cup, divided", "4 large eggs, beaten", "1 medium red bell pepper, thinly sliced", "6 scallions, sliced in 1-inch pieces", "3 large cloves garlic, minced", "3 cups bean sprouts", "1/4 cup roasted peanuts, chopped (optional)", "1/4 cup coarsely chopped fresh cilantro (optional)", "4 lime wedges (optional)"], "directions": ["Using a spiral vegetable slicer or a julienne or regular vegetable peeler, slice zucchini and summer squash lengthwise into long, thin strands. Stop when you reach the seeds in the middle (seeds make the noodles fall apart). You should have about 12 cups of squash “noodles.”", "Combine vinegar, fish sauce, honey and chile-garlic sauce in a small bowl. Place near the stove.", "Set a 14-inch flat-bottom carbon-steel wok or large skillet over high heat until hot. Swirl in 1 teaspoon oil. Add eggs and cook, without stirring, until set, 30 to 40 seconds. Flip over and cook until set on the other side, about 30 seconds more. Transfer to a plate.", "Swirl the remaining 1/4 cup oil into the wok (or pan). Add the squash noodles, bell pepper, scallions and garlic; cook, stirring occasionally, until the vegetables are soft, about 5 minutes. Add bean sprouts and the reserved sauce and toss until heated through, 1 to 2 minutes.", "Slice or chop the egg. Serve the noodles topped with the egg and garnished with peanuts, cilantro and lime wedges, if desired."]}, {"id": "dR-O", "title": "Sweet Chili And Vinegar Dipping Sauce", "image": null, "link": null, "ingredients": ["1/4 cup water", "2 tablespoons sugar", "1/4 cup rice vinegar", "2 tablespoons fish sauce", "1 clove garlic, peeled", "Fresh lime juice, to taste", "Sriracha or other chili sauce, to taste"], "directions": ["In a small saucepan, bring the water and sugar to a boil and stir until dissolved. Remove from heat. Add rice vinegar, fish sauce and garlic clove.", "Whisk together or blend, if you prefer a smoother consistency. Squeeze in some lime juice, add a few drops of chili sauce, and adjust to taste until you have a potent but balanced blend — it will seem tamer when you're dipping the roll into it.", "Some of the blander rolls (particularly those made with tofu) benefit from a dipping sauce. Sweet vinegar is a common choice, as is peanut. Personally, I find peanut overwhelming for the streamlined urbanity of a summer roll. This is the sauce I prefer.", "Makes about 2/3 cup sauce"]}, {"id": "BOuf", "title": "Tangerine Bok Choy & Beef Stir-Fry", "image": "https://images.yumprint.com/p1yumprintps/ps_PyIlirqoEUBGlWeVbuAuNaVlaY3FDWam6DwlXG79jxw_9tb9D4dmJUg7H9i_Q", "link": "http://www.eatingwell.com/recipe/251372/tangerine-bok-choy-beef-stir-fry?utm_source=facebook&utm_medium=social&utm_campaign=etg_643153811_ew_dinnertonight", "ingredients": ["1 pound flank steak, trimmed4-6 Pixie tangerines or clementines1 pound bok choy", "6 ounces shiitake mushrooms2 tablespoons oyster sauce1 1/2 tablespoons reduced-sodium soy sauce4 teaspoons rice vinegar", "1 1/2 teaspoons cornstarch1/4 teaspoon ground pepper7 teaspoons peanut oil or canola oil, divided1 tablespoon finely chopped fresh ginger", "3 large cloves garlic, minced3 scallions, chopped, whites and greens divided1 Fresno or serrano chile, seeded and thinly sliced"], "directions": ["Cut steak in thirds along the grain. Freeze 15 minutes to firm slightly; thinly slice crosswise. Sliver zest from enough tangerines (or clementines) to get 1 tablespoon (see Tip); set aside. Squeeze enough of the fruit to get 1/2 cup juice. Cut bok choy stems into 1-inch pieces and the leaves into 2-inch pieces. Discard mushroom stems; thinly slice caps. Whisk the juice, oyster sauce, soy sauce, vinegar, cornstarch and pepper in a small bowl. Place next to the stove. Heat a 14-inch flat-bottom carbon-steel wok or large skillet over medium-high heat until very hot. Add 2 teaspoons oil and swirl to coat. Add half the beef in one layer; cook, without stirring, for 1 minute. Then toss until the beef is no longer pink on the outside, 30 seconds more. Transfer to a plate. Repeat with 2 more teaspoons oil and the remaining beef; transfer to the plate. Add 2 teaspoons oil to the pan; swirl to coat. Add the bok choy stems and mushrooms; stir-fry until the mushrooms release their liquid, about 3 minutes. Add the bok choy leaves; stir-fry until wilted, 1 to 2 minutes. Transfer the bok choy and mushrooms to the plate with the beef. Add the remaining 1 teaspoon oil, ginger, garlic, scallion whites and chile to the pan and stir-fry for 30 seconds. Add the reserved sauce and heat until bubbling. Return the beef, vegetables and any accumulated liquid to the pan; gently stir until heated through, about 1 minute more. Stir in scallion greens and the reserved zest.", "Slivers of citrus zest add big “zest flavor” to dishes like stir-fries and cakes. To make zest slivers, peel wide strips of the skin from citrus fruit with a vegetable peeler, leaving the white pith behind. Cut the strips into long, thin slivers."]}, {"id": "sNkW", "title": "Thai Chicken Satay with Spicy Peanut Sauce", "image": "https://images.yumprint.com/p1yumprintri/Rin6Gm2emZkysGBGcxR13Wz3r691iSfvXBBoT5CX0YcpyOJfi7ZSvgPSVvEmOyeq", "link": "http://www.eatingwell.com/recipes/thai_chicken_satay_with_spicy_peanut_sauce.html", "ingredients": ["3 tablespoons lime juice", "3 tablespoons canola oil", "2 teaspoons reduced-sodium soy sauce", "2 teaspoons fish sauce, (see Ingredient Note)", "1/2 teaspoon crushed red pepper", "1 pound chicken tenders", "SPICY PEANUT SAUCE", "2 tablespoons smooth natural peanut butter", "2 tablespoons 'lite' coconut milk, (see Tip)", "1 tablespoon lime juice", "2 teaspoons reduced-sodium soy sauce", "1 teaspoon brown sugar", "1/2 teaspoon crushed red pepper, or to taste"], "directions": ["Whisk lime juice, oil, soy sauce, fish sauce and red pepper in a shallow dish until combined; add chicken and turn to coat. Let marinate in the refrigerator for 15 minutes.", "To prepare peanut sauce: Whisk peanut butter, coconut milk, lime juice, soy sauce, brown sugar and red pepper until smooth.", "Preheat grill to high. Thread each chicken tender onto a wooden skewer. Grill until cooked through and no longer pink in the middle, about 3 minutes per side. Serve warm or chilled with Spicy Peanut Sauce.", "Make Ahead Tip: Covered and refrigerate the peanut sauce for up to 2 days. | Equipment: 12 wooden skewers (see Tip)", "Ingredient note: Fish sauce is a pungent Southeast Asian sauce made from salted, fermented fish. You can find it in the Asian section of large supermarkets and in Asian specialty markets.", "Tips: Refrigerate leftover coconut milk for up to 1 week or freeze for up to 2 months. It will appear separated when thawed; simply mix until smooth."]}, {"id": "GiP1", "title": "Thai Chicken Soup", "image": "https://images.yumprint.com/p1yumprintcb/CBoBfj7QKAt2FHEqibNONmzMl3XuWPJSzpkhs5OFaoHhkbvRZA7kcylELWqB7n9S", "link": "https://elanaspantry.com/thai-chicken-soup/", "ingredients": ["1 tablespoon grapeseed oil or coconut oil", "3 shallots, chopped", "8 sprigs cilantro, chopped", "4 cups chicken stock or Kettle & Fire Bone Broth", "28 ounces full fat coconut milk", "½ pound crimini mushrooms", "1 head broccoli", "1 pound chicken breasts skinless-boneless, halved lengthwise, sliced on bias, cut into ⅛ inch thick pieces", "3 tablespoons fresh lime juice", "2 teaspoons red curry paste", "3 tablespoons fish sauce", "½ cup cilantro, minced", "2 serrano chilies, thinly sliced", "1 lime, cut into wedges"], "directions": ["Warm oil in a large saucepan over medium heat", "Add shallots and cilantro, stirring frequently until softened ?2 to 5 minutes", "Stir in stock and coconut milk and bring to a simmer", "Pour broth through a fine mesh strainer and discard solids (shallot and cilantro)", "Return broth to saucepan", "Reduce heat to medium , add mushrooms and broccoli and cook until tender ?2 to 3 minutes", "Add chicken and cook, stirring constantly, until no longer pink ?1 to 3 minutes", "Combine lime juice, curry paste and fish sauce in a small bowl then stir into soup", "Ladle soup into bowls and garnish with cilantro, chilies and scallions", "Serve with wedges of lime"]}, {"id": "IFzA", "title": "Thai coconut soup", "image": "https://images.yumprint.com/p1yumprintyz/yZ6CAjYiig-IsowsSNT70gQHaTnDpEouPBxj5OlfC9SOJ9qleC8QN9rV9skRJ2gQ", "link": "https://www.allrecipes.com/recipe/146035/the-best-thai-coconut-soup/?utm_source=facebook&utm_medium=social&utm_campaign=etg_20180618&utm_content=etg_internalcrosspromo", "ingredients": ["1 tablespoon vegetable oil2 tablespoons grated fresh ginger1 stalk lemon grass, minced2 teaspoons red curry paste4 cups chicken broth3 tablespoons fish sauce1 tablespoon light brown sugar3 (13.5 ounce) cans coconut milk1/2 pound fresh shiitake mushrooms, sliced1 pound medium shrimp - peeled and deveined2 tablespoons fresh lime juicesalt to taste1/4 cup chopped fresh cilantroAdd all ingredients to list"], "directions": ["Heat the oil in a large pot over medium heat. Cook and stir the ginger, lemongrass, and curry paste in the heated oil for 1 minute. Slowly pour the chicken broth over the mixture, stirring continually. Stir in the fish sauce and brown sugar; simmer for 15 minutes. Stir in the coconut milk and mushrooms; cook and stir until the mushrooms are soft, about 5 minutes. Add the shrimp; cook until no longer translucent about 5 minutes. Stir in the lime juice; season with salt; garnish with cilantro.", "Serve over rice."]}, {"id": "HnY7", "title": "Thai coconut soup", "image": "https://images.yumprint.com/p1yumprintyz/yZ6CAjYiig-IsowsSNT70gQHaTnDpEouPBxj5OlfC9SOJ9qleC8QN9rV9skRJ2gQ", "link": "https://www.allrecipes.com/recipe/146035/the-best-thai-coconut-soup/?utm_source=facebook&utm_medium=social&utm_campaign=etg_20180311_internal_crosspromo", "ingredients": ["1 tablespoon vegetable oil 2 tablespoons grated fresh ginger 1 stalk lemon grass, minced 2 teaspoons red curry paste 4 cups chicken broth 3 tablespoons fish sauce 1 tablespoon light brown sugar 3 (13.5 ounce) cans coconut milk 1/2 pound fresh shiitake mushrooms, sliced 1 pound medium shrimp - peeled and deveined 2 tablespoons fresh lime juice salt to taste", "1/4 cup chopped fresh cilantro Add all ingredients to list"], "directions": ["Heat the oil in a large pot over medium heat. Cook and stir the ginger, lemongrass, and curry paste in the heated oil for 1 minute. Slowly pour the chicken broth over the mixture, stirring continually. Stir in the fish sauce and brown sugar; simmer for 15 minutes. Stir in the coconut milk and mushrooms; cook and stir until the mushrooms are soft, about 5 minutes. Add the shrimp; cook until no longer translucent about 5 minutes. Stir in the lime juice; season with salt; garnish with cilantro."]}, {"id": "EfDa", "title": "Thai Fried Rice", "image": "https://images.yumprint.com/p1yumprint9q/9QzvJeQf6BJkDqvY0BfCvTuuKaHXj1D3DQVS2j6oL9iYcu2zeS8FwLmcTeMjRuZz", "link": "http://www.eatingwell.com/recipe/250728/thai-fried-rice/", "ingredients": ["1¼ cups brown or white jasmine riceWater (2½ or 2 cups)8 ounces boneless pork chop (about 1 chop), trimmed", "3 tablespoons peanut oil or canola oil, divided", "2 tablespoons minced garlic2 cups chopped mushrooms2 scallions, cut into ½-inch pieces2 tablespoons fish sauce (see Tip)½ cup whole cilantro leaves", "1 lime, cut into wedges", "½ medium cucumber, sliced"], "directions": ["Combine rice and water (2½ cups for brown rice; 2 cups for white rice) in a medium saucepan with a tight-fitting lid; bring to a boil. Cover, reduce heat to maintain a gentle simmer and cook until the rice is tender and the water is absorbed (40 to 45 minutes for brown rice; 20 minutes for white). Remove from heat and let stand, covered, for 10 minutes. Fluff with a fork, spread the rice on a large baking sheet and let cool at least 15 minutes. Thinly slice pork chop crosswise, then cut each slice into long, thin strips about the width of a matchstick. Place a large flat-bottom carbon-steel wok over high heat. Add 2 tablespoons oil and swirl to coat the pan, add garlic. Cook, stirring, until just starting to change color, about 20 seconds. Add the pork and cook, stirring, until it is no longer pink, about 2 minutes. Remove the pork with a slotted spoon to a clean plate. Add the remaining 1 tablespoon oil to the wok. Add mushrooms and cook, stirring, until they soften, 2 to 3 minutes. Sprinkle in the cooked rice and stir-fry, tossing and then pressing it against the hot wok, then tossing and pressing again, until all the rice has been exposed to the hot wok, about 1 minute. Add scallions, fish sauce and the cooked pork and cook, stirring, for 30 seconds. Transfer the fried rice to a platter. Garnish with cilantro leaves, lime wedges and cucumber slices.", "Make Ahead Tip: Prepare rice (Step 1), cover and refrigerate for up to 2 days.", "Give grains a cooldown: To cool grains down quickly, spread them out on a foil-lined baking sheet. The surface area helps speed cooling, while the foil prevents any residual flavors on the pan from seeping in."]}, {"id": "duvi", "title": "Thai Larb Lettuce Cups", "image": "https://images.yumprint.com/p1yumprint1g/1gvPYw3h-mJTix_uWkLQwmtb3atMWviJNMccKHAXzy8HfBlboKfR4ODq-R63DhTg", "link": "http://whiteonricecouple.com/recipes/thai-larb-chicken-lettuce-cups/", "ingredients": ["1 1/2 tablespoons cooking oil", "1/2 pound ground chicken breast", "2 shallots, diced", "1/4 red onion, diced", "1 clove garlic, very finely minced", "Minced fresh chiles, Jalapeño or Fresno (amount up \u2028to you)", "1 tablespoon fish sauce", "1/2 lime, juiced", "1 teaspoon low-sodium soy sauce", "1 head iceberg lettuce, leaves separated into “cups”", "1 handful of cilantro and/or mint, cut into chiffonade"], "directions": ["Heat a wok or large sauté pan over high heat. When hot, swirl in 1 tablespoon of the oil and add the chicken. Use your spatula to break up the meat and spread out over the surface of the pan. Cook until browned, about 3 minutes.", "Push the ground chicken to one side of the pan and swirl in the remaining 1/2 tablespoon of oil. To the oil, add the shallots, red onion, garlic, and fresh chiles and sauté the aromatics until fragrant, about 30 seconds. Add the fish sauce, lime juice, and soy sauce.", "Serve with lettuce cups and herbs."]}, {"id": "GeeU", "title": "Thai Peanut Sauce", "image": "https://images.yumprint.com/p1yumprintim/ImSUCQpohnY2MsBHPZXZo3zV9J7wst4t473IDhcTx6T2PMBD639Nk88Co5RYNNwR", "link": "http://dontwastethecrumbs.com/2017/06/thai-peanut-sauce/", "ingredients": ["¼ cup peanut butter", "2 Tbsp rice vinegar", "2 Tbsp lime juice (about 1½ limes)", "3 Tbsp olive oil", "1 Tbsp soy sauce (I use liquid aminos)", "1 tsp salt", "¼ tsp crushed red pepper", "1\" fresh ginger, sliced", "1 Tbsp minced garlic (about 2-3 garlic cloves)", "1 Tbsp sugar", "2 Tbsp honey", "¼ cup cilantro"], "directions": ["Add all the ingredients, except the cilantro, to the blender or food processor. Blend until all the ingredients are smooth and creamy.", "Add the cilantro and pulse until the cilantro is in very small pieces.*"]}, {"id": "fbYG", "title": "Thai Stir-Fried Wide Rice Noodles, 'Pad Si-iew'", "image": "https://images.yumprint.com/p1yumprintu0/u0DuGSJbFZNk7wMvv3_MRWgWS5FvAp2WncoaKxNkVGhGldfO-LTRV3zBifwDJDdG", "link": "http://importfood.com/recipes/tfrywidenoodles.html", "ingredients": ["16 ounces wide rice noodles", "2 tablespoons sweet dark soy sauce", "2 cups broccoli florets", "2 tablespoons fish sauce", "1 tablespoon palm sugar", "1 tablespoons oyster sauce", "2 eggs beaten", "1/2 teaspoon Thai pepper powder"], "directions": ["Soak the noodles in warm water for 30 minutes then rinse in cold water. Add noodles to a pot of boiling water and boil for 1 minute, then rinse in cold water again. Transfer to mixing bowl, separate the noodles and toss thoroughly with sweet soy sauce. Set aside.", "Heat the wok and a little oil to stir fry the marinated meat until it just begins to cook. Add the noodles, cook quickly then add broccoli and stir again. Push the noodles and broccoli to the sides of the wok to open up the middle, then add beaten eggs. Spread the eggs a little cook for a moment. Just before the eggs set, fold all the noodles and broccoli together and stir well with remaining ingredients.", "Transfer to serving plate. Sprinkle with Thai pepper powder and serve with prik dong (important to have prik dong on the side, and each person can spoon a little bit over their portion, depending on how they like it)."]}, {"id": "y1D_", "title": "Thai-Style Chicken Soup with Lemongrass and Coconut Milk [Tom Kha Gai]", "image": "https://images.yumprint.com/p1yumprinths/hSjT-8e7MxnqR2G-ABJiuKG5x94KHkQVYcuAmyDUFm-NRrmQpiLno0-82TYIm4cf", "link": "http://nourishedkitchen.com/tom-kha-gai-recipe/", "ingredients": ["4 cups chicken foot stock (see Chicken Foot Broth recipe in Broth and Stock) or other chicken bone broth", "½ pound shiitake mushrooms, thinly sliced and stems reserved", "3 Thai chiles, smashed", "1 (6-inch) stalk of lemongrass, smashed", "2 (1-inch) knob ginger, sliced and peeled with skin reserved", "6 lime leaves or 1 lime", "2 shallots, peeled and diced with skins reserved", "1½ pounds boneless, skinless chicken thighs (Order pasture-raised chicken here.)", "1 (13.5-ounce) can full-fat coconut milk (Find coconut milk in BPA-free cans here or make it yourself).", "¼ cup fish sauce (Available here.)", "1 tablespoon palm sugar (Find it here.)", "Cilantro sprigs, for garnish", "Thai basil, for garnish", "Lime wedges, for serving"], "directions": ["Pour the stock into a large saucepan and bring it to a simmer over medium heat. Toss shiitake stems, chiles, lemongrass, ginger peelings, shallot skins and lime leaves into the simmering broth. Cover the saucepan, and let the aromatics infuse the broth with their flavors about twenty minutes.", "Turn off the heat and strain the broth into a pitcher or jar through a fine-mesh sieve, discarding the solids. Wipe the saucepan clean with a kitchen towel to remove any stray debris.", "Return the flavored broth to the saucepan and then add mushroom caps, sliced ginger, and shallots. Spoon in the chopped chicken thighs. Stir the coconut milk, fish sauce, and palm sugar into the broth and simmer over medium heat until the vegetables soften and the chicken cooks through, turning an opaque white, about twenty-five minutes.", "Ladle into soup bowls, garnish with sprigs of cilantro and Thai basil and serve with lime wedges alongside."]}, {"id": "Ju1V", "title": "the best Thai coconut soup", "image": "https://images.yumprint.com/p1yumprintyz/yZ6CAjYiig-IsowsSNT70gQHaTnDpEouPBxj5OlfC9SOJ9qleC8QN9rV9skRJ2gQ", "link": "https://www.allrecipes.com/recipe/146035/the-best-thai-coconut-soup/?utm_source=facebook.com&utm_medium=social&utm_campaign=eatingwell_eatingwell&utm_content=link_internalcrosspromotion_worldcuisine&utm_term=2018092618", "ingredients": ["1 tablespoon vegetable oil2 tablespoons grated fresh ginger1 stalk lemon grass, minced2 teaspoons red curry paste4 cups chicken broth3 tablespoons fish sauce1 tablespoon light brown sugar3 (13.5 ounce) cans coconut milk1/2 pound fresh shiitake mushrooms, sliced1 pound medium shrimp - peeled and deveined2 tablespoons fresh lime juicesalt to taste1/4 cup chopped fresh cilantroAdd all ingredients to list"], "directions": ["Heat the oil in a large pot over medium heat. Cook and stir the ginger, lemongrass, and curry paste in the heated oil for 1 minute. Slowly pour the chicken broth over the mixture, stirring continually. Stir in the fish sauce and brown sugar; simmer for 15 minutes. Stir in the coconut milk and mushrooms; cook and stir until the mushrooms are soft, about 5 minutes. Add the shrimp; cook until no longer translucent about 5 minutes. Stir in the lime juice; season with salt; garnish with cilantro. Serve over rice."]}, {"id": "jFPi", "title": "Toasted Sesame Chicken Stir Fry", "image": "https://images.yumprint.com/p1yumprint4m/4mMHbywzyd3eo7FcobfdepNQKAJACrzAJBZ3Yrq5ksYLb3b9fNGCuxOXs7dahodS", "link": "http://www.healthhomehappy.com/2012/02/toasted-sesame-stir-fry.html?mc_cid=5a25fa9f21&mc_eid=f86acd7c8d", "ingredients": ["2 pounds boneless chicken thighs", "½ pound green beans", "1 bunch green onions", "1 large or 3 baby bok choy", "1 cup chicken stock", "¼ cup coconut milk", "1 tablespoon beef gelatin (optional) (buy here)", "¼ teaspoon ginger", "1 teaspoon sea salt", "3 cloves garlic, crushed", "1 lemon, juiced"], "directions": ["Using a very sharp knife, slice raw chicken into bite sized strips and toss with 1 clove crushed garlic.", "Heat a large skillet over nearly high heat. Pour sesame seeds in and, stirring continuously, toast sesame seeds for 2-3 minutes or until golden and fragrant. Set aside.", "In a small saucepan, simmer chicken stock, coconut oil, salt, gelatin, and 1 clove of garlic over medium heat until reduced.", "Add ½ teaspoon sesame oil to the hot skillet that the sesame seeds were toasted in, turn heat down to medium-high. Add ¼ of the chicken and cook, 5-10 minutes, stirring occasionally, until browned on the outside. Remove and cook the remaining batches of chicken.", "Add more oil if necessary to the pan, and sauté the veggies in 2 batches until bright green. Combine with the remaining ingredients in a big bowl, toss, and top with toasted sesame seeds."]}, {"id": "w7Vd", "title": "Tom Kha Gai: Thai Coconut Soup Recipe", "image": "https://images.yumprint.com/p1yumprinta6/A6LwUfg4NR8HmRcPi5ishH1RtG6YFZ6TMahhckpidfSHiohyVwwdjX8hw_Z7MCsG", "link": "http://www.foodrenegade.com/tom-kha-gai-thai-coconut-soup/", "ingredients": ["1 quart chicken broth (where to buy chicken broth)", "1 1/2 C. coconut milk (where to find BPA-free coconut milk)", "1/4 tsp dried chile flakes", "1 tsp freshly grated ginger", "juice of 1 lemon", "sea salt (to taste)", "1-2 C. pulled or cubed cooked chicken (optional)", "1-2 green onions, chopped (optional)", "chopped cilantro (optional)"], "directions": ["Bring the stock to a boil, skim any foam that rises to the top and add coconut milk, lemon juice, chile flakes, ginger, and optional chicken. Simmer for about 15 minutes. Season to taste with salt. Ladle into soup bowls or mugs and garnish with cilantro and green onions."]}, {"id": "DzPL", "title": "VEGETABLE NORI ROLLS OR WRAPS WITH SUNFLOWER SEED BUTTER DIPPING SAUCE", "image": "https://images.yumprint.com/p1yumprint58/58tASbrQQev2pXHKQnFzjSERAtWqux4XSn8V2osoD85U4sgy9sPJ97DFndnrf8Mn", "link": "http://gourmandeinthekitchen.com/raw-vegetable-nori-wraps-with-sunflower-seed-butter-dipping-sauce/?utm_content=bufferacae2&utm_medium=social&utm_source=facebook.com&utm_campaign=gitkbuffer", "ingredients": ["3 to 4 Nori sheets", "1 recipe for carrot “rice\" (see above)", "1 medium watermelon radish, julienned", "½ a large avocado, thinly sliced (optional)", "1 cup baby spinach leaves", "1 cup sprouts of your choice such as sunflower or pea"], "directions": ["Place a nori sheet shiny side down on a sushi mat or cutting board. Spoon a thin layer of the carrot “rice” along a third of the sheet closest to you, pressing down firmly to smooth.", "Place the spinach in the middle of the carrot “rice” all the way down the sheet. Repeat with the avocado, radishes and sprouts.", "Using the edge of the sushi mat closest to you, grasp the mat and the edge of the nori sheet rolling both over the vegetable filling. Press down on the opposite side pulling back gently towards you to create a log shape. Roll nori tightly, using the mat to help. Brush the edge of the nori sheet furthest away from you with a finger dipped in a little water to moisten and seal the edge.", "Repeat this process until you have run out of filling or nori sheets.", "Place the rolls seam side down and using a sharp knife, gently slice the nori rolls into desired pieces and arrange on a serving platter . Serve the rolls immediately with the dipping sauce alongside."]}, {"id": "dR9e", "title": "Vegetarian Summer Rolls", "image": "https://images.yumprint.com/p1yumprintzi/zi2mpeiAwQjbCnOiO3G73hbwaclSDVNs1S-7IAkC8zzNYtiymmqlEX6CGZCKNHDF", "link": "http://www.npr.org/2012/09/25/161752021/a-roll-for-all-seasons-wrapped-in-rice-paper", "ingredients": ["1 block pressed tofu", "Two 10-inch or three 8-inch rice paper wrappers", "1/2 cucumber, peeled and sliced into matchsticks", "1/3 cup grated carrot", "1 small shallot, sliced paper thin", "Handful cooked rice or cellophane noodles", "Several sprigs Thai basil and mint, stemmed and shredded", "1/2 cup roasted salted peanuts, chopped"], "directions": ["Holding knife parallel to cutting board, slice tofu laterally. You should be able to get 3 or 4 layers. Stack the layers and slice into matchsticks. Assemble the other prepared ingredients by your cutting board.", "Rinse a rice paper wrapper with water (the temperature's not terribly important — anywhere from cool to warm) — just enough to moisten both sides — and shake it off. Now you'll need to work quickly, as you have about a minute and a half between when the wrapper softens enough to fold and when it becomes too limp and sticky.", "Lay the damp wrapper on cutting board and, working quickly, assemble a line of ingredients on the lower third of the wrapper. Fold in the left and right edges. You should now have straight sides, and the line of ingredients should be just covered by folded wrapper on each end. Press down the edges to help them stick, and then start rolling away from you, tucking in the ingredients as you go. By the time you get to the end, the wrapper will eagerly stick to itself, making a neat package. Do not try to unroll it."]}, {"id": "ybqq", "title": "Velvet Chicken with Baby Bok Choy", "image": "https://images.yumprint.com/p1yumprint1j/1J_yBnaE6BPhNQEqE7fhzSol2ALaS3WjmUNGWag2KDTrvXGsnuWp2tsXhkP_TCe9", "link": "http://www.eatingwell.com/recipes/velvet_chicken.html", "ingredients": ["1 pound boneless, skinless chicken breasts, cut crosswise into 1/4-inch-thick bite-size slices", "1 egg white, lightly beaten", "1 tablespoon plus 1/2 teaspoon cornstarch, divided", "2 teaspoons plus 2 tablespoons Shao Hsing rice wine (see Note) or dry sherry, divided", "1/2 teaspoon salt, divided", "3 tablespoons peanut oil or canola oil, divided", "1/3 cup reduced-sodium chicken broth", "2 teaspoons reduced-sodium soy sauce", "1/4 teaspoon ground white pepper", "6 cups water", "2/3 cup chopped scallions, divided", "1 tablespoon finely julienned or minced fresh ginger (see Tip)", "1/4 teaspoon crushed red pepper", "8 cups trimmed and halved baby bok choy (about 12 ounces)"], "directions": ["Combine chicken, egg white, 1 tablespoon cornstarch, 2 teaspoons rice wine (or sherry) and 1/4 teaspoon salt in a medium bowl. Stir until the cornstarch is totally dissolved and no clumps are visible. Add 1 tablespoon oil and stir to combine. Marinate in the refrigerator, uncovered, for 30 minutes.", "Meanwhile, combine broth, soy sauce, white pepper and the remaining 1/2 teaspoon cornstarch and 2 tablespoons rice wine in a small bowl.", "When the chicken has 10 minutes to go, bring water to a boil in a large saucepan. Add 1 tablespoon oil. Reduce the heat to low. Carefully add the chicken to the barely simmering water; gently stir so it doesn’t clump together. Cook just until opaque but not cooked through, about 1 minute. Carefully drain the chicken in a colander and shake to remove excess water.", "Heat a 14-inch flat-bottomed wok over high heat until a bead of water vaporizes within 1 to 2 seconds of contact. Swirl in the remaining 1 tablespoon oil. Add 1/3 cup scallions, ginger and crushed red pepper; using a metal spatula, stir-fry until fragrant, about 10 seconds. Add bok choy and the remaining 1/4 teaspoon salt. Stir-fry until the bok choy is almost crisp-tender, 1 to 2 minutes. Add the chicken. Stir the broth mixture again, swirl it into the wok and stir-fry until the chicken is just cooked through and lightly coated with sauce, 30 seconds to 1 minute. Serve sprinkled with the remaining 1/3 cup scallions."]}, {"id": "ugbE", "title": "Vietnamese Fresh Spring Rolls - Step by Step", "image": "https://images.yumprint.com/p1yumprintmz/mZa2MqQMRbt5jfFJeTecZptp3z-NTFnAsWF2v7zggzHDMJ_DpkBmZFVZymBp5bIj", "link": "http://notenoughcinnamon.com/2013/03/17/how-to-make-vietnamese-fresh-spring-rolls-step-by-step-recipe/", "ingredients": ["4 tbsp rice vinegar", "4 tbsp fish sauce", "1 cup water", "1 tbsp sugar", "1 garlic clove, crushed (optional)", "1 tbsp grated carrots (optional)"], "directions": ["Start by softening the rice papers. I like to use two rice papers per roll, just to make sure they don't break. Fill a large bowl with warm water. Dip two rice papers (or one) very carefully and gradually for about 1 minute, until totally soften. Lay rice papers on a clean cloth. (See the pictures, they explain the process way better than I do).", "Arrange about 4 beautiful mint leaves at the bottom of the rice paper, then about 4 shrimp halves. Top with a lettuce leaf, a small handful of vermicelli and a small handful of bean sprouts (there's no photo of the bean sprouts part because I wasn't able to find any the day I took the pics!). Add additional mint leaves. That's the moment when you can actually add pretty much anything you have in mind -and in you fridge- (think cilantro, peanuts, chicken, parsley...). Top with a second lettuce leaf. Always keep about 2 inches uncovered on each side.", "Now the rolling part. Fold uncovered sides inward, then tightly roll the rice paper, as shown on the pics. Repeat with remaining ingredients.", "Prepare the sauce. In a sauce pan, combine rice vinegar, fish sauce, water and sugar. Heat until sugar is dissolved, then let cool completely. Add garlic and carrots. It keeps about a week in the fridge.", "Serve your homemade spring rolls with the sauce and enjoy!"]}, {"id": "IVo1", "title": "Vietnamese Pork & Broccoli \"Rice\" Bowls", "image": "https://images.yumprint.com/p1yumprintsg/sgqXcjNmTNYPCLBzWeZWzfeDFRniZADUvIDYnR92yzrTts-5NBImxXRXiuEBBtdZ", "link": "http://www.eatingwell.com/recipe/259681/vietnamese-pork-broccoli-rice-bowls/", "ingredients": ["½ cup warm water2 tablespoons packed light brown sugar½ cup fresh lime juice2 tablespoons rice vinegar1 tablespoon fish sauce1-2 tablespoons minced serrano or jalapeño pepper1 pound broccoli with stems (not crowns)2 tablespoons peanut oil, divided½ teaspoon kosher salt, divided1 pound lean ground pork1 tablespoon chopped garlic1 tablespoon chopped fresh ginger¼ cup chopped fresh cilantro and/or mint¼ cup thinly sliced shallot1 cup julienned red bell pepper", "1 cup grated carrot1 cup diced English cucumber½ cup coarsely chopped roasted unsalted peanuts"], "directions": ["Combine water and brown sugar in a bowl; stir until the sugar dissolves. Add lime juice, vinegar, fish sauce and chile pepper to taste. Set aside. Peel the broccoli stems. Coarsely chop all the broccoli. Pulse in a food processor into rice-size pieces. Heat 1 tablespoon oil in a large nonstick skillet over medium-high heat. Add the broccoli \"rice\" and ¼ teaspoon salt. Cook, stirring occasionally, until softened, 4 to 6 minutes. Divide among 4 bowls; cover to keep warm. Wipe out the pan. Add the remaining 1 tablespoon oil and pork and cook over medium-high heat, stirring and breaking up, until browned, 3 to 5 minutes. Stir in garlic, ginger and the remaining ¼ teaspoon salt. Cook for 1 minute. Remove from heat. Stir in herbs, shallot and ½ cup of the reserved sauce. To serve, top each bowl of broccoli rice with equal portions of the pork mixture, bell pepper, carrot, cucumber and peanuts. Serve with the remaining sauce."]}, {"id": "ytR7", "title": "Vietnamese Rice Noodle Salad", "image": "https://images.yumprint.com/p1yumprint2g/2ghB8eWvb3cyFg6N1Vksp3O8LEflcnADAsZtUFRvcs0l-jS2t1A4nXZwX7pPnKfb", "link": "http://food52.com/recipes/28596-vietnamese-rice-noodle-salad", "ingredients": ["3 tablespoons fish sauce", "3 tablespoons freshly squeezed lime juice", "2 to 3 tablespoons light brown sugar", "6 to 8 tablespoons water, to taste", "1 medium clove garlic, minced", "1 fresh Thai (\"bird's eye\") chile, minced", "The salad", "8 ounces thin rice noodles (linguine size)", "3-4napa cabbage leaves, thinly sliced crosswise", "1medium carrot, shredded or cut into matchsticks", "1/2 cucumber, halved, seeded, and thinly sliced", "1 handful chopped fresh herbs, preferably a combination of basil, cilantro, and mint", "8 ounces cooked meat or shrimp, cut or torn into bite-sized pieces", "1/2 cup salted peanuts, coarsely chopped"], "directions": ["To prepare the dressing, combine the fish sauce, lime juice, 2 tablespoons of the brown sugar, 6 tablespoons of the water, the garlic, and the chile. Whisk well. Taste: if it's too pungent, add more water, 1 tablespoon at a time. If you'd like more sweetness, add more brown sugar, 1/2 tablespoon at a time. Remember that you're going to be putting this dressing on unsalted vegetables and noodles: you want the dressing to have a lot of flavor, but it shouldn't knock you over. Pour into a serving bowl. (Covered and chilled, the dressing will keep for 3 days to a week.) Bring a large pot of water to a boil. Add the rice noodles, and cook for 4 to 5 minutes, until tender but not mushy. Immediately drain the noodles into a colander, and rinse them well with cold water. Lay out a clean kitchen towel on the countertop, shake the colander to drain away excess water, and then spread the cooked noodles on the towel to drain further. Divide the noodles between two or three good-sized bowls, depending on the number of diners, and top with the vegetables, herbs, and meat. Scatter the peanuts on top. Allow each person to spoon on dressing to taste. Toss well, and eat. (Alternatively, you can present this salad family-style: Toss the vegetables, herbs, and noodles in a mixing bowl and then mound them on a serving platter. Arrange the meat over the noodles, and top with peanuts. Each diner can scoop their own portion from the platter and dress it as they see fit.)"]}]}