{"title": "Breakfast", "recipes": [{"id": "Bf0G", "title": "1-Hour Cinnamon Rolls", "image": "https://images.yumprint.com/p1yumprint5n/5nLfHEpD-2GPi7JYVhn6o7zpcJfkVeB7H7-4_CdrxW29bL_PfVgl1lIP2XlUFoW2", "link": "http://tacpaskett.blogspot.com/2014/01/1-hour-cinnamon-rolls.html", "ingredients": ["1 cube butter", "2 dashes salt", "2 t. vanilla", "6 c. powdered sugar", "milk"], "directions": ["Mix together for 10 minutes, then sit for 10 minutes. Oil cupboard, dump out dough. Divide in half. Press one half out into rectangle. Spread with ¼ c. melted butter and then with cinnamon-sugar mixture. Roll up tight, but not too tight. Divide into 12 rolls and place on greased cookie sheet. Repeat with other half of dough. Let rise. Bake for 12-15 minutes at 400.", "Cream cheese Rolls: Add cream cheese to regular frosting"]}, {"id": "u2wE", "title": "3 Ingredient Oatmeal Cookies/Bars", "image": "https://images.yumprint.com/p1yumprint9b/9BEfgFr1WS-RsmbYATRgF-BKwPLchDH8mtxi4fwFau2BLjYh53Vxr_sD17LfZppe", "link": "http://crazyrichards.com/feature-friday-3-ingredient-oatmeal-cookies/#sthash.X4bWKNv7.dpbs", "ingredients": ["1 Bag Nature ValleyTM Toasted Oats Muesli-Blueberry (*see below for substitutions)", "2 ripe bananas, mashed", "3 Tbsp. Crazy Richard’s Almond Butter"], "directions": ["Preheat oven to 350 degrees", "Combine muesli, mashed bananas, and almond butter.", "Roll 2 inch balls and place on a non-stick cookie sheet", "Bake at 350 degrees for about 20 minutes (adjust time for smaller or larger cookies)", "Remove from the oven and enjoy warm or room temperature.", "Store in an air tight container for up to a week", "*Can substitute about 3 cups of oats, or homemade muesli"]}, {"id": "u2wd", "title": "3 ingredient oatmeal raisin cookies/bars", "image": null, "link": "http://www.caloriecount.com/3-ingredient-oatmeal-raisin-cookies-recipe-r1300350", "ingredients": ["3 small bananas", "1 1/2 cups rolled oats", "1 cup raisins", "1 dash cinnamon", "Recipe Directions for 3 ingredient oatmeal raisin cookies"], "directions": ["mix bananas, oatmeal, and cinnamon together in a medium bowl", "mix in raisins", "Drop by teaspoon onto a greased cookie sheet", "bake at 350 for 10 to 13 minutes (10 for chewy, 13 for firm)", "Makes 36. Calories 33"]}, {"id": "u2vw", "title": "3 Ingredient Peanut Butter Banana Cookies", "image": "https://images.yumprint.com/p1yumprintby/byMEaKG38dVJlwBihTd22GEaFN4rIcdY_07y15a9nnEso6vbu87-EKLdFE3Z3CWt", "link": "http://www.feelgreatin8.com/feelgreatblog/3-ingredient-peanut-butter-banana-cookies/", "ingredients": ["2 ripe bananas, mashed", "1 cup oats (quick or regular)*", "2 tablespoons PB2 or natural peanut butter", "optional mix-ins - dark chocolate chips, walnuts, coconut, cinnamon, raisins, etc.", "You can use either or a combination of both. If you use just old fashioned, chop them a little bit."], "directions": ["Grease a cookie sheet and preheat oven to 350 degrees F.", "Mix together the bananas, oats, and PB2.", "Because banana's vary in size you may need to adjust the amount of oats you add. The texture should be like a wet cookie dough.", "Add any mix-ins you want. Whatever you decide to add, stick to ¼ cup or less, or the dough won't stick together.", "Scoop dough onto the greased cookie sheet. I got 12 cookies from this recipe.", "Bake for 15 minutes at 350. ENJOY!", "I keep leftovers in the refrigerator. I also froze a batch and then thawed them in the fridge and they were still fantastic!", "{serving size = 1 cookie - recipe makes 12}", "47 calories, 1.3g fiber, 1.4g protein"]}, {"id": "A6Y9", "title": "3. Cashew Energy Bars", "image": "https://images.yumprint.com/p1yumprint7t/7TmvX7p8_56yzGSoiUyDHy561lu9C6ugE0FpTkC4EoCV__ZgnzVHFLGbXvLNbf4C", "link": "http://www.dietoflife.com/eat-1-tsp-turmeric-every-day-keep-away-pain-toxins-inflammation-cancer/", "ingredients": ["3. Cashew Energy Bars", "2 ½ cups pitted dates", "1 cup cashews", "1 teaspoon each vanilla extract, turmeric, cinnamon, and powdered ginger", "Pinch of salt"], "directions": ["Combine ingredients in food processor and pulse until mixture becomes chunky but pliable. If needed, add a bit of water. Remove and roll into balls, then roll in shredded coconut. Refrigerate and enjoy as a treat."]}, {"id": "u23z", "title": "4 Ingredients Oatmeal Peanut Butter Cookies", "image": "https://images.yumprint.com/p1yumprintyk/yKytVz6Iyyqyli15DiwJ9CyhDrTI-pjCMjS1Ik7svmMLvBDbZMy_ptTOsSE_gxdQ", "link": "http://www.strongandbeyond.com/2015/03/4-ingridents-oatmeal-peanut-butter.html?spref=pi#.VljanNKrT4Z", "ingredients": ["2 small bananas or honey", "1 huge spoonful of peanut butter", "1 heaping cup of oats", "Dark chocolate chips (optional)"], "directions": ["Pre-heat oven 350.  Using hand mixer mix all the ingredients together until all bananas are invisible.  Add in about two tablespoons of chips in o mixed dough, then just stirred them in. Spoon onto pan and bake for about 8-10 minutes until the edges and bottom get a little crispy. Enjoy!"]}, {"id": "kMYo", "title": "4-Ingredient Banana Oat Bars (With Options!)", "image": "https://images.yumprint.com/p1yumprintbm/BMkwmdN1FxWcbpi6Ci7QmZqNwtlKnOdoj7L4XwscgtLATDMDTQPmwaI37hj9yWOm", "link": "http://www.thekitchn.com/healthy-snack-recipe-5-ingredi-156571", "ingredients": ["2 large, very ripe bananas", "1 teaspoon vanilla (optional)", "2 cups rolled oats", "1/2 teaspoon salt (optional)", "1/4 cup pitted, chopped dried dates", "1/4 cup chopped nuts — such as walnuts, hazelnuts or pecans", "Grated nutmeg or cinnamon (optional)"], "directions": ["Heat the oven to 350°F and lightly grease a 9x9-inch square baking dish with olive oil or butter.", "Peel the bananas and mash their flesh in a medium mixing bowl. Mash very thoroughly until no large chunks remain; the bananas should be essentially liquid. (You will have between 1 cup and 1 1/4 cup.) Stir in the vanilla, if using. Add the oats and stir them in. Stir in the salt, dates, and nuts.", "Pat the thick mixture evenly into the baking pan. If desired, sprinkle the top lightly with nutmeg or cinnamon. Bake for 30 minutes or unti the edges just begin to crisp up.", "Place the baking pan on a rack to cool. When the pan is mostly cool, cut into bars and enjoy with a glass of milk or tea."]}, {"id": "zgGU", "title": "Almond-Honey Power Bar", "image": "https://images.yumprint.com/p1yumprintit/Itg5Pf6bf1mCusc7ozyAul6gqLwawCSQ-UVm6aD3nGpJD4XQIJupC_8ujLgnuuoO", "link": "http://www.eatingwell.com/recipes/almond_power_bar.html", "ingredients": ["1 cup old-fashioned rolled oats", "1/4 cup slivered almonds", "1/4 cup sunflower seeds", "1 tablespoon flaxseeds, preferably golden", "1 tablespoon sesame seeds", "1 cup unsweetened whole-grain puffed cereal (see Note)", "1/3 cup currants", "1/3 cup chopped dried apricots", "1/3 cup chopped golden raisins", "1/4 cup creamy almond butter (see Note)", "1/4 cup turbinado sugar (see Note)", "1/4 cup honey", "1/2 teaspoon vanilla extract", "1/8 teaspoon salt"], "directions": ["Preheat oven to 350°F. Coat an 8-inch-square pan with cooking spray.", "Spread oats, almonds, sunflower seeds, flaxseeds and sesame seeds on a large, rimmed baking sheet. Bake until the oats are lightly toasted and the nuts are fragrant, shaking the pan halfway through, about 10 minutes. Transfer to a large bowl. Add cereal, currants, apricots and raisins; toss to combine.", "Combine almond butter, sugar, honey, vanilla and salt in a small saucepan. Heat over medium-low, stirring frequently, until the mixture bubbles lightly, 2 to 5 minutes.", "Immediately pour the almond butter mixture over the dry ingredients and mix with a spoon or spatula until no dry spots remain. Transfer to the prepared pan. Lightly coat your hands with cooking spray and press the mixture down firmly to make an even layer (wait until the mixture cools slightly if necessary). Refrigerate until firm, about 30 minutes; cut into 8 bars.", "Make Ahead Tip: Store in an airtight container at room temperature or in the refrigerator for up to 1 week or freeze for up to 1 month; thaw at room temperature."]}, {"id": "IdIV", "title": "Amy's Tomato and Spinach Frittata", "image": null, "link": "https://www.naturalgrocers.com/recipe/amys-tomato-and-spinach-frittata/", "ingredients": ["12 eggs, whisked", "1 tbsp(s) milk or cream or milk substitute", "2 tbsp(s) butter", "0 salt and black pepper, to taste", "0 garlic powder, to taste", "1/2 clamshell of spinach", "1 large tomato, thinly sliced or diced"], "directions": ["Preheat oven to 375°. In a deep ovenproof skillet (2″+), melt butter over medium heat. While melting, whisk eggs with milk, salt, pepper and garlic seasonings but do not add to pan yet. Once butter has melted, coat pan bottom and sides evenly with butter using a rubber spatula. Add spinach and tomato to skillet and cook just until spinach is wilted, about 5 minutes. Pour egg over spinach and tomato, then cook for another 5 minutes. Place skillet in oven and bake for 15-20 minutes, until lightly brown. If your skillet is not ovenproof, you may want to cover the handle with aluminum foil before placing it in the oven."]}, {"id": "FKmm", "title": "Apple Cider Doughnuts", "image": "https://images.yumprint.com/p1yumprint1a/1A5oxRPofI6pv5FXQE5mJA38pIlAcdtyTYiZpi9ijVK41Y5O1MT0UytY56E3BdGE", "link": "http://www.eatingwell.com/recipe/251668/apple-cider-doughnuts/?utm_source=facebook&utm_medium=social&utm_campaign=etg_1094138898_editorialcontent", "ingredients": ["Approximately 3 tablespoons granulated sugar for preparing pans2 cups all-purpose flour1½ teaspoons baking powder1½ teaspoons baking soda½ teaspoon salt2 teaspoons ground cinnamon1 large egg, lightly beaten⅔ cup packed brown sugar½ cup apple butter⅓ cup pure maple syrup⅓ cup apple cider⅓ cup nonfat plain yogurt3 tablespoons canola oilMaple Glaze1¼ cups confectioners' sugar, sifted1 teaspoon vanilla extract¼- ⅓ cup pure maple syrup"], "directions": ["To make doughnuts: Preheat oven to 400°F. Coat molds of a mini-Bundt pan with cooking spray. Sprinkle with granulated sugar, shaking out excess. Whisk together flour, baking powder, baking soda, salt and cinnamon in a mixing bowl; set aside. Whisk together egg, brown sugar, apple butter, ⅓ cup maple syrup, cider, yogurt and oil in another bowl. Add dry ingredients and stir just until moistened. Divide half the batter among the prepared molds, spooning about 2 generous tablespoonfuls of batter into each mold. Bake until the tops spring back when touched lightly, 10 to 12 minutes. Loosen edges and turn the cakes out onto a rack to cool. Clean the mini-Bundt pan, then re-coat it with cooking spray and sugar. Repeat with the remaining batter. To make maple glaze: Combine confectioners' sugar and vanilla in a bowl. Gradually whisk in enough maple syrup to make a coating consistency. Dip the shaped side (underside) of the \"doughnuts\" in the glaze to coat. Then set them, glazed-side up on a rack over wax paper for a few minutes until the glaze has set."]}, {"id": "vGy1", "title": "Apple Fritters (Gluten-free, processed sugar free, and vegan)", "image": "https://images.yumprint.com/p1yumprintdt/dTNbc_0D08LAiR68MttBKI9zcCAWb_4xM9cOPyftv-jZPGry6wk6L4qmRV8IzIQQ", "link": "http://www.healthy-holistic-living.com/apple-fritters-gluten-free-sugar-free-and-vegan.html", "ingredients": ["2 cup coconut sugar", "2 tbsp. arrowroot powder", "1 1/2 tablespoon milk of choice"], "directions": ["Preheat oven to 300 degrees.", "In pan over medium heat, heat enough coconut oil to fill one inch of the pan.  (I use a small pan and make the fritters one at a time in order to not waste too much oil.", "While oil is coming to heat, mix dry ingredients in one bowl and wet ingredients in a separate bowl.", "Combine wet ingredients with dry ingredients and mix until smooth.  Using a spatula, fold in apple until apples are covered with batter.", "To test oil drop cold water into oil and oil should begin to pop when hot enough.  Reduce heat to medium low.", "Using hands, drop flattened or rounded fritter into oil and allow frying for about 3 minutes or until browned and flipping to other side.", "Drain fritters on paper towel.", "After all fritters are made and drained on paper towel, place in oven safe container and place in oven for 10 minutes.", "In coffee grinder or Vitamix, powder coconut sugar and blend arrowroot powder into coconut sugar.  Add milk and mix to make glaze.", "Remove fritters from oven and when cool to touch, dip each side of fritter in glaze and return to baking pan to cool."]}, {"id": "Ej5n", "title": "Apple Spice Muffins", "image": "https://images.yumprint.com/p1yumprintuc/UCRAWLZXmz0W1ESl_0D5BSbiwrXD3xZzmteWvmz8TxK5mLez6wzCTTPcjoQ34-zl", "link": "http://www.eatingwell.com/recipe/255792/apple-spice-muffins/", "ingredients": ["Muffin Batter1¾ cups white whole-wheat flour", "2 teaspoons baking powder2 teaspoons ground cinnamon1 teaspoon ground ginger½ teaspoon baking soda½ teaspoon kosher salt¼ teaspoon ground cloves⅓ cup granulated sugar8 tablespoons unsalted butter (1 stick), melted and at room temperature½ cup crème fraîche, at room temperature½ cup reduced-fat milk, at room temperature2 large eggs1 tablespoon vanilla extract¾ cup dried cranberries or raisins, divided3½ cups finely chopped peeled Granny Smith apples (2-3 large)", "1 cup rolled oatsCrumb Topping¾ cup rolled oats½ cup white whole-wheat flour", "1 teaspoon ground cinnamon¼ teaspoon kosher salt4 tablespoons unsalted butter ( ½ stick), melted3 tablespoons honey2 teaspoons vanilla extract"], "directions": ["Position racks in upper and lower thirds of oven; preheat to 350°F. Line 20 muffin cups with paper liners. To prepare batter: Sift 1¾ cups flour, baking powder, 2 teaspoons cinnamon, ginger, baking soda, ½ teaspoon salt and cloves into a mixing bowl. Add sugar and 8 tablespoons butter and stir to combine. Add crème fraîche, milk, eggs and 1 tablespoon vanilla; beat on low speed for 10 to 15 seconds. Increase speed to medium-high and beat until light and fluffy, about 20 seconds. Chop about half the cranberries (or raisins) into small pieces. Fold all the cranberries (or raisins), apples and 1 cup oats into the batter. Divide the batter among the prepared muffin cups. To prepare topping: Mix oats, flour, cinnamon and salt in a medium bowl. Whisk butter, honey and vanilla in a small bowl; drizzle on top of the oat mixture and mix until well incorporated. Top each muffin with some of the crumb topping. Bake on the upper and lower racks, rotating top to bottom halfway through, until lightly golden and firm to the touch, 30 to 35 minutes. Let cool in the tins on a wire rack for at least 30 minutes before serving.", "To make ahead: Store individually wrapped for up to 2 days at room temperature or up to 2 weeks in the freezer; defrost overnight at room temperature before serving."]}, {"id": "GReR", "title": "Baby Kale Breakfast Salad with Quinoa & Strawberries", "image": "https://images.yumprint.com/p1yumprint9z/9ZHX20btRElzapeQqP48Jjh0F6PLmC2cKPL_M6L2_NqP2oZ71_KiZJMpI8vhzuor", "link": "http://www.eatingwell.com/recipe/251410/baby-kale-breakfast-salad-with-quinoa-strawberries/", "ingredients": ["1 teaspoon minced garlicPinch of salt1 tablespoon extra-virgin olive oil2 teaspoons red-wine vinegarPinch of ground pepper3 cups lightly packed baby kale", "½ cup cooked quinoa½ cup sliced strawberries", "1 tablespoon salted pepitas"], "directions": ["Mash garlic and salt together with the side of a chef's knife or a fork to form a paste. Whisk the garlic paste, oil, vinegar and pepper together in a medium bowl. Add kale; toss to coat. Serve topped with quinoa, strawberries and pepitas."]}, {"id": "uWTu", "title": "Bacon And Egg Coconut Flour Muffins", "image": "https://images.yumprint.com/p1yumprinty0/Y0jT3uW1KRp9nn60DnMK1NEA-nI4ZZKnDJfAdowRo02aTlhpseFNrrnRcjZVv-bu", "link": "http://www.strongandbeyond.com/2015/02/bacon-and-egg-coconut-flour-muffins.html#.VlMdRtKrT4a", "ingredients": ["4 eggs", "4 tbsp. coconut flour", "1/4 tsp sea salt", "1/4 tsp baking powder", "8 strips cooked bacon, chopped up", "1/2 cup chadder cheese", "1/2 cup of kale or spinach"], "directions": ["Pre heat oven to 375°. Mix eggs and coconut flour, salt, baking powder, bacon, cheese and greens.", "Stir batter and let it sit for approximately 5 minutes. Pour the batter evenly into 4 large muffin cups or 6 small muffin cups.", "Only fill 3/4 full. The muffins will rise while baking. Bake muffins for 15-18 minutes, or until the top of the muffins are golden brown. Let muffins cool before serving. Enjoy!"]}, {"id": "m8UB", "title": "Bacon and Egg “Cupcakes”", "image": "https://images.yumprint.com/p1yumprint_h/_hW_WjNVDqJduXQbHRmh6Q_AVNNHaUbArCncb4RmqKNJbvlU37XyYoNjCq8m_pNp", "link": "https://www.yahoo.com/food/bacon-and-egg-cupcakes-recipe-108831777746.html", "ingredients": ["Coconut oil or butter for greasing", "6 strips bacon", "6 eggs", "Crumbled feta (optional)", "Chopped chives or other herbs (optional)"], "directions": ["Preheat the oven to 400˚F and lightly grease a 6-cup muffin pan. Use a bacon strip to line each muffin cup, looping or pressing the bacon around the sides and using any small broken bits to line the bottom. It needn’t be a perfect job—feel free to use extra bits to fill in the gaps. If you like your bacon crispy, place the tray in the oven for 5 minutes before continuing. Gently crack 1 egg into each bacon cup, then sprinkle with cheese and herbs if desired. Bake for 15 minutes, until the egg whites are set. Let sit for a minute and then, using a knife or spoon, gently remove the “cupcakes” from the pan. Serve hot or warm.", "For a “greener” option, place a small parcooked-and-frozen broccoli floret in each cup. Use only 5 eggs and beat them lightly with a fork before dividing among the 6 cups."]}, {"id": "g1xW", "title": "Bacon and Eggs Over Asparagus", "image": "https://images.yumprint.com/p1yumprinthi/hI4cW5lersG-rHiGqGMgTghsC9ujPfjjO3dS-ggGTaH5ISykZ3zaiHIhCspcL5Jx", "link": "http://www.foxnews.com/recipe/bacon-and-eggs-over-asparagus", "ingredients": ["8 Slices of bacon", "1 Pound asparagus spears, trimmed", "1/2 Teaspoon fresh thyme leaves, chopped", "8 Large eggs", "3 Tablespoon packed fresh flat-leaf parsley leaves, chopped", "1 Tablespoon fresh dill, chopped"], "directions": ["Carefully crack eggs, without breaking yolks, directly onto asparagus spears, staggering if necessary and spacing 1/4 inch apart. Carefully return pan to oven. Roast 5 to 6 minutes or until whites are just set and yolks are still runny. Sprinkle 1/8 teaspoon salt and 1/8 teaspoon freshly ground black pepper on eggs. Return bacon to pan; sprinkle eggs and asparagus with parsley and dill. To serve, use wide spatula to transfer to serving plates."]}, {"id": "BmDL", "title": "Baked Eggs in Avocado: Two Ways", "image": "https://images.yumprint.com/p1yumprintrv/rv8bVVw3ezC7rPgFDRMPB97GXrb42HZyXgsA4-CDIPjNHt8wFRpkcNyYOwOB37ei", "link": "https://downshiftology.com/recipes/baked-eggs-in-avocado-two-ways/?utm_content=buffer56ba2&utm_medium=social&utm_source=facebook.com&utm_campaign=gitkbuffer", "ingredients": ["1 tbsp goat cheese", "1 tbsp cilantro, chopped", "or", "1 tbsp cooked bacon, crumbled", "1 tbsp chives, chopped"], "directions": ["Heat the oven to 425 degrees fahrenheit.", "Slice the avocados in half, lengthwise and twist to separate. Remove the pit and scoop out 1-1.5 tablespoons of avocado, creating a larger cavity.", "Place the avocado halves into a baking dish and gently crack one egg on top of each half.", "Bake for 15-20 minutes.", "Sprinkle with salt and pepper and add toppings."]}, {"id": "JEUO", "title": "Baked Eggs with Ham and Sofrito", "image": "https://images.yumprint.com/p1yumprintaq/AQ2Rydtjck3vhV7XBBGkYV4-27A7OeQyhq3dc7Z0-eBF3zKf5pCDobgtpiVza5Is", "link": "https://nourishedkitchen.com/baked-eggs-with-ham-and-sofrito/", "ingredients": ["1 large yellow onion, chopped coarsely", "4 cloves garlic", "⅔ cup extra virgin olive oil", "2 cups pureed tomatoes", "2 teaspoons smoked paprika", "2 bay leaves", "1 sprig fresh rosemary", "2 sprigs fresh thyme", "finely ground sea salt", "For the Eggs", "butter, for greasing the cocottes", "6 slices Applegate Naturals Uncured Black Forest Ham", "6 eggs", "3 tablespoons chopped flat-leaf parsley"], "directions": ["Puree the onion and garlic together in a high-speed blender (we use this one) until smooth.", "Warm the olive oil in a wide braising dish (like this one) over medium heat, then pour in the onion and garlic puree. Cook over medium heat the onion and garlic release their fragrance, and begin to color. Pour in the pureed tomato, and then turn the heat down to medium-low. Stir in the smoked paprika and drop in the herbs. Simmer, uncovered, until the flavors marry and the sauce thickens, about twenty minutes. Pluck out the herbs, adjust seasoning with salt, and transfer to a bowl.", "Heat the oven to 350 F.", "Butter your ramekins or cocottes (we use these mini cocottes), then line each cocotte with a slice of ham. Evenly distribute the sofrito into each of the cocottes, over the ham, and crack an egg over the sofrito. Bake until the white is set, but the yolk remains soft - about 8 minutes. Top with freshly chopped parsley and serve.", "You can make the sofrito ahead of time, storing it in the fridge up to a week. Then simply assemble the eggs and ham ten minutes before you plan to serve breakfast for a quick and easy meal."]}, {"id": "ycGO", "title": "Baked pecan & coconut oatmeal bliss", "image": "https://images.yumprint.com/p1yumprintzz/zZh_ZGB9izSB8ODhgMsMV14EkhozyQLjKGPHtv82l0pZfnq7Oyihr9eUekgbGgnH", "link": "http://www.raiseyourgarden.com/home/baked-pecan-coconut-oatmeal-bliss", "ingredients": ["1/2 cup raisins or", "1/2 cup dried blueberries", "Apple slices", "Chocolate chips"], "directions": ["Preheat oven to 375 degrees. Grease a 9-inch pie plate with cooking oil spray.", "Mix together 1/2 cup of the pecans, 2 tablespoons of the coconut, 1/4 teaspoon of the cinnamon, the table spoon of brown sugar and a pinch of salt in a medium bowl.", "In a separate bowl, stir together the oats, baking powder, the remaining 3/4 teaspoon of cinnamon and the remaining 1/2 teaspoon of salt in a mixing bowl.", "Whisk together the milk, maple syrup, egg, oil and vanilla extract in a liquid measuring cup.", "Pour the milk mixture over the oat mixture, stirring to combine, then mix in the remaining 1/2 cup of pecans and 2 tablespoons of coconut. This is also where you'd add the apple, carrot and raisins.", "Pour in the sprayed baking dish. Top with the pecan-coconut mixture. Bake for 40-45 minutes or until golden at the edges. Serve warm. Top with apple slices. Makes about 8 slices of \"pie\"", "Make ahead and store in the fridge in an airtight container for up to 4 days. Cover with foil and reheat in a 350-degree oven for 15-20 minutes. You can also put in the microwave."]}, {"id": "ILZP", "title": "Banana Blueberry Baked Breakfast Oatmeal", "image": "https://images.yumprint.com/p1yumprintfz/fzqDDpa19MHGnyI-VgThLPdIWG87TH0uosniqMQyTF34ONdroXGni4G4Bb5r7Hyo", "link": "http://www.missallieskitchen.com/2018/02/06/banana-blueberry-baked-breakfast-oatmeal/", "ingredients": ["2 ripe bananas, mashed (the riper the better)", "2 tablespoons melted coconut oil", "1 + ¼ cups milk of choice (coconut, cashew, almond, dairy aka cow, whatever you want)", "2 eggs, beaten", "½ cup maple syrup", "1 teaspoon vanilla extract", "3 cups whole rolled oats", "2 tablespoons chia seeds", "1 teaspoon baking powder", "1 pinch sea salt", "1 cup blueberries"], "directions": ["Start by preheating to oven to 350 degrees. Line a baking dish with parchment paper.", "Mash the bananas in a large bowl and add the coconut oil, milk, beaten eggs, maple syrup and vanilla. Whisk or beat together well.", "Add the oats, chia seeds, baking powder and sea salt. Mix everything together well. Fold in the blueberries. Pour the batter into the lined dish and place in the oven for 30-35 minutes, or until the oats are golden brown and the mixture is set. There should not be any jiggling when the dish is pushed and it should appear dry on top.", "Let this cool a bit before serving immediately or placing in the fridge to eat later. If you're reheating later, place a slice in the microwave for 1 minute. Enjoy!!!!"]}, {"id": "KDk3", "title": "Banana Split Overnight Oats", "image": "https://images.yumprint.com/p1yumprint7s/7szlDG2KS5KY0SgzQaDSzVDk1mhCWXk7_bFxiU9I41UIrdDtSS6Xj9XdzujJsdic", "link": "http://www.wholesomelicious.com/banana-split-overnight-oats/?fbclid=IwAR1kORI2StsZbcPmCn05B0VH_fiXNibziQ8DzwyGZfM_MFfY3Of7HHrKiYE", "ingredients": ["1/2 cup rolled oats", "2 tbsp chia seeds", "1 cup milk or milk alternative, I use flax milk", "1 tbsp maple syrup or honey", "1 banana sliced", "3-4 strawberries diced", "2 tbsp chocolate chips", "1 tbsp pecans or nuts of of your choice"], "directions": ["The night before, mix together oats, chia seeds, milk, and sweetener in a jar or bowl. Cover and refrigerate overnight.", "The next morning, give your mixture a good stir. Top with bananas, strawberries, chocolate chips, and pecans."]}, {"id": "durq", "title": "Banana-Apple Buckwheat Muffins", "image": "https://images.yumprint.com/p1yumprintg1/G1g97rcqnptt246cgOdobWNOhu0EzBClOokQy8KgxZquDcdwoNUwzf_8sAR1M_P9", "link": "http://www.wholeliving.com/216610/banana-apple-buckwheat-muffins", "ingredients": ["1/4 cup buckwheat flour", "1 tsp baking powder", "1/2 tsp ground cinnamon", "1/8 tsp coarse salt", "2 large eggs", "1/2 mashed banana", "1/4 cup honey", "1/2 finely diced (peeled and cored) sweet apple (such as Honeycrisp)", "1/4 cup chopped walnuts"], "directions": ["Heat oven to 350 degrees. Place four baking cups in a muffin tin.", "In a bowl, whisk together flour, baking powder, cinnamon, and salt. In another bowl, whisk together eggs, banana, and honey. Mix the wet ingredients into the dry, then fold in apple and walnuts.", "Fill the batter to the tops of the lined cups and fill remaining cups halfway with water.", "Bake 30 minutes, or until a tester comes out clean. Let cool on a wire rack.", "Cook's Note", "Store muffins in an airtight container up to 2 days."]}, {"id": "xTmT", "title": "Beg Worthy Banana Nut Muffins or Bread", "image": "https://images.yumprint.com/p1yumprintmd/MdJmGJBxt_guNCar4CND5xvKgaay8qqszNzqdqr3j9pqG3x6u7Zk9bFeK2W8XRCJ", "link": "http://www.plantpurepods.com/recipes/recipe/beg-worthy-banana-nut-muffins-or-bread/", "ingredients": ["2 Cups whole wheat pastry flour", "1 tsp baking powder", "½ tsp baking soda", "¼ tsp salt", "½ tsp cinnamon", "½ tsp nutmeg", "¼ cup brown sugar", "½ cup unsweetened applesauce", "¼ c almond or peanut butter", "2 cups overripe bananas –(mashed – about 3 bananas)", "½ tsp almond extract", "¼ c non-dairy milk (e.g. almond, Soy milk)", "Almond slivers and flax seeds to sprinkle on top", "Optional – coconut – cacao chips, almond slivers, raisins"], "directions": ["Optional: add 1/2 cup chopped nuts or cacao chips", "Preheat oven to 350 degree F", "In a large bowl, combine flour, baking powder, baking soda, salt, cinnamon, and nutmeg.", "In a medium size bowl, cream together brown sugar, applesauce, and almond butter using a hand mixer or fork. Once mixed, add bananas. Add almond extract and milk. Stir to combine.", "Add wet ingredients to dry and stir until just combined.", "Spread batter into a loaf pan or muffin liners (wax based muffin liners work best) and scatter seeds on top.", "Bake for 20-25 min (or longer if using loaf pan) or until toothpick inserted comes out clean. Let cool before slicing if cooking in loaf pan."]}, {"id": "It8f", "title": "Berry-Kefir Smoothie", "image": "https://images.yumprint.com/p1yumprintc4/C4sVSMWpcaaeAXsbZypghtojRYD6sxAiOlfJwUhGdqFtd3fJEpxFqrnv9WW-An3J", "link": "http://www.eatingwell.com/recipe/257793/berry-kefir-smoothie/", "ingredients": ["1½ cups frozen mixed berries 1 cup plain kefir ½ medium banana 2 teaspoons almond butter ½ teaspoon vanilla extract"], "directions": ["Combine berries, kefir, banana, almond butter and vanilla in a blender. Blend until smooth."]}, {"id": "B-4M", "title": "Bite-Sized Banana Oatmeal Muffins", "image": "https://images.yumprint.com/p1yumprintkk/kK_TJ1tzlSt2VAqnyOPzZyklvV0U6r7X_pMteGbgvjflSlyvImfLQVzp_8vcObRa", "link": "https://www.buzzfeed.com/robertbroadfoot/these-banana-oatmeal-muffins-are-perfect-for-a-snack-on-the", "ingredients": ["2 bananas", "2 eggs", "⅓ cup maple syrup", "¼ teaspoon salt", "2 teaspoons baking powder", "2 teaspoons vanilla extract", "1 tablespoon cinnamon", "1 cup Greek yogurt", "3 cups oats", "1 cup whole milk", "Optional: preferred toppings (dried cranberries, apples, blueberries, nuts)"], "directions": ["Preheat the oven to 350˚F/180˚C.", "In a medium bowl, mash bananas. Mix eggs, maple syrup, salt, baking powder, vanilla extract, cinnamon, and Greek yogurt into mixture.", "Add oats and milk, and mix. Let the mixture sit for a few minutes, so the oats soak up the liquid and the consistency is like oatmeal.", "Line muffin tins with muffin liners. Pour the mixture into each muffin cup about ¾ full. Add your preferred toppings and gently push your toppings into each muffin cup.", "Bake for 30 minutes.", "Let cool for 5 minutes before eating. Once cool, you can also store in an airtight container or freeze in a storage bag."]}, {"id": "fAQp", "title": "Blueberry Bliss Breakfast Bars", "image": "https://images.yumprint.com/p1yumprintdg/dg42UKpZfOPqq3vcMALRYUfWX5GLQxMdBx-H8wRCvhPt1AYuLynV_EtRVfQTifaM", "link": "http://www.inspirededibles.ca/2013/05/blueberry-bliss-breakfast-bars-raw.html", "ingredients": ["1 + 1/2 cups 100% pure, uncontaminated, rolled oats***", "3/4 cup whole almonds", "Heaping 1/2 cup dried blueberries", "1/2 cup pistachios", "1/3 cup ground flaxseed", "1/3 cup walnuts", "1/3 cup pepitas", "1/4 cup sunflower seeds", "1/3 cup pure maple syrup or honey", "1/4 cup unsweetened apple sauce", "1 cup almond butter"], "directions": ["Line an 8\"x 8\" (or so) baking pan with parchment or wax paper such that the paper hangs over the edges (the pan I used is 7\" x 10\").", "Combine the first 8 ingredients in a large bowl and mix to combine.", "Add maple syrup or honey and apple sauce and mix to combine.", "Add almond butter to mixture and mix until combined.", "Place batter in prepared pan pressing down firmly with palm of hands (or mini-roller if you have one) and distributing as evenly as possible.", "Allow pan to sit in freezer for approximately 1 hour.", "Remove pan from freezer. Lift singular slab from pan by lifting up on paper. Set slab down and gently peel paper away.  Slice slab diagonally into 8 long bars and then cut each long bar in half to create a total of 16 bars.  I find these bars keep best in a sealed container/bag in the freezer.", "Makes 16 bars, cal.232"]}, {"id": "HQ39", "title": "Blueberry Kefir Chia Pudding", "image": null, "link": "https://www.thehealthymaven.com/2014/05/blueberry-kefir-chia-pudding.html", "ingredients": ["1 cup blueberries (fresh or frozen)", "1 cup kefir", "1/2 cup unsweetened almond milk", "3.5 T chia seeds", "Toppings of choice: coconut flakes, cacao nibs, chocolate chips etc…"], "directions": ["Add blueberries and kefir to a blender and blend until well combined.", "Add in large container combine blended blueberries with almond milk and chia seeds.", "Place in refrigerator for at least 6 hours.", "Add toppings of choice and serve cold."]}, {"id": "x6hL", "title": "Blueberry Quinoa Breakfast Bars", "image": "https://images.yumprint.com/p1yumprintna/na8S8O6Bv5PfVimNHJI45IjVNLbJ2z5TjqphXexHv8VF2QhHdAbR1GdY06EdtJzP", "link": "http://www.simplyquinoa.com/blueberry-quinoa-breakfast-bars/", "ingredients": ["1½ cups quick cooking oats", "1 cup cooked quinoa", "1 teaspoon baking powder", "⅓ cup coconut sugar", "¼ cup hemp seeds", "1 cup mashed bananas (about 2 medium)", "2 flax eggs (reference this recipe for how to make them)", "2 tablespoons nut/seed butter", "2 tablespoons fresh lemon juice", "1 teaspoon vanilla (powder or extract)", "1½ cups fresh blueberries"], "directions": ["Preheat the oven to 350 degrees F. Line a 9\"x 9\" baking sheet with parchment paper and grease the sides with cooking spray.", "In a large mixing bowl, whisk together the oats, quinoa, sugar, baking powder, and hemp seeds.", "In a separate bowl, mix the banana, nut butter, flax eggs, lemon juice and vanilla. Pour this mixture over the dry ingredients, mixing everything together until fully incorporated. The batter should be moist, but not runny. Fold in the blueberries", "Transfer the batter into the prepared pan and smooth with a spatula.", "Bake on the center rack for 25 - 35 minutes until the bars are golden brown and firm to the touch.", "Remove and let cool completely in the pan, then remove and slice into squares (or rectangles). Store in an airtight container for 4 - 5 days.", "Notes", "I found that I enjoyed the texture of the bars best after being cooled on a wire rack overnight. Some of the added moisture from the blueberries was removed and they were even more hearty."]}, {"id": "H-EW", "title": "Blueberry-Cashew Granola Bars", "image": "https://images.yumprint.com/p1yumprintig/IG47gqnkPUB5G_2LGACIsEG4wCMyFvhm6imSaLAC4kEW--3HkF3KQlVFF-MJ203V", "link": "http://www.eatingwell.com/recipe/259652/blueberry-cashew-granola-bars/", "ingredients": ["3 cups old-fashioned rolled oats1 cup crispy brown rice cereal", "1 cup dried blueberries½ cup unsalted cashews, toasted and chopped½ cup flaxseed, toasted¼ teaspoon salt", "⅔ cup brown rice syrup or light corn syrup½ cup cashew butter1 teaspoon coconut extract"], "directions": ["Preheat oven to 325°F. Line a 9-by-13-inch baking pan with parchment paper, leaving extra parchment hanging over two sides. Lightly coat the parchment with cooking spray. Combine oats, rice cereal, blueberries, cashews, flaxseed and salt in a large mixing bowl. Combine rice syrup (or corn syrup), cashew butter and coconut extract in a microwave-safe bowl. Microwave for 30 seconds (or heat in a saucepan over medium heat for 1 minute). Add to the dry ingredients and stir until evenly combined. Transfer to the prepared pan and firmly press into the pan with the back of a spatula. For chewier bars, bake until barely starting to color around the edge and still soft in the middle, 20 to 25 minutes. For crunchier bars, bake until golden brown around the edge and somewhat firm in the middle, 30 to 35 minutes. (Both will still be soft when warm and firm up as they cool.) Let cool in the pan for 10 minutes, then using the parchment to help you, lift out of the pan onto a cutting board (it will still be soft). Cut into 24 bars, then let cool completely without separating the bars, about 30 minutes more. Once cool, separate into bars."]}, {"id": "vWf2", "title": "Breakfast Blueberry-Oatmeal Cakes", "image": "https://images.yumprint.com/p1yumprintgr/GrLti8Mxci0AFwhgIHA0JE021C-J9CcfNx_EYikfsd2YUTrPC1Bc4IgDvSe9OV-6", "link": "http://www.eatingwell.com/recipes/breakfast_blueberry_oatmeal_cakes.html?socsrc=ewfb0106162", "ingredients": ["2 1/2 cups old-fashioned rolled oats", "1 1/2 cups low-fat milk", "1 large egg, lightly beaten", "1/3 cup pure maple syrup", "2 tablespoons canola oil", "1 teaspoon vanilla extract", "1 teaspoon ground cinnamon", "1 teaspoon baking powder", "1/4 teaspoon salt", "3/4 cup blueberries, fresh or frozen"], "directions": ["Combine oats and milk in a large bowl. Cover and let soak in the refrigerator until much of the liquid is absorbed, at least 8 hours and up to 12 hours.", "Preheat oven to 375°F. Coat a 12-cup nonstick muffin tin with cooking spray.", "Stir egg, maple syrup, oil, vanilla, cinnamon, baking powder and salt into the soaked oats until well combined. Divide the mixture among the muffin cups (about 1/4 cup each). Top each with 1 tablespoon blueberries.", "Bake the oatmeal cakes until they spring back when touched, 25 to 30 minutes. Let cool in the pan for a 10 minutes. Loosen and remove with a paring knife. Serve warm."]}, {"id": "I3zX", "title": "Breakfast Burritos", "image": "https://images.yumprint.com/p1yumprint23/23YS-SPRMhfKpp8C7QlYLwnIlEfV4xPWnc8gYcRBYin5eQB3Ad7Y96Hwqq_zaFv4", "link": "https://www.serenabakessimplyfromscratch.com/2013/01/breakfast-burritos.html", "ingredients": ["3 tablespoons Butter", "2 whole Baking Potatoes, Washed And Diced", "1/2 whole Onion, Diced", "1/2 whole Bell Pepper, Diced", "6 ounces Mushrooms, Sliced", "1/4 pound Ground Breakfast Sausage Or Bacon Diced", "1 teaspoon Granulated Garlic", "1 teaspoon Cumin", "1 teaspoon Chili Powder", "1 Pinch Sea Salt Or To Taste", "3 cups Spinach Or Chopped Kale", "5 whole Eggs", "1/4 cup Milk", "6-8 whole Soft Flour Tortilla Shells, Heated", "Cheese, Avocados, Greek Yogurt Or Sour Cream, Mango Salsa, Pico De Gallo And Any Other Desired Toppings."], "directions": ["In a large skillet over medium high heat melt 2 tablespoons butter. Add potatoes and onions. Saute until potatoes start to brown and add bell pepper.", "Add mushrooms and saute until mushrooms start to soften.", "At this point push all the veggies over to one side of the pan and add sausage or bacon if using. Cook meat until cooked through.", "Mix sausage with veggies. Season with sea salt, pepper, granulated garlic, cumin and chili powder, mix until combined.", "Stir in spinach or kale and cook for 1 minute or until just barely wilted. (If using kale cook until wilted.)", "Combine eggs with milk and whisk until thoroughly combined.", "If your skillet is large enough push the sausage veggie mixture over to the side of pan, other wise remove from pan. Add 1 tablespoon butter, wait until butter melts and add eggs. Let eggs set for about 45 seconds and then scrape the bottom of the pan to scramble the eggs. Continue to scramble the eggs until cooked through.", "Combine the eggs with the veggie mixture.", "Fill tortilla shells with filling and choice of desired toppings."]}, {"id": "s3WF", "title": "Breakfast Egg Muffins", "image": "https://images.yumprint.com/p1yumprintnp/NplIl5u01u52QyFOfUCqZgjCTNg5CvUiWY_-VFEYkcYcNqXDM6Q9jU7HGh7IyAMb", "link": "http://www.strongandbeyond.com/2015/02/breakfastegg-muffins.html?spref=pi#.Ve-kndJ3n4a", "ingredients": ["1/4 cup red bell pepper, diced", "1/4 cup mushrooms, chopped", "1/4 marble cheese", "1/4 cup green onions, chopped", "1/2 cup fresh spinach, chopped", "2 to 3 tablespoons fresh basil, diced", "1/2 teaspoon sea salt", "1/4 teaspoon ground pepper", "8 –10 eggs"], "directions": ["Preheat oven to 375 degrees. Grease a 12-cup muffin pan with coconut oil. In a medium bowl, red bell pepper, chopped mushrooms, cheese, green onions, spinach, and basil. Set aside.", "In a large bowl, whisk together eggs, salt and pepper. Add egg mixture to the veggie mixture and stir to combine. Using a measuring cup or a ice cream scoop fill muffin cups with egg mixture being sure not to fill cups to the rim. I used about 1/4 to 1/3 cup in each cup.", "Bake the egg muffins for 20 to 25 minutes or until eggs are set in the middle. Makes about 12 to 16 muffins. Muffins can be stored in an airtight container in the refrigerator for up to 3 to 4 days. Enjoy!"]}, {"id": "jotp", "title": "Brie and Blueberry Waffle Grilled Cheese", "image": "https://images.yumprint.com/p1yumprintj1/J1gxJMWpbAmdJAcyzZojUxsyb-2UmEFK_3mVXAF8lytcisQD5AA5alk6h95d5rdb", "link": "http://damndelicious.net/2013/04/24/brie-and-blueberry-waffle-grilled-cheese/", "ingredients": ["1 1/2 cups blueberries", "Zest of 1 lemon", "2 tablespoons freshly squeezed lemon juice", "1 tablespoon sugar", "2 tablespoons unsalted butter", "8 waffles", "4 ounces Wisconsin Brie, thinly sliced"], "directions": ["In medium saucepan, combine blueberries, lemon zest, lemon juice and sugar. Bring to boil; reduce heat to low and simmer, stirring occasionally, until sauce has thickened, about 5 minutes.", "Heat butter in grill pan over medium-high heat. Place 3-4 slices Brie on 4 waffles and top with generous scoop of prepared blueberry compote. Repeat with remaining waffles and top with remaining 4 waffles to make 4 sandwiches.", "Place sandwiches in pan and grill, flipping once, until waffle is golden and cheese has melted, about 2-3 minutes per side."]}, {"id": "rdHm", "title": "Buttermilk Blueberry Breakfast Cake", "image": "https://images.yumprint.com/p1yumprint4s/4sp2MvJGRe3WSnDA0kIlOVqWNzwrTlW5rt75h_Fr87E11AD6-G48Bf9BLNQbK3Ay", "link": "http://www.chef-in-training.com/2012/05/buttermilk-blueberry-breakfast-cake/", "ingredients": ["½ cup butter, softened", "¾ cup sugar", "1 egg, room temperature", "1 tsp. vanilla", "2 cups flour", "2 tsp. baking powder", "1 tsp salt", "2 cups fresh blueberries", "½ cup buttermilk", "1 Tbsp. sugar, for sprinkling on top"], "directions": ["Preheat the oven to 350ºF. Cream butter and sugar until light and fluffy.", "Add the egg and vanilla and beat until combined.", "Toss the blueberries with ¼ cup of flour.", "In a separate bowl, whisk together the remaining flour, baking powder and salt.", "Add the flour mixture to the batter a little at a time, alternating with the buttermilk. Fold in the blueberries.", "Grease a 9-inch square baking pan with non-stick spray. Spread batter into pan. Sprinkle batter with remaining tablespoon of sugar. Bake for 35-45 minutes. Check with a toothpick for doneness. Let cool at least 15 minutes before serving."]}, {"id": "EqUe", "title": "Buttermilk-Blueberry Breakfast Cake", "image": "https://images.yumprint.com/p1yumprintfr/fr_XWLYNta9gwRn_HqzLkLdJycSUgY4QYoTfL-bBiHgvhTzuIt_-s3jZT2UzXqm_", "link": "http://www.alexandracooks.com/2011/06/29/buttermilk-blueberry-breakfast-cake/", "ingredients": ["½ cup unsalted butter, room temperature", "2 tsp. lemon zest or more — zest from 1 large lemon", "⅞ cup* + 1 tablespoon sugar for sprinkling", "1 egg, room temperature", "1 tsp. vanilla", "2 cups flour (set aside ¼ cup of this to toss with the blueberries)", "2 tsp. baking powder", "1 tsp. kosher salt", "2 cups fresh blueberries", "½ cup buttermilk**", "⅞ cup = ¾ cup + 2 tablespoons"], "directions": ["Preheat the oven to 350ºF. Cream butter with lemon zest and ⅞ cup of the sugar until light and fluffy.", "Add the egg and vanilla and beat until combined. Meanwhile, toss the blueberries with ¼ cup of flour, then whisk together the remaining flour, baking powder and salt.", "Add the flour mixture to the batter a little at a time, alternating with the buttermilk. Fold in the blueberries.", "Grease a 9-inch square baking pan (or something similar) with butter or coat with non-stick spray. Spread batter into pan. Sprinkle batter with remaining tablespoon of sugar. Bake for 35 to 45 minutes. Check with a toothpick for doneness. If necessary, return pan to oven for a couple of more minutes. (Note: Baking for as long as 10 minutes more might be necessary.) Let cool at least 15 minutes before serving."]}, {"id": "Kf20", "title": "Carrot Banana Bread Muffins with Walnut Chia Crumble", "image": "https://images.yumprint.com/p1yumprintaf/AFGntSmZOgF4EwK2U6bfQqbxbYyOHkvmk7r4Vq4T-W5r-Pr-f03ebxhbzMo4IYlb", "link": "https://shop.sprouts.com/shop/recipes/1366", "ingredients": ["1/4 cup Walnuts, toasted and finely chopped", "2 3/4 cup Old-fashioned oats", "1/2 cup Oat flour", "1/4 cup Brown sugar", "Pinch of kosher salt", "2 Tbsp. Sprouts Organic Black Chia Seeds", "2 Tbsp. Unsalted butter, melted", "2 Very ripe bananas, peeled and chopped", "1 cup Sprouts Plain Greek Yogurt", "1/4 cup Maple syrup", "2 Large eggs", "2 tsp. Baking powder", "1 tsp. Vanilla extract", "1 tsp. Ground cinnamon", "4 Large carrots, peeled and grated (about 1 1/2 cups)"], "directions": ["Preheat oven to 425Â°F. Coat 12-cup muffin tin with cooking spray. In a medium bowl, stir together walnuts, 1/4 cup old-fashioned rolled oats, oat flour, brown sugar, salt and chia seeds for walnut chia topping. Drizzle melted butter over bowl and use hands to mix, pinch together to create crumbles.", "For the muffins, add 2 1/2 cup oats, bananas, Greek yogurt, maple syrup, eggs, baking powder, vanilla extract and cinnamon to blender and blend on high until smooth, scraping down sides, as needed. If more liquid is needed, add cool water, 2 tablespoons at a time, until batter is smooth.", "Combine batter and carrots in large bowl, stirring until carrots are evenly distributed. Pour batter into prepared muffin tin. Top batter with crumble. Bake on center rack of oven 15-18 minutes, until tester comes out dry."]}, {"id": "A6Y_", "title": "Cashew Banana Turmeric Muffins", "image": "https://images.yumprint.com/p1yumprint7t/7TmvX7p8_56yzGSoiUyDHy561lu9C6ugE0FpTkC4EoCV__ZgnzVHFLGbXvLNbf4C", "link": "http://www.dietoflife.com/eat-1-tsp-turmeric-every-day-keep-away-pain-toxins-inflammation-cancer/", "ingredients": ["2 cups organic, sprouted wheat flour", "3 mashed ripe bananas", "1 cup chopped cashews", "1 teaspoon baking powder", "¼ cup melted coconut oil", "1 teaspoon each turmeric, cinnamon, nutmeg, cardamom, cloves, and salt."], "directions": ["Mix dry ingredients and wet ingredients in separate bowls. Slowly mix wet ingredients into dry, and pour into linen muffin tins. Bake at 350 degrees for approximately 25 minutes, or until a toothpick comes out clean."]}, {"id": "uKqH", "title": "Cashew Hemp Seed Bliss Balls", "image": "https://images.yumprint.com/p1yumprint9c/9cj3R-C_VFin6Xk_nHvCVQJS6ydodLm2XBZJA4Z6gUJJ_TljhEtEXaWR9ZHZgb_6", "link": "http://fitfoodiefinds.com/2014/04/cashew-hemp-seed-bliss-balls/", "ingredients": ["30 pitted medjool dates", "½ cup cashew meal or ground cashews", "2 tablespoons shredded coconut", "2 tablespoons hemp seeds", "pinch of salt"], "directions": ["Place 30 pitted dates in a small food processor. Process for about a minute or until your dates are chopped. Add the rest of the ingredients and mix until everything is combined. Using an inch cookie scoop, scoop out dough. Wet hands a little, then roll in your palm to form a ball. You shouldn't need too much moisture, but wet hands does help! Repeat x 10.", "141 calories- not bad for a ball of deliciousness!", "A perfect travel snack"]}, {"id": "HybY", "title": "Cauliflower English Muffins", "image": "https://images.yumprint.com/p1yumprintcz/CzoncuAyeoQ4emBNHijKPzYimyoeDONFlFwoGKGD33Y09T-JB3DO14Vz5s7PWL5e", "link": "http://www.eatingwell.com/recipe/262577/cauliflower-english-muffins/?utm_source=facebook&utm_medium=social&utm_campaign=etg_20180323_editorialcontent", "ingredients": ["5 cups cauliflower florets (about 1 pound)1 cup shredded sharp Cheddar cheese 1 large egg, lightly beaten 1/8 t. salt"], "directions": ["Preheat oven to 425°F. Line a large baking sheet with parchment paper. Place cauliflower in a food processor. Process until finely grated. Transfer to a microwave-safe bowl. Cover loosely and microwave on High for 3 minutes. Let cool slightly. Transfer the cauliflower to a clean kitchen towel and wring out excess moisture. Return to the bowl and stir in Cheddar, egg and salt until thoroughly combined. Place a 3-inch biscuit cutter on the prepared baking sheet. Fill the cutter with about ¼ cup of the batter, patting down slightly in the mold. Repeat with the remaining batter, leaving about 1 inch between each one, until you have 8 \"muffins.\" Bake until browned and crispy around the edges, about 25 minutes. Serve with your favorite toppings or use to make a breakfast sandwich."]}, {"id": "Jsvf", "title": "Chia Pudding", "image": "https://images.yumprint.com/p1yumprintdq/Dqk2I_nIV6r7l7geDjnP6wcjXv_CriNPXzozDJqXF28XfsIeI59e6rjwP9Py9X5W", "link": "https://www.ourpaleolife.com/banana-chia-pudding/", "ingredients": ["1 cup Water", "2-1/2 Tbsp Chia Seeds", "2 Ripe Bananas", "1 cup Full-Fat Coconut Milk", "1/2 tsp Ground Cinnamon", "Pinch Salt"], "directions": ["In the bowl of a food processor or in a blender, combine bananas and coconut milk and pulse until smooth. Pour banana mixture into a quart sized bowl (make sure to use a silicone spatula to scrape out everything) and mix in the cinnamon, salt, and chia gel.", "Store refrigerated and serve cold."]}, {"id": "uKo-", "title": "Chia Seed Breakfast Bowl", "image": "https://images.yumprint.com/p1yumprintta/tamJK6Y8XuhNHyPvCQgHj5arvSzOHnNpbtEgOIh_wUniRBF2pQ8-s-zwArWI1lR_", "link": "http://ohsheglows.com/2013/02/18/chia-seed-breakfast-bowl/", "ingredients": ["2 tbsp raw buckwheat groats, soaked", "2 tbsp raisins, soaked", "2 tbsp whole raw almonds, chopped and soaked", "couples pinches of cinnamon", "2 tbsp hemp seeds"], "directions": ["Mash bananas in a medium-sized bowl. Stir in chia seeds. Whisk in the almond milk, vanilla, and cinnamon until combined. Place in fridge overnight to thicken.", "Add buckwheat groats, raisins, and chopped almonds into another bowl. Cover in water and soak overnight in the fridge or on the counter.", "In the morning, place your desired amount of chia pudding into a bowl. (Note: at this point, you can blend your chia pudding if a smooth texture is desired, but I don’t bother). You can add more almond milk if you want to thin it out in the morning. Or, if it’s too thin, add more chia seeds to thicken it up. Drain and rinse the buckwheat/almond/raisin mixture. Sprinkle on top of chia mixture along with a pinch of cinnamon and a tablespoon of hemp seeds. Serve with a drizzle of maple syrup, if desired. Store leftovers in the fridge for 1-2 days."]}, {"id": "JsuS", "title": "Chia Seed Pudding", "image": "https://images.yumprint.com/p1yumprintkh/KhfTWUsuwPSNXNeH9PDFxEbW5_6A7OtdHNOMXIRAHPV-GxLxEfHbyabXUssissTY", "link": "https://hormonesbalance.com/recipes/breakfast/bills-chia-seed-pudding/", "ingredients": ["½ cup of chia seeds", "2 cups of coconut milk or any nut milk", "½ teaspoon vanilla essence", "optional: 1 tablespoon coconut butter or oil for extra richness", "sea salt to taste", "1 teaspoon honey", "opt fruit-2 handfuls of fresh raspberries, banana, blackberries, blueberries or applesauce"], "directions": ["Warm up the milk – but do not boil.", "Add a pinch of salt.", "Whisk the chia seeds into the warm milk, add coconut butter or oil (if using) and let stand for 10 to 15 minutes to set to a gel consistency.", "Reheat after standing if required, or allow to cool completely.", "Whisk in the raspberries and drizzle on the honey."]}, {"id": "LfCt", "title": "Chocolate Donut Recipe", "image": "https://images.yumprint.com/p1yumprintj_/J_Cwe9FDzy8AgfydSyUADZomnRxxf30aUqJhh-yF7fK6NiZg2jaXSMKE747Nv-hM", "link": "https://thewellnessway.com/chocolate-donuts/?fbclid=IwAR1yOLbXfxhvG7AmXB6WX8ckmUcT534VCVAhEsqdJTMy2JtarO567OPlzII", "ingredients": ["1 tablespoon organic coconut oil", "3/4 cup dairy-free chocolate chips, melted"], "directions": ["Preheat oven to 375 degrees.", "Whisk together ground flax seeds and water. Set aside.", "In large bowl, whisk cacao, baking soda, baking powder, salt, flour, and xylitol.", "In small bowl, mix together milk, melted coconut oil, flax mixture, and vanilla.", "Using a piping bag (or large Ziploc bag), pipe donut mixture in donut pan.", "Bake donuts for 10 minutes.", "While donuts cool, add coconut oil and melted chocolate chips together for the glaze.", "Dip tops of donuts into glaze."]}, {"id": "zgGN", "title": "Chocolate Pretzel & Cherry Popcorn Balls", "image": "https://images.yumprint.com/p1yumprintgk/gKQWRX_qApaekgYBS5CZqlSkedFP45pZ44xafCj-SUEcw0PMILsgrBN3O88jTyvg", "link": "http://www.eatingwell.com/recipes/cherry_popcorn_balls.html", "ingredients": ["6 heaping cups popped corn", "1/4 cup agave nectar (see Note) or honey", "1/4 cup creamy natural peanut butter or almond butter, at room temperature", "2 tablespoons finely chopped dark chocolate-covered pretzels", "2 tablespoons finely chopped dried cherries"], "directions": ["Line a baking sheet with parchment or wax paper. Prepare a medium bowl of ice water. Put popcorn in a large bowl.", "Combine agave (or honey) and peanut butter (or almond butter) in a small saucepan. Cook over medium heat, stirring gently but constantly. As soon as the mixture starts to lightly bubble, cook, stirring constantly, for 15 seconds more.", "Immediately pour the mixture evenly over the popcorn; gently mix with a wooden spoon or spatula until well coated. Gently stir in dark chocolate-covered pretzels and finely chopped dried cherries.", "Dip both hands in the ice water. Working quickly, press small handfuls (heaping 1/4 cup each) of the popcorn mixture firmly into 2-inch balls. (Make sure each ball gets a little bit of the pretzels and dried cherries.) Place the balls on the prepared baking sheet. If they seem too fragile, rinse hands with cold water and press and squeeze each ball again to help keep it together.", "Let cool completely before storing. To store, individually wrap in plastic wrap and store in an airtight container."]}, {"id": "zth4", "title": "Chocolate-Cherry Snack Bars", "image": "https://images.yumprint.com/p1yumprintev/EvJHnGtTIwsXsaQs5jHxcC6D2E3yk-QbcdBMMlpMMxCnyljrbnRb4TesRFeQAxDr", "link": "http://www.eatingwell.com/recipes/chocolate_cherry_snack_bars.html", "ingredients": ["2 1/2 cups unsweetened puffed wheat cereal", "1/2 cup pecan halves, chopped medium-fine", "1/3 cup salted roasted pepitas (see Notes)", "1/4 cup dried cherries or dried cranberries, coarsely chopped", "2 tablespoons sesame seeds", "1 tablespoon ground flaxseeds (see Notes)", "1/2 cup honey", "1/2 teaspoon vanilla extract", "1/8 teaspoon salt", "1/2 cup mini semisweet chocolate chips or finely chopped bittersweet chocolate"], "directions": ["Position a rack in lower third of oven; preheat to 300°F. Line an 8-inch-square pan with parchment paper, letting it overhang on two opposite sides.", "Toss cereal, pecans, pepitas, cherries (or cranberries), sesame seeds and ground flaxseeds in a large bowl.", "Combine honey, vanilla and salt in a small saucepan. Warm over medium heat, stirring, until the honey is more fluid and the salt is dissolved. Pour the honey mixture over the dry ingredients and fold until everything is moistened and sticky. Let cool for 5 minutes. Fold in chips (or chopped chocolate) until evenly distributed. Scrape the mixture into the prepared pan and spread evenly with a fork. Using the back of the fork, press the mixture very firmly all over. (Alternatively, cover with parchment paper and press firmly all over.)", "Bake until the top is golden brown, about 35 minutes. (If in doubt, take it out so the honey does not burn.) Run a knife along the unlined sides of the pan to detach the bars. Let cool in the pan on a wire rack to room temperature, about 1 hour. Use the ends of the parchment to lift the bars from the pan. Gently peel off the parchment. Use a heavy sharp knife to cut into 16 bars or squares.", "Make Ahead Tip: Store airtight for up to 1 week. | Equipment: parchment paper", "Notes: Hulled pumpkin seeds, also known as pepitas, are medium-dark green and have a delicate nutty flavor. They are sold salted, roasted and raw, and can be found in the natural-foods section of many supermarkets.", "Look for ground flaxseeds (or flaxmeal) in the natural-foods section of large supermarkets or in natural-foods stores. Store in the refrigerator or freezer."]}, {"id": "Jw97", "title": "Chocolate-Peanut Butter Energy Bars", "image": "https://images.yumprint.com/p1yumprintpn/PnzW2mYbHPzHZwxAaIMYCa3GAqAu5k8LmOAH__ijv3uARz-1RCD3vLBi6jWGluCp", "link": "http://www.eatingwell.com/recipe/266632/chocolate-peanut-butter-energy-bars/?utm_source=facebook.com&utm_medium=social&utm_campaign=eatingwell_eatingwell&utm_content=video_recipes&utm_term=2018100122", "ingredients": ["¾ cup chopped Medjool dates1 cup smooth natural peanut butter½ cup rolled oats (see Tip)¼ teaspoon salt", "½ cup chopped unsalted dry-roasted peanuts", "¾ cup bittersweet chocolate chips"], "directions": ["Soak dates in hot water to cover in a medium bowl for 10 minutes. Drain, reserving the soaking water. Meanwhile, line an 8-inch square baking pan with parchment paper, leaving extra hanging over 2 sides. Lightly coat the parchment with cooking spray. Combine the soaked dates, peanut butter, oats and salt in a food processor; process until very finely chopped and starting to clump together. If the mixture seems dry, add a little of the reserved soaking water, 1 tablespoon at a time. Transfer to the medium bowl and stir in peanuts. Spread the mixture evenly and firmly into the prepared pan. Place chocolate chips in a microwave-safe bowl and microwave on Medium (50%) until melted, 2 to 3 minutes. Spread the chocolate evenly over the oat mixture. Refrigerate until cold, about 1 hour. Remove from the pan by lifting the overhanging parchment. Cut into 16 squares."]}, {"id": "ywnt", "title": "Cinco de Mayo", "image": "https://images.yumprint.com/p1yumprintbh/bHJZw_x4ika_900BBvIwgIgRPEU2-peUXk1-mMcc3FP9CEHQq_UqJomZiwcXRODs", "link": "http://www.delish.com/cooking/recipe-ideas/recipes/a46832/cauliflower-hashbrown-egg-cups/", "ingredients": ["2 heads of cauliflower, steamed", "2 c. shredded Cheddar cheese", "1 dozen + 2 large eggs", "1 tsp. garlic powder", "1 tsp. garlic powder", "1 tsp. salt", "Fresh ground pepper to taste", "Chives, chopped (optional)"], "directions": ["Preheat oven to 375° F. Lightly grease a 12-cup muffin tin and set aside.", "Drop the steamed cauliflower into the bowl of a food processor and pulse until they start to resemble a fine grain.", "Pour the ground cauliflower onto paper towels and twist to wring out excess liquid. Do this up to three times until the cauliflower comes out completely dry.", "Transfer dry cauliflower to a large mixing bowl. Add cheddar cheese, garlic powder, salt and two eggs and stir to combine.", "Distribute the mixture evenly throughout the muffin tins and use your fingers to press the mixture into the sides and bottom of each cup to form the nests.", "Bake the nests for 15-17 minutes until brown.", "Add a couple bits of bacon to the bottom of each cup and crack an egg on top, without breaking the yolk.", "Bake for 7-8 minutes.", "Sprinkle with chives and pepper to taste."]}, {"id": "Idis", "title": "Coco-Nutty Granola", "image": "https://images.yumprint.com/p1yumprintun/UNXP1EkPiG4ikFY5gOH5st7ItPBiqU1NUJU3e9Q-RmwjSPK___yl-kuvAzukMC1e", "link": "https://nourishedkitchen.com/coco-nutty-granola/", "ingredients": ["3 cups unsweetened coconut flakes (available here)", "2 cups almonds, cashews, pecans, walnuts, pumpkin seeds (preferably sprouted), roughly chopped (buy sprouted nuts here)", "2 tablespoons chia seeds (available here)", "1 teaspoon ground cinnamon", "5-7 tablespoons coconut oil or butter, melted", "3 tablespoons brown rice syrup (available here)"], "directions": ["Variations: If you wish to add rolled oats, toss 2 cups into the bowl with the rest of the ingredients, and add a little more oil and syrup.", "To make chocolate granola clusters, mix in ½ cup raw cacao powder and 2 tablespoons cacao nibs with the rest of the ingredients before baking. Place the clusters on top of coconut yogurt as a dessert."]}, {"id": "IaUm", "title": "Cocoa and Cardamom Banana “Biscotti”", "image": "https://images.yumprint.com/p1yumprint9l/9L5EActo5PIxHMYXNulwpsAhgdjFLWrkYXOU2s9k2cSLYrn3Te0xYtH4p3ee6sUB", "link": "https://www.hormonesbalance.com/recipes/cocoa-cardamom-banana-biscotti/?utm_source=facebook&utm_medium=post", "ingredients": ["2 tablespoons ground flax seed", "5 tablespoons water", "2 ripe bananas", "¼ cup melted ghee", "1 teaspoon apple cider vinegar or lemon juice", "1 teaspoon ground cardamom", "1 ½ cups tiger nut flour - where to buy", "1 teaspoon baking soda", "½ teaspoon ground sea salt", "1 tablespoon dark cocoa powder"], "directions": ["Preheat the oven to 350F.", "Combine the flax seed and water in a small bowl and stir well. Refrigerate for 15 minutes.", "Combine all of the wet ingredients (including the soaked flax “eggs”) in a medium bowl. Mash to break up the bananas and stir until well mixed.", "Combine dry ingredients in a standing mixer fitted with a paddle attachment. Mix on low for 15 seconds. Add wet ingredients and mix on low until just combined.", "Line the loaf pan with parchment paper and grease it. Make sure that the parchment is tall enough that it runs up the sides to create handles to pull the bread out after it's baked.", "Pour the dough into the prepared pan. Smooth out with an offset spatula.", "Bake for 35-40 minutes, or until a toothpick inserted into the center comes out cleanly.", "Let the pan cool on a cooling rack.", "Once cooled, invert the bread onto the rack.", "To store: Wrap the bread in plastic wrap. It will keep for 3-4 days at room temperature."]}, {"id": "q_Mk", "title": "Coconut Flour Blueberry Muffins", "image": "https://images.yumprint.com/p1yumprintll/ll92_b9IsmQAyX8aqEInJTyLb11Qnh6UxZ2yL2ARXqRT1o9PICzFivTZ650S0K5B", "link": "http://www.strongandbeyond.com/2015/03/coconut-flour-blueberry-muffins.html#.VYgymflVikp", "ingredients": ["3 egg", "2 tbs. butter, unsalted", "2 tbs. coconut milk, unsweetened", "3 tbs. honey", "1 c. blueberries, frozen", "0.25 tsp. sea salt", "0.25 c. coconut flour", "0.25 tsp. baking powder", "0.25 tsp. vanilla extract"], "directions": ["Blend together eggs, butter, milk, honey, salt, and vanilla. Combine coconut flour with baking powder and thoroughly mix into batter until there are no lumps. Mix in blueberries. Pour batter into 6 muffin tins. Bake at 400°F for 23-25 minutes. Makes 6 muffins. One serving is 2 muffins. Enjoy!"]}, {"id": "kYdc", "title": "Coconut Flour Chocolate Chip Donuts – Gluten/Dairy-Free", "image": "https://images.yumprint.com/p1yumprintiy/IYVS0NWSK2UMKws7jTeUIb5aUhP8dHx3f8PE_COYhtDI9GVJZCqHzvE0Drz-0YpU", "link": "http://news.therawfoodworld.com/coconut-flour-chocolate-chip-donuts-glutendairy-free/", "ingredients": ["6 eggs", "4 Tablespoons coconut oil, slightly melted", "4 Tablespoons almond milk", "6 Tablespoons of pure maple syrup or agave", "1/2 teaspoon sea salt", "1/2 teaspoon almond extract", "1/2 cup coconut flour", "1/2 teaspoon baking powder (use aluminum-free brand)", "1/2 teaspoon cinnamon", "1/2 teaspoon nutmeg", "3 ripe bananas, diced", "dark chocolate chips or chopped dark chocolate (to taste, approximately 1/2 cup)"], "directions": ["Beat eggs in a large bowl.  Add all other ingredients (except diced bananas and dark chocolate chips) and mix well.  There will be some lumps but that is okay…they will melt as the donuts bake.", "Next, gently fold the diced bananas and dark chocolate chips into the batter.", "Grease a donut pan generously with coconut oil and pour batter into the donut pan.", "Bake at 400 degrees Fahrenheit for approximately 10-12 minutes.  Check for doneness by poking with a toothpick…they are fully cooked when the toothpick comes out clean.", "Let set in donut pan for a few minutes and then transfer to cooling rack."]}, {"id": "xL9G", "title": "Coconut Oil Almond Power Bars", "image": "https://images.yumprint.com/p1yumprintzh/ZhOvDq5mC7YMTjRxl8bm2JdfBIIyhi4WMPRlYBblAkhN3RoDcZptvXKeZS5qrIlo", "link": "http://theheartysoul.com/health-benefits-of-coconut-oil/?t=HHL", "ingredients": ["2 cups of raw almonds", "1/2 cup of sunflower seeds", "1/2 cup of hazelnuts", "1/2 cup of unsweetened almond butter", "1/2 cup of melted coconut oil", "3 tablespoons of honey", "2 teaspoons of vanilla", "150 grams of dark chocolate", "1 tablespoon of non-melted coconut oil"], "directions": ["Blend the almonds, sunflower seeds, hazelnuts and almond butter in a food processor for about 10 seconds.", "Mix honey and vanilla into melted coconut oil.", "Combine the coconut oil mixture to the nut mixture in the food processor and blend until well-mixed.", "Place the mixture in an 8×8 baking pan lined with parchment paper. Pat down the mixture using either your hands or the back of a spoon to even out the layer.", "Place the pan in the freezer for around 30 minutes, in the mean time melt the remaining coconut oil in with the dark chocolate over a saucepan on low heat.", "After the nut mixture is finished freezing, pour the chocolate mixture over it and spread it out evenly. Place in the fridge for 30 minutes."]}, {"id": "xL9H", "title": "Coconut Oil Date Power Bars", "image": "https://images.yumprint.com/p1yumprintbk/BK4ovaunx49osZOyicXG9Zzhfp8RwhcCnKQpZX7LARwG_j5NUGykHwg4JNvfmobN", "link": "http://theheartysoul.com/health-benefits-of-coconut-oil/?t=HHL", "ingredients": ["10 pitted dates", "1 and a half cups of walnuts", "1/4 cup of cocoa powder", "1/4 cup of coconut oil"], "directions": ["Blend walnuts in a food processor until they get very crumbly.", "Add remaining ingredients and blend until well mixed.", "Firmly press the mixture into a baking pan lined with parchment paper.", "Place in refrigerator and let cool for at least 30 minutes."]}, {"id": "ujca", "title": "Coconut Oil Granola Clusters – Vegan & Gluten Free", "image": "https://images.yumprint.com/p1yumprintmc/mCPJ9lGInX-GiP5wrY1L3spWmH1rBprPFMp305JZ9iMStWvBB-UDmBfgAhh5sm1W", "link": "http://www.healthy-holistic-living.com/gluten-free-coconut-oil-treats.html", "ingredients": ["3 cups quick oats", "½ cup chopped almonds", "½ cup ground almonds", "½ tsp sea salt", "⅓ cup maple syrup", "3 tbsp. coconut oil", "½ tsp vanilla"], "directions": ["Preheat your oven to 350 and line a baking sheet with parchment", "Stir together the dry ingredients ( the first 5 ingredients ) in a large mixing bowl and set aside", "In a small saucepan, over low heat melt together the coconut oil and maple syrup. Remove from heat and sit in the vanilla. Pour over the dry mixture and stir well", "Spread onto the lined baking sheet and bake for five minutes. remove form the oven, flip it over and bake for five minutes more", "Remove from heat and cool completely. Break into clusters and enjoy with milk or even by the handful on their own!"]}, {"id": "xL9I", "title": "Coconut Oil Maple Pecan Bars", "image": "https://images.yumprint.com/p1yumprinter/eR3op_v7hwi8EFPCftu0-vMzazM6w9hSZcfQmUoyC57bL3vagQHpJH4aj4ZV5nlw", "link": "http://theheartysoul.com/health-benefits-of-coconut-oil/?t=HHL", "ingredients": ["2 cups of toasted and chopped pecans", "1/2 cup of almond flour", "1 cup of rolled oats", "1/2 teaspoon of salt", "1/4 cup of almond butter", "1/2 cup of coconut oil", "1/4 cup of maple syrup", "2 teaspoons of vanilla extract"], "directions": ["Mix the chopped pecans, almond flour, rolled oats and salt in a large bowl.", "In a pan, melt the coconut oil and pecan-almond mixture together and mix.", "Add maple syrup and vanilla and stir them into it.", "Press the mixture into a 9 x 9 baking pan lined with parchment paper.", "Place in the freezer and allow to cool for 15-30 minutes."]}, {"id": "D39G", "title": "Coconut-Carrot Morning Glory Muffins", "image": "https://images.yumprint.com/p1yumprint5z/5z6sKkwW7WCdspngHZTrIGW-AEHhTmiZexWnFwEW00LJVrktFWeTpjYTJb1wgAf6", "link": "http://www.eatingwell.com/recipe/250651/coconut-carrot-morning-glory-muffins/?utm_source=facebook&utm_medium=social&utm_campaign=etg_852837417_editorialcontent", "ingredients": ["1 cup whole-wheat or white whole-wheat flour", "½ cup old-fashioned rolled oats, plus 2 tablespoons for garnish2 teaspoons baking powder2 teaspoons ground cinnamon½ teaspoon salt¼ teaspoon ground allspice2 large eggs", "1 cup unsweetened applesauce⅓ cup honey2 teaspoons vanilla extract¼ cup coconut oil, melted if necessary (see Tip)2 cups shredded carrots½ cup unsweetened shredded coconut, plus 2 tablespoons for garnish½ cup raisins"], "directions": ["Preheat oven to 350°F. Coat a 12-cup muffin tin with cooking spray. Whisk whole-wheat flour, ½ cup oats, baking powder, cinnamon, salt and allspice in a medium bowl. Whisk eggs, applesauce, honey and vanilla in a large bowl. Whisk in coconut oil. Gently stir in the flour mixture just until moistened. Fold in carrots, ½ cup coconut and raisins. Divide the batter among the muffin cups. Sprinkle with the remaining 2 tablespoons each oats and coconut. Bake the muffins until they spring back when lightly touched and a toothpick inserted in the center comes out with only moist crumbs attached, 30 to 35 minutes. Let stand in the pan for 10 minutes before turning out onto a wire rack. Serve warm or at room temperature.", "Make Ahead Tip: Individually wrap in plastic and store at room temperature for up to 3 days or freeze for up to 3 months. To reheat, remove plastic, wrap in a paper towel and microwave on High for 30 to 60 seconds.", "Equipment: Muffin tin with 12 ( ½-cup) cups", "Tip: Coconut oil is solid at temperatures below 76°F. To melt solidified coconut oil, remove the lid and place the container in a bowl of very hot water; stir frequently until melted.", "Storage smarts: For long-term freezer storage, wrap your food in a layer of plastic wrap followed by a layer of foil. The plastic will help prevent freezer burn while the foil will help keep off-odors from seeping into the food.", "Nutrition information", "Serving size: 1 muffin", "Per serving: 186 calories; 8 g fat(6 g sat); 3 g fiber; 28 g carbohydrates; 4 g protein; 13 mcg folate; 31 mg cholesterol; 15 g sugars; 7 g added sugars; 3,116 IU vitamin A; 2 mg vitamin C; 71 mg calcium; 1 mg iron; 206 mg sodium; 193 mg potassium", "Nutrition Bonus: Vitamin A (62% daily value)", "Carbohydrate Servings: 2", "Exchanges: ½ starch, ½ fruit, ½ vegetable, ½ other carbohydrate, 1½ fat"]}, {"id": "zewY", "title": "Coconut-Carrot Morning Glory Muffins", "image": "https://images.yumprint.com/p1yumprintx5/X5quBY-EwKz6rYNOshVgfJ0fxMIHAf6AN5L1-arn8e55youFTK9UaGbhBvSmySGl", "link": "http://www.eatingwell.com/recipes/coconut_carrot_morning_glory_muffins.html?socsrc=ewfb060516veg", "ingredients": ["1 cup whole-wheat or white whole-wheat flour", "1/2 cup old-fashioned rolled oats, plus 2 tablespoons for garnish", "2 teaspoons baking powder", "2 teaspoons ground cinnamon", "1/2 teaspoon salt", "1/4 teaspoon ground allspice", "2 large eggs", "1 cup unsweetened applesauce", "1/3 cup honey", "2 teaspoons vanilla extract", "1/4 cup coconut oil, melted if necessary (see Tip)", "2 cups shredded carrots", "1/2 cup unsweetened shredded coconut, plus 2 tablespoons for garnish", "1/2 cup raisins"], "directions": ["Preheat oven to 350°F. Coat a 12-cup muffin tin with cooking spray.", "Whisk whole-wheat flour, 1/2 cup oats, baking powder, cinnamon, salt and allspice in a medium bowl.", "Whisk eggs, applesauce, honey and vanilla in a large bowl. Whisk in coconut oil. Gently stir in the flour mixture just until moistened. Fold in carrots, 1/2 cup coconut and raisins.", "Divide the batter among the muffin cups. Sprinkle with the remaining 2 tablespoons each oats and coconut.", "Bake the muffins until they spring back when lightly touched and a toothpick inserted in the center comes out with only moist crumbs attached, 30 to 35 minutes. Let stand in the pan for 10 minutes before turning out onto a wire rack. Serve warm or at room temperature.", "Make Ahead Tip: Individually wrap in plastic and store at room temperature for up to 3 days or freeze for up to 3 months. To reheat, remove plastic, wrap in a paper towel and microwave on High for 30 to 60 seconds. Equipment: Muffin tin with 12 (1/2-cup) cups", "Tip: Coconut oil is solid at temperatures below 76°F. To melt solidified coconut oil, remove the lid and place the container in a bowl of very hot water; stir frequently until melted.", "Storage smarts: For long-term freezer storage, wrap your food in a layer of plastic wrap followed by a layer of foil. The plastic will help prevent freezer burn while the foil will help keep off-odors from seeping into the food.", "NUTRITION"]}, {"id": "ejby", "title": "Cornmeal Pancakes Recipe With Cinnamon-Honey Butter", "image": null, "link": "http://www.motherearthnews.com/real-food/cornmeal-pancakes-recipe-zmrz13djzmat.aspx#axzz2oJy61oJP", "ingredients": ["2 cups water", "2 cups freshly ground cornmeal", "1/2 to 1 cup whole milk", "1 1⁄2 tsp salt", "Tiny pinch stevia or pinch brown sugar", "1/2 cup bacon grease, lard, melted butter or vegetable oil"], "directions": ["Using a hand mixer or a stand mixer with the paddle attachment, beat the butter, honey and cinnamon on low speed until fluffy, about 3 minutes. Refrigerate in a lidded bowl for an hour before use if you intend to make into pats.", "The night before making pancakes, bring the water to a boil, then pour it over the cornmeal. Allow the mixture to cool to room temperature, then cover and refrigerate it.", "The next morning, preheat an oven to 200 degrees Fahrenheit, or the “warm” setting. Stir the milk, salt and sweetener into the cornmeal mixture, adding more or less milk as needed to make a thick but pourable batter. Stir in half the grease. Heat a skillet or griddle over medium-high heat. When the pan is hot, coat it with some of the remaining grease. Pour out individual pancakes, about one-quarter cup of batter each. Flip them when you see bubbles on top, after about 3 minutes. Cook until golden brown on both sides, about 5 minutes total. Transfer pancakes to the oven to stay warm. Repeat with remaining batter. Serve topped with cinnamon-honey butter."]}, {"id": "fAQj", "title": "Cranberry Chia Energy Bars (Raw, Vegan, Gluten Free)", "image": "https://images.yumprint.com/p1yumprintgi/giuvHeaNjTrsTznwItjq9hEYfFB7-4EmV0s168aRsrqJo1xMdnBmbpaiUB8zBZTq", "link": "http://www.inspirededibles.ca/2013/03/cranberry-chia-energy-bars-raw-vegan.html", "ingredients": ["1 heaping cup raw almonds or other nut of choice", "1/2 heaping cup dried, pitted dates that have been soaked in boiling water for 2 minutes to soften (substitute dried cherries, figs or prunes for dates)", "1/3 cup just nuts walnut butter or nut butter", "3 heaping Tbsp chia seeds", "1 tsp pure vanilla extract", "1 Tbsp honey or pure maple syrup", "1/4 cup dried cranberry"], "directions": ["Place almonds in blender or food processor and blend for about 30 seconds or until nuts are fairly well ground.  Add drained dates, walnut butter, 2 Tbsp chia seeds, vanilla and honey/maple syrup blending until the entire mixture is well combined.", "The most important part of the recipe: you want to make sure that the mixture is sticky - if it is too dry, your bars will crumble to pieces and you won't be happy.  Add a touch more nut butter to achieve sticky consistency.  The sticky factor will also help adhere cranberries and chia to the surface of the bars. If the mixture is too wet, your batter will never gel into a bar (it will end up like a blob of cookie dough - yummy but a bar it will never be).  If you find yourself in the latter situation, you can add some dry nuts/seeds to the mix.", "Meanwhile, place a piece of wax or parchment paper into a loaf pan (the pan should be in the range of  8\" x 4\") such that it hangs over the sides.", "Remove mixture from blender and press it into the base of the loaf pan using the back of a spoon or other implement to flatten and smooth it down.", "Sprinkle the surface of the mixture with cranberries and remaining Tbsp of chia seeds, pressing down gently with your fingers so that they adhere to the surface.", "Fold both sides of the hanging wax or parchment paper inward, one at a time, over the mixture and gently press down one last time with your hand on top of the paper resting over the mixture.", "Place the pan in the fridge and allow the mixture to gel somewhat into a singular slab for about 1 hour or so.  If you wish to accelerate the process, you can pop the pan in the freezer for 30 minutes or so and return it to the fridge.", "When you're ready to slice the bars, simply remove the pan from the fridge and gently elevate the slab by pulling up on the ends of the wax/parchment.", "Slice the slab into bar shapes or squares as desired.  Store any remaining portions in the fridge.", "Makes about 8 bars or 16 squares , cal 202"]}, {"id": "uKoX", "title": "Creamy Blueberry-Pecan Oatmeal", "image": "https://images.yumprint.com/p1yumprintw4/W4W3ysL5GFHBV5SBrw43mbrNIgRLAZ_OAth3CdnsqhMNtOzWoy1m7dG7eERZDczJ", "link": "http://www.eatingwell.com/recipes/creamy_blueberry_pecan_oatmeal.html", "ingredients": ["1 cup water", "Pinch of salt", "1/2 cup old-fashioned rolled oats", "1/2 cup blueberries, fresh or frozen, thawed", "2 tablespoons nonfat plain Greek yogurt", "1 tablespoon toasted chopped pecans", "2 teaspoons pure maple syrup"], "directions": ["Bring water and salt to a boil in a small saucepan. Stir in oats, reduce heat to medium and cook, stirring occasionally, until most of the liquid is absorbed, about 5 minutes. Remove from heat, cover and let stand 2 to 3 minutes. Top with blueberries, yogurt, pecans and syrup.", "Overnight oats variation: Combine 1/2 cup old-fashioned rolled oats with 1/2 cup water and a pinch of salt in a jar or bowl. Cover and refrigerate overnight. In the morning, add toppings. Eat cold or heat up. Makes about 1 cup.", "Steel-cut oats variation: Bring 1 cup water and a pinch of salt to a boil in a small saucepan. Add 1/3 cup steel-cut oats, reduce heat to a bare simmer, cover and cook, stirring occasionally, until most of the liquid is absorbed, 15 to 20 minutes. Remove from heat and let stand, covered, 2 to 3 minutes. Add toppings. Makes about 1 cup."]}, {"id": "KVD4", "title": "Crispy Bacon Zucchini Fritters", "image": "https://images.yumprint.com/p1yumprintrk/rKufNSRZqnT8KmcYi-YZfNf4AejntR1NDUgKXSkeJCVAwXcZS9Qq4SjQbc9dmriT", "link": "https://www.paleoplan.com/recipes/paleo-appetizers-recipes/bacon-zucchini-fritters/?fbclid=IwAR24ugeTVBwei_LmVKd8JYYDQkkWGG8lvDJFbrJ6Ro8ii51ZgEn3D9Ck2IM", "ingredients": ["3 cup(s) zucchini shredded", "1 teaspoon(s) salt", "1/3 cup(s) bacon chopped", "1/4 cup(s) onion thinly sliced", "1/4 cup(s) almond flour", "1 piece(s) egg", "1 teaspoon(s) garlic powder", "1/2 teaspoon(s) paprika smoked", "salt and pepper to taste"], "directions": ["In a large colander, sprinkle the shredded zucchini with salt. Toss to coat and set aside to sweat for 20 minutes.", "In a large saute pan, cook the bacon over medium heat. Cook for 5 to 7 minutes, until fat, is rendered and the bacon is crispy. Remove the bacon to a paper towel-lined plate. Pour the bacon grease into a heatproof bowl, reserving 1 tablespoon in the pan.", "Transfer the zucchini to a clean towel. Top with another clean towel and press firmly to remove as much excess water as possible.", "In a large mixing bowl, lightly whisk the egg. Add bacon, onion, almond flour, garlic powder, smoked paprika, and salt and pepper to taste. Mix until incorporated.", "Divide the mixture into 6 balls. Flatten each ball into a patty and transfer it to the hot pan. Work in batches if needed, adding the remaining bacon grease before starting the next batch.", "Cook the patties for 7 to 8 minutes, flipping halfway through. Cook until golden brown.", "Remove the patties to a paper towel-lined dish. Serve warm."]}, {"id": "BOud", "title": "Denver Omelet Cups", "image": "https://images.yumprint.com/p1yumprint--/--IdHIjTxPqqnQekM46zJsBXpi1Hif5KuraAElwlSkW00IOvOKNPA-x7HrDdvIYa", "link": "http://www.marthastewart.com/872743/denver-omelet-cups?utm_source=facebook&utm_medium=social&utm_campaign=msl_632645701", "ingredients": ["5 teaspoons unsalted butter", "4 cups frozen hash browns (1 pound), thawed", "6 large eggs, plus 2 large egg whites", "Coarse salt and ground pepper", "1/2 small red onion, diced small", "1 small red bell pepper, stemmed, seeded, and diced small", "4 ounces ham steak", "3 ounces cheddar"], "directions": ["Preheat oven to 475 degrees. Coat 6 nonstick jumbo muffin cups with 1/2 teaspoon butter. In a large microwave-safe bowl, melt 4 teaspoons butter. Add hash browns and 2 egg whites; season with salt and pepper and mix thoroughly. Place 1/2 cup mixture into each muffin cup, firmly pressing into bottom and up side of each cup. Bake 15 minutes.", "Meanwhile, in a small nonstick skillet, melt 1/2 teaspoon butter over medium. Add red onion, bell pepper, and ham steak. Cook, stirring occasionally, until onion is softened, about 7 minutes. Season with salt and pepper. Divide vegetable mixture evenly among cups and top with cheddar. Bake 2 minutes. Remove from oven and crack 1 egg into each cup. Season with salt and pepper and bake until whites are set but yolks are still runny, 8 to 10 minutes. With a small offset spatula, remove cups from pan and serve immediately."]}, {"id": "I9fj", "title": "Dr Lam’s Breakfast Smoothie Recipe", "image": "https://images.yumprint.com/p1yumprintox/oxc7zf7LZulJidqeo8ZsSaV3Di2_jyT2-N6Yv5-Zk8pbKGDab-p_2tz6k68HYaWm", "link": "https://www.drlam.com/blog/dr-lams-breakfast-smoothie-recipe/505/", "ingredients": ["Raw nuts cocktail of almonds, walnuts, pistachios, pecans, hazel, pine nuts, cashew, macadamia. No peanuts. All nuts should be pre-soaked in water the night before. Water is discarded when ready to use.", "1 tbsp flax seed, ground ( use organic flaxseed originating from cold climate countries such as Canada)", "2 tbsp unsweetened coconut flakes", "1/3 avocado", "1 citrus fruit (orange/grapefruit)", "1 fruit (apple, pear, plum, pineapple ). No fruits in the melon family such as watermelon or cantaloupe.", "1/3 cup berries (blueberry or strawberry is good)", "1/4 banana", "1 cup raw milk, rice milk, almond milk or oat milk", "1 cups of filtered water (no distilled water)"], "directions": ["Blend all the items together until liquefy, add water as needed. When you drink the breakfast smoothie, there will be pulps. Yield 4 cups(He says its 1 serving)"]}, {"id": "lpPD", "title": "Dr. Oz's No-Bake Energy Bars", "image": "https://images.yumprint.com/p1yumprintxa/XAwgQBMjYUVdkYOFSsfookTsOnQqOBoGtkaK6I2ydg0s3QlqbHlD-UUBF2QHFqgb", "link": "http://www.doctoroz.com/recipe/dr-oz-no-bake-energy-bars", "ingredients": ["1 cup quick-cook oats", "1/3 cup dried tart cherries", "1/2 cup all-natural peanut butter", "3 tbsp honey", "1 tsp vanilla"], "directions": ["Mix the ingredients together in a bowl.", "Spread the mixture in a pan and refrigerate for 2 hours.", "Slice and enjoy! Return uneaten bars to fridge for storage."]}, {"id": "xahi", "title": "dutch baby pancake recipe", "image": "https://images.yumprint.com/p1yumprint6x/6XVt76t7tGCM2xaLM05eeN1PuGCxKOQ-1ZtBSydg7BOHPr9alqJXVKCzRP-04cMf", "link": "http://nourishedkitchen.com/dutch-baby-pancake-recipe/", "ingredients": ["2 tbsp clarified butter or ghee", "3 medium apples (cored and chopped into 1/4-inch dice)", "6 eggs (beaten)", "1/2 cup milk (not ultrapasteurized)", "1/2 cup whole grain sprouted flour", "no more than 1/4 cup whole unrefined cane sugar", "1/2 tsp ground cinnamon", "1/4 tsp ground cloves", "1/4 tsp unrefined sea salt", "1 lemon (sliced thin, to serve)"], "directions": ["Preheat oven to 425 degrees Fahrenheit.", "Melt clarified butter in a cast iron skillet over a moderate flame, then toss in chopped apples. Fry the apples in butter until they release their perfume and become tender when pierced by a fork, about six to eight minutes.", "Beat eggs and milk together in a separate bowl until smooth and uniform, then beat in sprouted flour, unrefined cane sugar, cinnamon, cloves and sea salt. Continue beating the batter for the Dutch baby until it is smooth with no lumps. The batter will be very liquid.", "Remove the skillet from the heat, pour the Dutch baby batter over the cooked apples and bake in an oven preheated to 425 degrees Fahrenheit for thirty-five to forty-five minutes until puffed and golden.", "Serve the Dutch baby pancake immediately, garnished with sliced lemon."]}, {"id": "eB9U", "title": "Easy Almond Flour Pancakes", "image": "https://images.yumprint.com/p1yumprintsm/sMB1JakcnGxGFGr-CIalPs8WVtbR0Q5B4F0epYfivL2c63gxD7ssM-bP97WVwBst", "link": "http://wellnessmama.com/7924/easy-almond-flour-pancakes/", "ingredients": ["1.5 cups Blanched Almond Flour", "3 eggs", "1 cup of water or milk(or slightly less to desired thickness)", "Optional: spices like cinnamon and nutmeg, vanilla, blueberries or other flavors"], "directions": ["Mix all ingredients in a medium sized bowl using a hand blender or immersion blender until batter is a pourable consistency.", "Make one test pancake to check for desired thickness and texture.", "Cook all pancakes on a griddle or in a large pan for approximately 2-3 minutes per side until bubble form and both sides are golden brown."]}, {"id": "KiaF", "title": "Easy Loaded Baked Omelet Muffins", "image": null, "link": "http://www.eatingwell.com/recipe/265845/easy-loaded-baked-omelet-muffins/?utm_campaign=eatingwell_eatingwell&utm_content=link_recipes&utm_medium=social&utm_term=7EA8BCB0-3DC5-11E9-A477-E4670F4A2151&utm_source=facebook.com&fbclid=IwAR0r02sogrFxxzhybAitUKBvo8X5x59qs88UpeMEspgzSI1zlI8-evgaOEE", "ingredients": ["3 slices bacon, chopped", "2 cups finely chopped broccoli", "4 scallions, sliced8 large eggs", "1 cup shredded Cheddar cheese", "½ cup low-fat milk", "½ teaspoon salt½ teaspoon ground pepper"], "directions": ["Preheat oven to 325°F. Coat a 12-cup muffin tin with cooking spray. Cook bacon in a large skillet over medium heat until crisp, 4 to 5 minutes. Remove with a slotted spoon to a paper towel-lined plate, leaving the bacon fat in the pan. Add broccoli and scallions and cook, stirring, until soft, about 5 minutes. Remove from heat and let cool for 5 minutes. Meanwhile, whisk eggs, cheese, milk, salt and pepper in a large bowl. Stir in the bacon and broccoli mixture. Divide the egg mixture among the prepared muffin cups. Bake until firm to the touch, 25 to 30 minutes. Let stand for 5 minutes before removing from the muffin tin.", "To make ahead: Wrap omelets individually in plastic wrap and refrigerate for up to 3 days or freeze for up to 1 month. To reheat, thaw, if necessary, and remove plastic wrap. Wrap in a paper towel and microwave each omelet on High for 20 to 30 seconds."]}, {"id": "IP5J", "title": "Easy Loaded Baked Omelet Muffins", "image": "https://images.yumprint.com/p1yumprintbj/bJfgYr_Dz4kyYnicoik9Iadp4xxOw_NEemIJV4jeSO_-i7nO8nvmHvZRtpFuxGqI", "link": "http://www.eatingwell.com/recipe/265845/easy-loaded-baked-omelet-muffins/?utm_medium=social&utm_campaign=etg_B2807E4C-7CC8-11E8-856C-43530F4A2151_editorialcontent&utm_content=new&utm_source=facebook", "ingredients": ["3 slices bacon, chopped2 cups finely chopped broccoli4 scallions, sliced8 large eggs", "1 cup shredded Cheddar cheese", "½ cup low-fat milk½ teaspoon salt", "½ teaspoon ground pepper"], "directions": ["Preheat oven to 325°F. Coat a 12-cup muffin tin with cooking spray. Cook bacon in a large skillet over medium heat until crisp, 4 to 5 minutes. Remove with a slotted spoon to a paper towel-lined plate, leaving the bacon fat in the pan. Add broccoli and scallions and cook, stirring, until soft, about 5 minutes. Remove from heat and let cool for 5 minutes. Meanwhile, whisk eggs, cheese, milk, salt and pepper in a large bowl. Stir in the bacon and broccoli mixture. Divide the egg mixture among the prepared muffin cups. Bake until firm to the touch, 25 to 30 minutes. Let stand for 5 minutes before removing from the muffin tin.", "To make ahead: Wrap omelets individually in plastic wrap and refrigerate for up to 3 days or freeze for up to 1 month. To reheat, thaw, if necessary, and remove plastic wrap. Wrap in a paper towel and microwave each omelet on High for 20 to 30 seconds."]}, {"id": "zgGM", "title": "EatingWell Energy Bars", "image": "https://images.yumprint.com/p1yumprint-1/-1LulXfyH3Vg4QioFPJjaQdBDoFZvKp64urlAT0_oxWCzBsxYIE4sPSKd3TPf4Oc", "link": "http://www.eatingwell.com/recipes/eatingwell_energy_bar.html", "ingredients": ["1 cup lightly salted dry-roasted peanuts, coarsely chopped", "1/2 cup crispy brown rice cereal", "1/2 cup old-fashioned or quick-cooking rolled oats", "1/3 cup raw pumpkin seeds or sunflower seeds", "1/4 cup dried blueberries", "6 dried apricots, diced", "3 tablespoons mini chocolate chips", "5 tablespoons brown rice syrup or light corn syrup"], "directions": ["Preheat oven to 325°F. Line the bottom and sides of an 8-inch-square baking pan with foil and coat with cooking spray.", "Combine peanuts, rice cereal, oats, pumpkin (or sunflower) seeds, blueberries, apricots and chocolate chips in a large bowl. Drizzle with syrup and gently stir until thoroughly combined. Spread in the prepared baking pan. Coat another piece of foil with cooking spray and place on the bar mixture, sprayed-side down. Place another pan on top and press firmly to compress the mixture. (Pressing before baking helps the bars hold together after baking.) Remove top pan and foil.", "Bake until just beginning to turn golden at the edges, 20 to 24 minutes (metal pan) or 30 to 35 minutes (glass pan). Cool in the pan on a wire rack for 10 minutes.", "Carefully lift the baked square out of the pan by holding the edges of the foil and place on a cutting board, leaving the foil underneath. Cut in half, then cut each half crosswise into 6 bars. Let cool completely before lifting the bars off the foil."]}, {"id": "nlXH", "title": "Egg Muffins", "image": "https://images.yumprint.com/p1yumprintfk/FKAXHAYSGXk4e09aJSBA3x32t8741resBxv8P72xUM_0limIsgKSLI0_8qenWv2q", "link": "https://www.facebook.com/signaturewedding/photos/a.10150144552818056.341289.256187368055/10153312121478056/?type=1", "ingredients": [], "directions": []}, {"id": "CFaf", "title": "Eggs Benedict with Asparagus on Portobello Mushrooms with Goat Cheese Sauce", "image": "https://images.yumprint.com/p1yumprintnw/NWusNRtc5-LGTsOZ-XvdPbbRRKHD5aS79Wuc8kH_6LFl5q1iqRAyxRem703PbjJH", "link": "http://gourmandeinthekitchen.com/eggs-benedict-with-asparagus-on-portobello-mushrooms-with-goat-cheese-sauce/?utm_content=buffer0d188&utm_medium=social&utm_source=facebook.com&utm_campaign=gitkbuffer", "ingredients": ["2 medium to large Portobello mushroom caps, stems removed", "1/2 a small bunch asparagus, stems trimmed and cut lengthwise if thick", "3 Tablespoons/45ml extra virgin olive oil (divided use)", "1 small garlic clove, finely minced or grated", "Sea salt", "Freshly ground pepper", "2 oz/156g fresh goat cheese", "1 Tablespoon/15ml freshly squeezed lemon juice", "2 large eggs", "1 Tablespoon chopped chives for serving"], "directions": ["Bring a shallow pan of salted water to a gentle simmer.", "Carefully crack each of the eggs into the water. Turn off the heat, cover and let sit for 5 to 7 minutes (depending on how runny you like your yolks), then carefully remove from the pan using a slotted spoon and drain on a clean kitchen towel.", "Top each mushroom with a few asparagus spears and a poached egg. Spoon goat cheese sauce over along with an extra sprinkle of pepper and chopped chives and serve immediately."]}, {"id": "pdzE", "title": "Eggs in Hash Brown Nests", "image": "https://images.yumprint.com/p1yumprintgq/Gq2VXa0_RsCDHmOtfJOczvwi-cOZWPRFpvLI3nHZDHwf5TF0KOqCiWiDrQMd6Ddq", "link": "http://thepioneerwoman.com/cooking/2013/03/eggs-in-hash-brown-nests/", "ingredients": ["6 whole Medium Russet Potatoes (6 To 8)", "Salt And Pepper, to taste", "24 whole Large Eggs", "Non-stick Cooking Spray"], "directions": ["Preheat the oven to 400 degrees.", "Bake the potatoes until almost tender (potatoes should still have a little bite) 45 minutes to 1 hour. Allow to cool, and then peel and grate them. Season well with salt and pepper.", "INCREASE OVEN TEMP TO 425 DEGREES.", "Spray two muffin pans generously with cooking spray. Scoop 3 to 4 tablespoons of grated potato into each muffin cup. Use your fingers to gently press the sides and bottom in each muffin hole to make a nest (don't press the potatoes firmly against the pan; they should sit lightly in the pan.) Spray again (very lightly!) with cooking spray. Bake for 15 to 20 minutes. Watch and make sure they do not burn. (If they seem like they're not browning, kick up the temp to 450.) Remove when the nests are golden brown.", "Allow the nests to cool. Crack an egg into each one. Sprinkle with salt and pepper and bake until the whites are set, about 15 minutes. Don't be concerned if some whites bake differently; no two nests will look alike!", "Remove from the muffin pan with a spoon or fork and serve."]}, {"id": "IaDI", "title": "Flavor Ground Turkey to Taste Like Sausage", "image": "https://images.yumprint.com/p1yumprint-a/-AKZGZM0UCOc_n052PxSQha54_O0nGHvMuriDXQU2jvL3esDZbIQ2TNkTcuvM2Hu", "link": "https://joyfulhomemaking.com/2014/06/flavor-ground-turkey-to-taste-like-sausage.html", "ingredients": ["pinch of ginger", "clove of minced garlic"], "directions": ["Add to ground turkey and mix well."]}, {"id": "Ib5c", "title": "Freezer Breakfast Burritos", "image": "https://images.yumprint.com/p1yumprintgj/GJYJBS4MwuTrkAKYVYJUOPA9flnyKsmN8MWefecHPLhZSYGIDEnDThBWjSIUb9uh", "link": "https://www.gimmesomeoven.com/freezer-breakfast-burritos/", "ingredients": ["12 large eggs", "1/4 cup milk", "salt and pepper", "2 Tablespoons olive oil", "1 medium white onion, peeled and diced (about 2 cups)", "1 pound Yukon gold or red potatoes, diced into 1/4-­inch cubes", "1 large red bell pepper, cored and diced (about 2 cups)", "1 (4-­ounce) can Old El Paso chopped green chiles", "2 teaspoons salt", "1 teaspoon ground cumin", "1 (15-ounce) can black beans, rinsed and drained", "2 (8-­count) packages Old El Paso large (burrito-­sized) flour tortillas", "2 cups (8 ounces) shredded Pepper Jack cheese (or the cheese of your choice)", "(Optional: salsa, for serving)"], "directions": ["Begin by making your scrambled eggs. In a large bowl, whisk together eggs, milk, and a generous pinch of salt and pepper until smooth. Heat a large saute pan that has been misted with cooking spray (or spread with a teaspoon of oil) on the skillet over medium heat, then add the eggs and cook for 4-­6 minutes, stirring occasionally, until they are scrambled and cooked through. Transfer to a separate plate and set aside.", "Meanwhile, while your eggs are cooking, heat the 2 tablespoons of olive oil in a large saute pan over medium­high heat. Add onion and saute for 3 minutes, stirring occasionally, until the onion is mostly cooked and slightly translucent. Add the potatoes and bell peppers, and stir to combine. Continue cooking, stirring frequently, for 7­-10 more minutes, or until the potatoes are tender and cooked through. Stir in the black beans, green chiles, salt and cumin, and continue cooking for 2 more minutes. Then remove the mixture from the heat, and set aside.", "To assemble your burritos, spread out a large sheet of plastic wrap on a flat surface and lay the tortilla squarely in the center of it. Add a large spoonful of scrambled eggs in the center of the tortilla (roughly 1/4 cup), followed by another large spoonful of the potato mixture on top of the eggs, followed by a few tablespoons of shredded cheese on top of the potato mixture. Fold the two opposite sides of the tortilla in so that they meet and overlap, then fold in the two remaining open ends so that the entire burrito is sealed. Wrap it tightly in plastic wrap so that the entire burrito is very tightly sealed. (I find it easiest to fold the plastic wrap over the two short ends, then the longer sides of the burrito.) Then transfer burritos to the freezer, where they will last for up to 3 months.", "To thaw the frozen burritos, remove the plastic wrap and place a burrito on a microwave­safe plate. Microwave for 60-­90 seconds, or until warmed through. Serve plain or with salsa, for dipping.", "If you would like to add sausage, simply brown 1 pound of breakfast sausage (or more, if desired) and add it to the existing burrito filling, portioned evenly between all of the burritos.  Or you could also add bacon or ham or tofu, if you’re looking for different protein.", "If you would like spicier breakfast burritos, saute 1 jalapeno (stem removed, and finely diced) along with the potato mixture."]}, {"id": "qfzv", "title": "Frozen Steel-Cut Oatmeal", "image": "https://images.yumprint.com/p1yumprint7e/7E_n-KogvkeMwe8qmlhFlsp-Kf49opODTY16Qpe_v48SLtRtphK898tSt2GsAVwM", "link": "http://www.popsugar.com/fitness/How-Freeze-Oatmeal-37455779", "ingredients": ["8 cups water", "1/4 teaspoon sea salt", "2 cups steel-cut oats", "7 tablespoons pure maple syrup", "2 1/2 teaspoons cinnamon"], "directions": ["Bring water and salt to a rolling boil. Pour in oats, stir, and reduce heat to simmer, cooking for 30 minutes.", "Turn off heat and stir in the maple syrup and cinnamon. Allow to sit for 10 minutes.", "Lightly grease 21 sections of two 12-cup muffin tins, and pour in the oatmeal.", "Freeze flat for five hours. Remove pan from the freezer and allow to thaw for a few minutes. Using a butterknife, gently pop the oatmeal \"muffins\" out of the pan, seal in a freezer bag, and keep frozen.", "When you're ready to eat, place two to three in a bowl and microwave for 2-3 minutes. Add your favorite toppings and enjoy!", "per oatmeal muffin", "75 calories", "7 cal from fat", "1.7g fiber", "1.5g protein", "15mg sodium"]}, {"id": "rcU0", "title": "Fruit & Nut Grain-Free Bars", "image": "https://images.yumprint.com/p1yumprintsq/SqqIxqdlMW-5Hw-pXoRemiLtNnhvOm8KUOy4rJQ0TcypueMwGSYANhZUwB3xsYC4", "link": "http://thenourishinghome.com/2014/05/mock-kind-fruit-nut-grain-free-bars/", "ingredients": ["1/3 cup pure honey (mild honey such as clover is best)", "2 tablespoons coconut flour", "1 tablespoon *all-natural almond butter", "1/8 teaspoon sea salt", "1 1/3 cups chopped whole *nuts", "1/2 cup chopped dried fruit", "1 cup unsweetened coconut flakes (not finely shredded coconut)"], "directions": ["Preheat oven to 300 degrees. Trim parchment paper to line an 8×8-inch baking dish, leaving parchment paper to hang over two sides of the dish.", "In a large bowl, add the honey, coconut flour, all-natural nut butter and salt. Use a spoon to stir until well combined.", "On a large cutting board, coarse-chop a couple of large handfuls of assorted whole nuts (see note below). Measure out 1 1/3 cup of the chopped nuts and add them to the honey mixture.", "Next, chop the dried fruit and measure out 1/2 cup and add to the honey mixture.", "Finally, measure 1 cup of coconut flakes (not shredded coconut). Place coconut flakes on the cutting board and coarse-chop. Add chopped coconut flakes to honey mixture.", "Using a spoon, mix ingredients together making sure they are thoroughly combined.", "Place the bar mixture into the parchment-lined baking dish. Fold overlapping flaps down and evenly press the top of the bar mixture firmly to pack-in the ingredients so they hold together better after baking. Then, peel back the parchments flaps from top of bars. (Do not trim, as the flaps make it easier to remove the bars after baking.)", "Bake for 20 minutes. Then remove from oven and allow to completely cool on stovetop for approximately one hour (or until bottom of baking dish is room temp).", "Place in fridge to continue cooling. (Do not freeze as it makes it impossible to cut the bars without them crumbling.) Once cold, remove dish from refrigerator. Then, run a knife along the two edges without parchment. Using the parchment paper ends, lift the bars from the baking dish and place on a cutting board.", "Cut into 8 bars and individually wrap and store in the fridge or freezer. Then you can easily take out what you need and place directly into your child’s lunchbox (or yours) – no need to thaw. However, for best results, bars should be kept cold so they do not become over-sticky. Simply include an ice pack, if placing them in a lunchbox, or taking them on the go.", "Notes", "*You can use any combination of nuts, such almonds, cashews, pistachios, peanuts, etc. Just be sure to rough-chop the nuts first and then measure out 1 1/3 cups. (Soaked and dehydrated nuts are best, especially for those with digestive issues.)", "What nuts do I use? The bars in the photo are made by using 1/2 cup rough-chopped almonds, 1/2 cup rough-chopped cashews and 1/3 cup rough-chopped pistachios.", "The same goes for dried fruit – rough-chop any combination of dried fruit you choose and then measure out 1/2 cup. (I use a combination of dried cranberries and dried wild blueberries.)", "And finally, you can use any all-natural nut butter you choose, just be sure it’s simply ground nuts (without additives) for best results and nutrition. I use all-natural creamy almond butter.", "What if I don't care for coconut? You can omit the coconut flakes and replace with additional chopped nuts and dried fruit. Substitute 1/3 to 1/2 cup of chopped nuts and 1/3 cup of chopped dried fruit. (Please note: If you substitute with an additional whole cup of nuts the bars will be too dry). Also, you can omit the coconut flour as well and replace it with ground flaxseed. Enjoy!"]}, {"id": "p9TJ", "title": "Fully Loaded Breakfast Bars", "image": "https://images.yumprint.com/p1yumprint2h/2hB1Uvwh6s3Jl2nq23RqRbrt21LfN7l5cP2NtTCRM43rt0CwtPIlqyjmVQAkWdLn", "link": "https://www.yahoo.com/food/fully-loaded-breakfast-bars-from-my-new-roots-118378772021.html", "ingredients": ["1 tablespoon chia seeds", "3 1⁄4 cups gluten-free rolled oats", "1 teaspoon baking powder", "1 teaspoon baking soda", "2 teaspoons ground cinnamon", "1 teaspoon fine sea salt", "1 1⁄2 cups cooked white beans, such as navy, white kidney, or Great Northern (about one 15-ounce can)", "1⁄4 cup coconut oil, melted", "1⁄4 cup pure maple syrup or raw honey", "Grated zest of 1 organic orange", "1⁄4 cup unsweetened applesauce", "1 teaspoon vanilla extract", "1⁄3 cup chopped unsulfured dried apricots", "1⁄4 cup raisins", "1⁄4 cup pumpkin seeds", "2 cups organic, non-GMO cornflakes (optional)"], "directions": ["Preheat the oven to 350°F. Line a baking sheet with parchment paper and set it aside.", "Combine the chia seeds with 3 tablespoons water in a small bowl, and set aside for 15 minutes to gel.", "Pulse 1 1⁄4 cups of the oats in a food processor until they resemble a very rough flour. Transfer the flour to a large mixing bowl and whisk in the remaining 2 cups oats, baking powder, baking soda, cinnamon, and salt.", "Pulse the beans with the coconut oil in the food processor until the mixture is creamy. Add the maple syrup, orange zest, chia gel, applesauce, and vanilla extract, and pulse until smooth.", "Pour the bean puree over the oats mixture and stir until everything starts to come together. Add the apricots, raisins, pumpkin seeds, and cornflakes and stir to combine—you may need to use your hands at this point.", "Shape the dough into 10 equal balls, and then flatten each one into a patty shape. Transfer them to the prepared baking sheet. Bake for 15 to 18 minutes, until the bars are golden. Let cool completely before enjoying. The bars can be stored in an airtight container at room temperature for 1 week, or in the freezer for up to 1 month."]}, {"id": "u5Yr", "title": "Gingerbread Pancakes", "image": "https://images.yumprint.com/p1yumprintz2/Z2J2gJpqnoGKxn6VlXtDjlo__s0WRKChJPMyRz5m0fev5U23Fn3GSvqnCJR0BnNB", "link": "http://www.eatingwell.com/recipes/whole_wheat_gingerbread_pancakes.html?socsrc=EWfb1129151", "ingredients": ["1 1/2 cups white whole-wheat flour (see Tips)", "2 teaspoons baking powder", "1 1/4 teaspoons pumpkin pie spice", "1 teaspoon ground ginger", "1/4 teaspoon baking soda", "1/4 teaspoon salt", "1 large egg", "1 1/2 cups buttermilk (see Tips)", "1/2 cup unsweetened applesauce", "2 tablespoons canola oil", "2 tablespoons molasses", "1 tablespoon sugar", "1 teaspoon vanilla extract"], "directions": ["Whisk flour, baking powder, pumpkin pie spice, ginger, baking soda and salt in a large bowl. Whisk egg, buttermilk, applesauce, oil, molasses, sugar and vanilla in a medium bowl. Make a well in the center of the dry ingredients, add the wet ingredients and whisk just until combined. Resist overmixing—it will make the pancakes tough.", "Let the batter sit, without stirring, for 10 to 15 minutes. As the batter rests, the baking powder forms bubbles that create fluffy pancakes and the gluten in the flour relaxes to make them more tender.", "Coat a large nonstick skillet or griddle with cooking spray; heat over medium heat. Without stirring the batter, measure out pancakes using about 1/4 cup batter per pancake and pour into the pan (or onto the griddle). Cook until the edges are dry and you see bubbles on the surface, 2 to 4 minutes. Flip and cook until golden brown on the other side, 2 to 4 minutes more. Repeat with the remaining batter, coating the pan with cooking spray and reducing the heat as needed.", "Make Ahead Tip: The mixture of dry ingredients can be stored airtight for up to 1 month; the batter can be refrigerated for up to 1 day; cooked pancakes can be frozen airtight, in a single layer, for up to 3 months. Reheat in the microwave or oven.", "White whole-wheat flour: White whole-wheat flour, made from a special variety of white wheat, is light in color and flavor but has the same nutritional properties as regular whole-wheat flour.", "No buttermilk? You can make “sour milk” as a substitute: mix 1 tablespoon lemon juice or vinegar to 1 cup nonfat milk; let stand for about 10 minutes before using."]}, {"id": "Cq7O", "title": "GLUTEN FREE AND GRAIN FREE CHOCOLATE GRANOLA RECIPE", "image": "https://images.yumprint.com/p1yumprint0d/0Db6we8nK5BdSzyxxYBxME_d6U0WDG_u25QEpvEc_EXPddp-bhPE6k0k-nR-oGNh", "link": "http://gourmandeinthekitchen.com/gluten-free-grain-free-chocolate-granola-recipe/?utm_content=buffer550eb&utm_medium=social&utm_source=facebook.com&utm_campaign=gitkbuffer", "ingredients": ["1 cup/ 112g raw walnuts", "1 cup/112g raw almonds", "Pinch of fine sea salt", "¼ cup/ 60g raw honey", "3 Tablespoons/ 42g unsalted butter", "3 Tablespoons/ 23g raw cacao or natural cocoa powder", "½ tsp vanilla extract", "2 Tablespoons/ 15 g chia seeds", "½ cup/40g unsweetened shredded coconut", "2 oz/60g bittersweet chocolate, coarsely chopped"], "directions": ["Soak walnuts and almonds covered in water with a pinch of salt overnight or for about 8 hours.(Soaking the nuts first removes the enzyme inhibitors, making them easier to digest)", "Preheat oven to 200 degrees F/ 93 degrees C.", "Drain and rinse the nuts and quickly them in a cloth towel.", "Place the nuts in the bowl of a food processor and pulse briefly until just coarsely chopped.", "Gently melt together the butter and honey in a small saucepan over low heat stirring continually to combine.", "Add in the cacao or natural cocoa powder along with a pinch of salt and the vanilla and whisk to blend until well combined.", "Add the chocolate mixture to the food processor and pulse to combine.", "Add the chia seeds and shredded coconut to the bowl and pulse again until everything is about the size of oats.", "Spread chocolate nut mixture evenly on a parchment or silpat lined baking sheet.", "Bake at 200 degrees for about 4 hours, or until dry and crispy.", "Cool on wire rack. Stir in chopped chocolate and store in airtight container."]}, {"id": "BxpZ", "title": "Gourmande Granola", "image": "https://images.yumprint.com/p1yumprintxv/XVwF7xsvDhiiwkHUeMUSKwTF3DE_090cQS_lHggtU2Uq71Iu4ans6YebwynVHpzB", "link": "http://gourmandeinthekitchen.com/granola-recipe/", "ingredients": ["2 ½ cups (½ lb / 225g) gluten-free old-fashioned rolled oats", "2 ½ cups (½ lb / 225g) gluten-free quick cooking oats", "2 cups (60g) rice crisp cereal", "1 tsp ground cinnamon", "1 tsp sea salt", "3/4 cup (180g) fruit puree (such as apple, pear or peach)", "1/2 cup (160g) honey", "3/4 cup (180g) packed light brown sugar or coconut sugar", "2 tablespoons coconut oil", "2 tsp vanilla extract", "2 cups (225g) whole natural almonds (or other nuts of your choice)", "1 cup (120g) raw green pumpkin seeds (or other seeds of your choice)", "2 cups (240g) dried cranberries (or other dried fruit of your choice)"], "directions": ["Preheat the oven to 300 F placing the oven racks in the lower and upper thirds of the oven.", "Line two rimmed baking sheets with parchment paper and set aside.", "In a large bowl, combine the 2 kinds of oats, rice crisp cereal, cinnamon and sea salt. Stir to mix well.", "In a medium bowl, combine the fruit puree, honey, sugar, melted coconut oil and vanilla extract. Stir to mix well.", "Pour the wet ingredients over the dry ones, and mix until completely blended (it’s best to use your hands to get everything evenly coated.)", "Spread the mixture out evenly between the two prepared baking sheets. Squeeze clusters of granola together with slightly damp hands, allowing for space between the clumps in order for air to circulate while baking.", "Place the baking sheets in the oven and bake for 20 minutes. Rotate the baking sheets, flip over the granola with a large spatula and add the almonds and pumpkin seeds. Bake for another 20 to 30 minutes (or more, depending on how thick the layer of granola) until completely dry and just golden brown.", "Let cool on baking sheets, and store in an airtight container when completely cool. Add in the dried cranberries just before serving."]}, {"id": "KCR0", "title": "Grain-Free Almond Flour Zucchini Muffins", "image": "https://images.yumprint.com/p1yumprintox/oxdnUlkX-WJs4TJnT5bLpH6wDYADlFZMVQhjocRmd-MvnDp4Cj8XHr9HTf1bZvL4", "link": "https://hormonesbalance.com/recipes/grain-free-almond-flour-zucchini-muffins/?utm_source=facebook&utm_medium=post&fbclid=IwAR0QVfIgX7M6j1r-hJbsajR_9W6QK37_t67JCc3bsPINiwbKZzqHuMEd14k", "ingredients": ["3 cups almond flour/meal", "2 tsp baking powder", "2 small zucchinis, grated", "a handful of black olives, pitted and chopped roughly", "½ cup coconut oil", "2 large tbsp of ground flaxseed (This is to replace eggs. If you can tolerate eggs, go ahead and use them.)", "1 large tbsp of honey (or stevia if avoiding fructose)", "2 tsp dry oregano", "2 tsp dry tarragon", "½ tsp sea salt"], "directions": ["Preheat the oven to 375F or 190C.", "Combine flaxseed meal + warm water and let it stand for a few minutes to thicken.", "Combine all dry ingredients (flour, salt, baking powder).", "Combine all wet ingredients; zucchini, olives, oil and honey and mix them well.", "Mix dry, wet ingredients, herbs and flaxseed into a liquid mixture; if it’s not liquid enough, add some oil.", "Bake for 25-30 min or till tops are firm."]}, {"id": "usVU", "title": "Granola", "image": null, "link": "http://www.motherearthnews.com/real-food/lets-make-granola-zbcz1412.aspx", "ingredients": ["• 8 cups organic rolled oats", "• 1/2 cup dark brown sugar", "• 1 cup coconut oil (or any vegetable oil will do)", "• 3/4 cup to 1 cup Honey", "• 1 tsp sea salt", "• 1 tbsp cinnamon", "• 1 tbsp vanilla", "• 1 cup nuts of your choice (sometimes I use a combination)", "• 1 cup flaked or chips coconut", "• 1 cup dried fruit of your choice (raisins, dried apples, dried cherries, dried cranberries, whatever)", "• Your choice of sesame seeds, sunflower seeds, chia seeds or roasted pumpkin seeds."], "directions": [". Sometimes I toast the oats in a dry pan in the oven at about 350 degrees. Only takes about 15 minutes, stirring often so it doesn't scorch. It gives the cereal a depth of flavor that you won't have if you skip this. That said, I often skip this step since the finished product gets toasted anyway.", "In a medium saucepan, combine the oil, honey, brown sugar and salt. Bring to a boil and then simmer for about 5 minutes.", "In a large bowl, put the oats, coconut, all the nuts and seeds. Do not add the dried fruits at this time.", "After the liquid mixture has simmered a bit, pour over the dry ingredients and mix well. You want all the stuff coated as well as you possible can.", "When it's well coated, put it into a high sided baking dish and put into a 250 to 300 degree oven. You'll want to toast this about an hour and a half, stopping and stirring it well about every 15-20 minutes.", "After it's all toasted as much as you like, remove from the oven and let cool. Stirring every now and again is a good idea, as it will get crispier as it cools and stick to the pan. Now is the time to add whatever dried fruit you decided on. Mix it in well. Once the entire batch is cooled, pour it into an airtight gallon sized container.", "Eat as is, with either a milk of your choice or yogurt. We don't do much dairy here, so it's usually Rice Dream or Almond Milk. You can even make it a hot cereal for cold winter mornings by either heating the milk or sticking the bowl of granola, milk and all into your microwave (if you have one)for under a minute. It makes a great snack, right out of the jar. This is economical, healthy and good. Even my hardworking Irishman can only eat about a cup of it for breakfast, with rice milk. That is too much for me. It's a good combination of grains, proteins, fruits and fats."]}, {"id": "IjXg", "title": "Granola Bites", "image": "https://images.yumprint.com/p1yumprintxm/xmf4OWxAIVqC9fPz1PQGzf_aQpbS5o7_AJdnERJWwyk0BzknTkP1t_G6djjsejDW", "link": "https://www.motherearthliving.com/food-matters/granola-bites-recipes", "ingredients": ["2 cups old-fashioned rolled oats", "1/2 cup unsweetened shredded coconut", "1/2 cup creamy peanut butter", "4-5 tablespoons honey", "2 tablespoons butter", "1/2 cup of dried fruit and nuts"], "directions": ["Preheat the oven to 350 degrees.", "Spread the oats and coconut on a baking sheet. Place in the oven and toast for 6-8 minutes, stirring occasionally, until lightly browned.", "Meanwhile, combine the peanut butter, honey and butter in a saucepan over medium heat. Cook until combined, stirring continuously so as to prevent scorching.", "Turn heat off. Add the toasted oats and coconut to the peanut butter mixture along with dried fruit and nuts, and stir to combine. Set aside to cool for 5 minutes.", "With a small ice cream scooper (or dampened hands), shape into 12 one-inch balls and refrigerate for at least an hour before serving."]}, {"id": "IArh", "title": "Hard Boiled Eggs", "image": "https://images.yumprint.com/p1yumprintel/eLsTt5aMojJakf21ceD9V2a735JftPz84ETrHnNhHqCsxoTyfN3MNon8CKcKWsKw", "link": "https://www.deliciousmeetshealthy.com/how-to-make-perfect-hard-boiled-eggs/", "ingredients": ["6 large eggs, cold from the fridge", "Cold water"], "directions": ["Storage: Refrigerate any unused hard boiled eggs, still in their shells. They can be stored in the fridge for up to 1 week."]}, {"id": "x5iV", "title": "Healthy Blueberry Bran Muffins", "image": null, "link": "http://www.motherearthliving.com/food-matters/fresh-berries-recipe-healthy-blueberry-bran-muffin.aspx", "ingredients": ["1 cup whole wheat flour", "1 cup all-purpose flour", "2/3 cup packed light brown sugar", "1/3 cup oat bran flour", "1/4 cup flaxseed", "1 1/2 teaspoon baking powder", "1/2 teaspoon baking soda", "1/2 teaspoon ground cinnamon", "1/2 teaspoon salt", "1 cup lowfat plain yogurt", "1/4 cup orange juice", "2 tablespoons canola oil", "2 large eggs", "1 teaspoon vanilla", "1 package (6 ounce) Driscoll’s organic blueberries", "1 package (6 ounce) Driscoll’s organic raspberries"], "directions": ["Preheat oven to 400°F. Place paper liners in 18 muffin cups.", "Whisk whole wheat flour, all-purpose flour, brown sugar, oat bran flour, flaxseed, baking powder, baking soda, cinnamon and salt in a large bowl until blended.", "Stir yogurt, oil, eggs, orange juice and vanilla in a small bowl. Stir yogurt mixture into flour just until moist.", "Fold in blueberries and raspberries until just combined. Divide batter evenly into prepared muffin cups.", "Bake 20 minutes or until toothpick inserted in center comes out clean. Remove muffins from pan and cool completely on wire rack. Makes 18 muffins", "Helpful Tip: Over-stirring muffin batter tends to cause peaked tops. Use a flexible spatula or wooden spoon to combine wet and dry ingredients, and gently fold in the berries to avoid crushing."]}, {"id": "I73I", "title": "Healthy Cinnamon and \"Sugar\" Donuts", "image": "https://images.yumprint.com/p1yumprintmy/MY-aBn8CuyfL5TuR7ixCAklYfTBaot4a9PYIQks2104rFXyXSojTYwXBFYLEkmWJ", "link": "https://www.drlivingood.com/blog/healthy-donuts", "ingredients": ["1 tbsp cinnamon (or to taste)"], "directions": ["Melt the butter and set aside.  Mix the sugar substitute and cinnamon in a bowl. Dip the top of the donut into the butter, just enough to coat the top.  Then dip the top of the donut into the sugar mixture."]}, {"id": "rYGr", "title": "Healthy No-Bake Energy Balls", "image": "https://images.yumprint.com/p1yumprintus/Us_lv96ulD4Nka6vweyoWlEy0zHSN_N4hsG0Ir5CmyYRX7u0fDkTL_KPgMSQEQEP", "link": "http://www.strongandbeyond.com/2015/03/no-bake-energy-balls.html#.VbMLPbN3n4Z", "ingredients": ["1 cup oatmeal", "1 cup unsweetened shredded coconut", "1/2 cup ground or whole flaxseed", "1/2 cup peanut butter", "1/3 cup honey", "1 tsp vanilla", "1/4 cup dried cranberries or raisins (optional)", "1/4 cup dark chocolate chips"], "directions": ["Combine dry ingredients in large mixing bowl", "Combine peanut butter and honey in small bowl and heat in microwave for about 30 seconds.  Stir, then add to dry ingredients and mix well.", "Using your hands, form into ping - pong sized balls.  Keep your hands wet while making balls to keep the mixture from sticking to your hands.  Refrigerate. Enjoy!"]}, {"id": "rruB", "title": "Homemade Instant Maple Oatmeal with Ground Chia Seed", "image": "https://images.yumprint.com/p1yumprintew/ewwWq4vle7hP8QeDXg27cPHnslf0lu7GMs_UKnDsoSNpGWrBmYNYtiYGaTl4_nM0", "link": "http://www.simplebites.net/homemade-instant-maple-oatmeal-with-ground-chia-seed-recipe/", "ingredients": ["4 cups quick oats", "2 Tablespoons ground chia seed", "1/2 cup organic maple flakes", "3 Tablespoons non-fat powdered milk", "1/2 teaspoon ground cinnamon", "pinch of salt"], "directions": ["In a food processor fitted with the blade attachment, combine 2 cups quick oats, ground chia, maple flakes, powdered milk, cinnamon and salt.", "Pulse about 6-8 times, until the oats are very fine, but not powder (do not make flour!)", "Add in the remaining 2 cups of quick oats and pulse 2-3 times to combine.", "Transfer instant oatmeal to a glass jar or airtight container and store in a cool dry place for up to 2 weeks.", "To make instant oatmeal: add 1/2 cup of mix to a bowl or a mug and top with 1 cup of boiling hot water. Stir, cover and let stand for 5 minutes. Stir again, and enjoy.", "Substitutions:", "Maple sugar or raw cane sugar for maple flakes.", "Flax seed for chia seed.", "Eliminate powdered milk for a vegan version."]}, {"id": "uey3", "title": "Honey Pumpkin Whole Wheat Muffins", "image": "https://images.yumprint.com/p1yumprintgl/glIXJgqg7hEkPiEemZYbJGI6Vw6sW1gP3TQDV5sKpTz8wQF9-SRvPW5b5EvYc7Tu", "link": "http://jennabraddock.com/honey-pumpkin-whole-wheat-muffins/", "ingredients": ["¼ cup (1/2 stick) unsalted butter, softened", "¾ cup honey", "1 egg", "1 cup pumpkin puree", "1 ½ cups whole wheat pastry flour", "1 ½ teaspoons baking powder", "1 teaspoon baking soda", "¼ teaspoon salt", "2 teaspoons cinnamon", "½ teaspoon ground ginger", "½ teaspoon ground nutmeg", "¼ cup ground flax seed meal", "½ cup pepitas (pumpkin seeds)"], "directions": ["Preheat oven to 350 degrees. Line muffin tin with muffin liners or spray with non-stick cooking spray.", "Beat butter, with mixer in a medium bowl, until pale in color. Add honey, egg and pumpkin and continue to mix until incorporated. Gradually add flour, baking soda and powder, salt, spices and flax seed meal. Mix just until incorporated.", "Spoon batter into muffin tin, filling each tin about ¾ full. Sprinkle a small amount of pepitas on top of each muffin.", "Bake for 16-18 minutes and a toothpick inserted into the middle of a muffin comes out clean. Cool in pan for a few minutes and then remove muffins and cool on a wire rack."]}, {"id": "GIUt", "title": "How to Make Healthy Pancakes", "image": "https://images.yumprint.com/p1yumprintgi/Gis8kp61VYLXcrx4xrcjfmv5ZeNy0fTuOjQ7yM1PjycaMEN2nDhzLGrrhw5se_H-", "link": "http://www.eatingwell.com/article/276823/how-to-make-healthy-pancakes/?utm_source=facebook&utm_medium=social&utm_campaign=etg_3aaab510-999a-49b1-aad2-e078c9fc1a79_editorialcontent&utm_content=newcontent", "ingredients": [], "directions": ["Coat a large nonstick skillet (or griddle) with cooking spray; heat over medium heat. Without stirring the batter, measure out three 1/4-cup pancakes, pouring the batter into the pan. Cook until the edges are dry and you see bubbles on the surface, 2 to 4 minutes. Flip and cook until golden brown on the other side, 2 to 4 minutes more. Repeat with the remaining batter, coating the pan with cooking spray and reducing the heat as needed.", "Bring 1 cup apple cider and ¼ cup packed brown sugar to a boil in a large saucepan over medium-high heat. Add 3 large (peeled and thinly sliced) apples, bring to a simmer and cook, stirring, until the apples are tender, 10 to 12 minutes. Combine 2 Tbsp. cider and 2 tsp. cornstarch in a small bowl. Stir into the apples and cook, stirring, until thickened. Remove from heat and stir in ½ tsp. vanilla extract. Serves 10: 1/4 cup each"]}, {"id": "CZuJ", "title": "Juicer Pulp Granola Recipe", "image": "https://images.yumprint.com/p1yumprint1u/1UO-QYefkBL_KcWUQg9UeysR2Zqy12H8gq0a5OiX87jpIEC6b5Edwq-FNqSwMm3x", "link": "https://postmodernmess.wordpress.com/2011/05/03/juicer-pulp-granola-recipe/", "ingredients": ["• 2 1/2 cups whole rolled oats", "• 1/2 cup whole wheat flour", "• 1/2 teaspoon baking soda", "• 1/2 teaspoon vanilla", "• 1/4 cup honey", "• 1/4 cup organic brown sugar", "• 1/2 cup of mixed nuts and raisins (from the bulk bin at the grocery store)", "• 2 tablespoons of shredded coconut", "• leftover pulp from juicer (apple, carrot, greens and pear pulp)"], "directions": ["Preheat oven to 325. Grease pan. Combine all ingredients. Mix well. Press mixture into pan. Bake ~20 minutes or until golden brown. Cool 10 min, then cut into bars. Cool completely before serving. Can be wrapped in individual bars for treats/breakfast."]}, {"id": "sKu3", "title": "Lisa's Granola", "image": "https://images.yumprint.com/p1yumprintgy/gyPsfMCkbsezNlRYjE35jL6367DGV6NT986cz9gD0O-C_WLaRQEtY4x11qezIBSs", "link": "http://www.eatingwell.com/recipes/lisas_granola.html", "ingredients": ["6 cups old-fashioned rolled oats", "1 cup chopped almonds", "1 cup chopped walnuts", "1 cup raw, unsalted pepitas (see Tip)", "1/2 cup maple syrup", "6 tablespoons canola oil", "1/4 cup honey", "1 teaspoon ground cinnamon", "1 teaspoon vanilla extract", "1/2 teaspoon salt"], "directions": ["Preheat oven to 325°F. Line a roasting pan or large baking sheet with parchment paper.", "Combine oats, almonds, walnuts and pepitas in a large bowl. Whisk maple syrup, oil, honey, cinnamon, vanilla and salt in a medium bowl until blended. Pour over the oat mixture and toss to coat. Spread the mixture in the prepared pan.", "Bake, stirring every 15 minutes, until lightly and evenly browned and starting to dry out, 50 minutes to 1 hour. Let cool completely in the pan before serving or storing.", "TIPS & NOTES", "Tip: Hulled pumpkin seeds, also known as pepitas, are green seeds with a delicate nutty flavor. They are sold raw, salted and/or roasted, and can be found in the natural-foods section of many super markets and natural-foods stores.", "NUTRITION", "Per 1/2-cup serving: 267 calories; 16 g fat (2 g sat, 7 g mono); 0 mg cholesterol; 28 g carbohydrates; 8 g added sugars; 7 g protein; 4 g fiber; 60 mg sodium; 222 mg potassium.", "Nutrition Bonus: Magnesium (32% daily value)"]}, {"id": "kNzM", "title": "Low Fat Pumpkin Bread With Pepitas", "image": "https://images.yumprint.com/p1yumprint-r/-R41vxQzp7ptBdK91o3LDgp8c_Mkm2fMJ3nHluO9ksJwrJbpF0J_Ud86gQq9g_ie", "link": "http://www.skinnytaste.com/2011/10/low-fat-pumpkin-bread-with-pepitas.html", "ingredients": ["1 1/2 cups pumpkin puree (homemade or canned)", "1 1/4 cups unbleached all purpose flour", "3/4 cup sugar", "1 tsp baking soda", "2 tsp pumpkin pie spice", "1/2 tsp nutmeg", "1/4 tsp cinnamon", "1/4 tsp salt", "2 tbsp vegetable oil", "2 large egg whites", "1 1/2  tsp vanilla extract", "baking spray", "2 tbsp pepitas"], "directions": ["Preheat oven to 350°. Spray a 9 x 5 inch loaf pan with baking spray.", "In a medium bowl, combine flour, sugar, baking soda, pumpkin spice, nutmeg, cinnamon, and salt with a wire whisk. Set aside.", "In a large bowl mix oil, egg whites, pumpkin puree and vanilla; beat at medium speed until thick. Scrape down sides of the bowl.", "Add flour mixture, then blend at low speed until combined. Do not over mix.", "Pour batter into loaf pan, top with pepitas and bake on the center rack for 50-55 minutes, or until a toothpick inserted in the center comes out clean.", "Let the pan cool at least 20 minutes, bread should be room temperature before slicing."]}, {"id": "Kqa-", "title": "Low-Carb Blueberry Muffins", "image": "https://images.yumprint.com/p1yumprintcp/cPHT9VzThqf1Tjyh1cBdbiW9jeb2I2BRYr-M4hhiAfzSrwN4ja-4cSeGF-pUubdi", "link": "http://www.eatingwell.com/recipe/269494/low-carb-blueberry-muffins/", "ingredients": ["1¾ cups almond flour", "¼ cup coconut flour", "1 tablespoon baking powder", "¼ teaspoon baking soda", "¼ teaspoon salt", "1 cup blueberries", "3 large eggs", "½ cup reduced-fat milk", "⅓ cup plus 2 tablespoons light brown sugar", "¼ cup avocado oil", "1½ teaspoons vanilla extract"], "directions": ["Preheat oven to 350°F. Generously coat a muffin tin with cooking spray. Sift almond flour, coconut flour, baking powder, baking soda and salt together in a large bowl. Add blueberries and toss to coat. Whisk eggs, milk, brown sugar, oil and vanilla in a medium bowl. Add to the dry ingredients and stir until combined. Divide the batter among the muffin cups (about ¼ cup batter per cup). Bake the muffins until lightly browned around the edges and a toothpick inserted in the center comes out clean, 20 to 25 minutes. Let cool in the pan on a wire rack for 20 minutes. Run a knife around the edges and remove from the tin to cool completely."]}, {"id": "kJoM", "title": "Make Your Own Pancake Mix", "image": "https://images.yumprint.com/p1yumprintqg/QGKAOJUgJKctIriSrH6ouCYAEoV2Wmjm8qNEC-3cDxkPjVP1RX70916aoojL-OwO", "link": "https://www.yahoo.com/food/take-a-box-of-pancake-mix-off-the-shelf-in-the-101257678581.html", "ingredients": ["¾ cup fresh blueberries and 1 tsp. lemon zest", "1 banana, sliced thin, and ½ cup chopped toasted pecans"], "directions": ["¼ cup shredded sweetened coconut and ¼ cup semisweet chocolate chips", "In a large bowl, whisk together flour, baking soda, baking powder, sugar and salt.  Place in an airtight container until ready to use.", "In another bowl, whisk together buttermilk, water, eggs, butter and vanilla. Add dry pancake mix to the buttermilk mixture and gently whisk until combined. Don’t try to make the batter smooth; small lumps are OK in the batter. Let batter sit for 3 to 5 minutes before cooking. Heat griddle on medium-high. Melt ½ tablespoon of butter on pan. Add ½ cup of batter onto griddle for each pancake. Lift one end of pancake to check for doneness, then flip. Only flip pancake once and never push pancake down with spatula."]}, {"id": "CpYF", "title": "Maple-Nut Granola", "image": "https://images.yumprint.com/p1yumprintti/TiIKhfnNqDIdq9NvmcY-TUyrARrH7HArbcuWV61U0B6Ipd2kTiQsPyWAh_xsMaZh", "link": "http://www.eatingwell.com/recipe/249791/maple-nut-granola/?utm_source=facebook&utm_medium=social&utm_campaign=etg_716775348_ew_besteverholidays", "ingredients": ["5 cups old-fashioned rolled oats1 cup unsweetened coconut chips, (see Ingredient Note) or flakes1/2 cup sliced almonds1/2 cup coarsely chopped pecans1/2 cup light brown sugar1/3 cup unsalted pumpkin seeds1/3 cup unsalted sunflower seeds1/2 cup pure maple syrup1/2 cup water1/4 cup canola oil1/2 cup dried cranberries1/2 cup raisins"], "directions": ["Preheat oven to 275°F. Combine oats, coconut, almonds, pecans, brown sugar, pumpkin seeds and sunflower seeds in a large bowl. Combine syrup, water and oil in a medium bowl or large measuring cup and pour over the oat mixture; stir until well combined. Spread the mixture into a large (12-by-15-inch) roasting pan or large rimmed baking sheet. Bake for 45 minutes. Remove from the oven, stir, and continue baking until golden brown and beginning to crisp, about 45 minutes more. Stir in cranberries and raisins. Let cool completely before storing."]}, {"id": "JmWi", "title": "Mini Applesauce Carrot Cake Muffins", "image": "https://images.yumprint.com/p1yumprintzi/zIIRje448xgVPgNx9osn2ZR1Fr8t8fWctgM4ioyLX4cJRioCeK0cOXvQyO4aiyXh", "link": "https://gourmandeinthekitchen.com/mini-applesauce-carrot-cake-muffins-gluten-free-paleo/", "ingredients": ["¼ cup/60g roasted unsweetened cashew butter (smooth)", "¼ cup/60g roasted unsweetened almond butter (smooth)", "1/3 cup/80g unsweetened applesauce", "1 teaspoon/5ml fresh lemon juice", "2 Tablespoons/30ml date syrup", "1 teaspoon vanilla extract", "½ teaspoon ground cinnamon", "1/8th teaspoon fresh grated nutmeg", "Pinch of sea salt", "½ teaspoon baking powder (use cornstarch-free for paleo)", "1 large egg", "2 small carrots/ about 80g shredded on a medium hole grater", "¼ cup/40g raisins", "¼ cup/30g walnuts (or use a mix of walnuts and pecans), chopped (plus more to top)", "3 Tablespoons/22g medium shred unsweetened coconut (also known as flaked coconut, plus more to top)"], "directions": ["Preheat the oven to 350°. Line a 24 count mini-muffin or 12 count regular muffin pan with liners.", "In a large bowl whisk together cashew butter, almond butter, applesauce, lemon juice, date syrup, vanilla extract, cinnamon, nutmeg, salt, baking powder and eggs until smooth. Stir in shredded carrots, raisins, nuts and coconut.", "Scoop the batter into the prepared pan using a small cookie dough scoop. Sprinkle tops with a few extra chopped nuts and coconut shreds. Bake until puffed and a cake tester inserted in the center comes out clean (about 15 minutes for mini muffins and about 20 minutes for regular muffins). Transfer to a rack and let cool to room temperature"]}, {"id": "Cdby", "title": "Mini Mushroom-&-Sausage Quiches", "image": "https://images.yumprint.com/p1yumprintc6/C6XachwycH3oaPvgEoFaqe17EPuRTnLfyOV_eJMMrhXEnSE0zDL_pbt38DZcIyi4", "link": "http://www.eatingwell.com/recipe/248931/mini-mushroom--sausage-quiches/?utm_source=facebook&utm_medium=social&utm_campaign=etg_687986580_ew_besteverholidays", "ingredients": ["8 ounces turkey breakfast sausage, removed from casing and crumbled into small pieces", "1 teaspoon extra-virgin olive oil", "8 ounces mushrooms, sliced1/4 cup sliced scallions1/4 cup shredded Swiss cheese1 teaspoon freshly ground pepper5 eggs", "3 egg whites", "1 cup 1% milk"], "directions": ["Position rack in center of oven; preheat to 325°F. Coat a nonstick muffin tin generously with cooking spray (see Tip).", "Heat a large nonstick skillet over medium-high heat. Add sausage and cook until golden brown, 6 to 8 minutes. Transfer to a bowl to cool. Add oil to the pan. Add mushrooms and cook, stirring often, until golden brown, 5 to 7 minutes. Transfer mushrooms to the bowl with the sausage. Let cool for 5 minutes. Stir in scallions, cheese and pepper.", "Whisk eggs, egg whites and milk in a medium bowl. Divide the egg mixture evenly among the prepared muffin cups. Sprinkle a heaping tablespoon of the sausage mixture into each cup.", "", "Bake until the tops are just beginning to brown, 25 minutes. Let cool on a wire rack for 5 minutes. Place a rack on top of the pan, flip it over and turn the quiches out onto the rack. Turn upright and let cool completely.", "Make Ahead Tip: Individually wrap in plastic and refrigerate for up to 3 days or freeze for up to 1 month. To reheat, remove plastic, wrap in a paper towel and microwave on High for 30 to 60 seconds.", "Tip: A good-quality nonstick muffin tin works best for this recipe. If you don't have one, line a regular muffin tin with foil baking cups.", "Storage smarts: For long-term freezer storage, wrap your food in a layer of plastic wrap followed by a layer of foil. The plastic will help prevent freezer burn while the foil will help keep off-odors from seeping into the food."]}, {"id": "shQp", "title": "Monkey Muffins", "image": "https://images.yumprint.com/p1yumprint7w/7wXfyCLHs49gNfum-M7FGZ-DSuEvqjAbv1LchEFGui4zFn18INIi6VBVShMETuR2", "link": "http://www.chef-in-training.com/2011/09/monkey-muffins/", "ingredients": ["2 cans Grands Homestyle biscuits (you can use regular bread dough too but I went for the extremely fast and easy route)", "butter (about 1 to 1½ sticks)", "cinnamon", "sugar", "1 can sweetened condensed milk"], "directions": ["Preheat oven to 375 degrees.", "Add ½ teaspoon butter to the bottom of each muffin cup.", "Sprinkle 1 teaspoon sugar and ¼ teaspoon cinnamon to each muffin cup (no need to mix them together just dump measured amount in separately for even quicker prep time!)", "Cut biscuit dough into quarters. Roll each dough quarter into a ball and place three balls into each muffin tin cup containing butter, sugar, and cinnamon.", "Top muffins with another ½ teaspoon butter. Sprinkle about ⅓ teaspoon sugar and a dash of cinnamon.", "Bake for 12-15 minutes, or until golden and bubbly.", "Remove from oven and immediately drizzle sweetened condensed milk over the top of each one. Allow rolls to cool completely before serving (if you can...I found it pretty hard! They look, smell and taste AMAZING!)"]}, {"id": "durd", "title": "Muesli Cereal", "image": "https://images.yumprint.com/p1yumprintdy/DYq_ipctXMdyRNPbiBMOfLVFYuPduu_kLEJGxmBeL2fliv92RN7QvN9jWqQXZjS2", "link": "http://www.wholeliving.com/216354/muesli-cereal", "ingredients": ["1/4 cup rolled oats", "1/4 cup mixed dried fruit, coarsely chopped", "1/2 cup unsweetened almond milk", "1 Tbsp chopped nuts, such as almond, pistachio, or walnut", "1 Tbsp toasted seeds, such as pumpkin, sesame, or sunflower"], "directions": ["Soak oats and dried fruit in 2/3 cup water in the refrigerator overnight.", "Drain water. To serve, add almond milk and top with nuts and seeds."]}, {"id": "IhNS", "title": "Muffin-Tin Quiches with Smoked Cheddar & Potato", "image": "https://images.yumprint.com/p1yumprintal/ALyiQEUif5PjY80XTCEfg4RyN2XEM5sRUvCdQzk0I9bvR0Xjm2FjKtoKM4kEvTaO", "link": "http://www.eatingwell.com/recipe/256433/muffin-tin-quiches-with-smoked-cheddar-potato/", "ingredients": ["2 tablespoons extra-virgin olive oil1½ cups finely diced red-skinned potatoes1 cup diced red onion¾ teaspoon salt, divided", "8 large eggs1 cup shredded smoked Cheddar cheese½ cup low-fat milk½ teaspoon ground black pepper", "1½ cups chopped fresh spinach"], "directions": ["Preheat oven to 325°F. Coat a 12-cup muffin tin with cooking spray. Heat oil in a large skillet over medium heat. Add potatoes, onion and ¼ teaspoon salt and cook, stirring, until the potatoes are just cooked through, about 5 minutes. Remove from heat and let cool 5 minutes. Whisk eggs, cheese, milk, pepper and the remaining ½ teaspoon salt in a large bowl. Stir in spinach and the potato mixture. Divide the quiche mixture among the prepared muffin cups. Bake until firm to the touch, about 25 minutes. Let stand 5 minutes before removing from the tin."]}, {"id": "Dif4", "title": "Muffin-Tin Quiches with Smoked Cheddar & Potato", "image": "https://images.yumprint.com/p1yumprintjv/jVqN9YhzXxap4aKmT8ofVTi3jVT081nhR7sMBUHC1_pFr1w-KALHQreZ-d1AboCI", "link": "http://www.eatingwell.com/recipe/256433/muffin-tin-quiches-with-smoked-cheddar-potato/?utm_source=facebook&utm_medium=social&utm_campaign=etg_795645716_ew_wakeupright", "ingredients": ["2 tablespoons extra-virgin olive oil 1½ cups finely diced red-skinned potatoes 1 cup diced red onion ¾ teaspoon salt, divided 8 large eggs 1 cup shredded smoked Cheddar cheese ½ cup low-fat milk ½ teaspoon ground black pepper 1½ cups chopped fresh spinach"], "directions": ["Preheat oven to 325°F. Coat a 12-cup muffin tin with cooking spray. Heat oil in a large skillet over medium heat. Add potatoes, onion and ¼ teaspoon salt and cook, stirring, until the potatoes are just cooked through, about 5 minutes. Remove from heat and let cool 5 minutes. Whisk eggs, cheese, milk, pepper and the remaining ½ teaspoon salt in a large bowl. Stir in spinach and the potato mixture. Divide the quiche mixture among the prepared muffin cups. Bake until firm to the touch, about 25 minutes. Let stand 5 minutes before removing from the tin."]}, {"id": "GPeV", "title": "Muffin-Tin Quiches with Smoked Cheddar & Potato", "image": "https://images.yumprint.com/p1yumprintal/ALyiQEUif5PjY80XTCEfg4RyN2XEM5sRUvCdQzk0I9bvR0Xjm2FjKtoKM4kEvTaO", "link": "http://www.eatingwell.com/recipe/256433/muffin-tin-quiches-with-smoked-cheddar-potato/", "ingredients": ["2 tablespoons extra-virgin olive oil", "1½ cups finely diced red-skinned potatoes", "1 cup diced red onion", "¾ teaspoon salt, divided", "8 large eggs", "1 cup shredded smoked Cheddar cheese", "½ cup low-fat milk", "½ teaspoon ground black pepper", "1½ cups chopped fresh spinach"], "directions": ["Preheat oven to 325°F. Coat a 12-cup muffin tin with cooking spray. Heat oil in a large skillet over medium heat. Add potatoes, onion and ¼ teaspoon salt and cook, stirring, until the potatoes are just cooked through, about 5 minutes. Remove from heat and let cool 5 minutes. Whisk eggs, cheese, milk, pepper and the remaining ½ teaspoon salt in a large bowl. Stir in spinach and the potato mixture. Divide the quiche mixture among the prepared muffin cups. Bake until firm to the touch, about 25 minutes. Let stand 5 minutes before removing from the tin.To make ahead: Individually wrap in plastic and refrigerate for up to 3 days or freeze for up to 1 month. To reheat, remove plastic, wrap in a paper towel and microwave on High for 30 to 60 seconds.", "Equipment: Muffin tin with 12 ( ½-cup) cups"]}, {"id": "CN8z", "title": "Muffin-Tin Quiches with Smoked Cheddar & Potato", "image": "https://images.yumprint.com/p1yumprintjv/jVqN9YhzXxap4aKmT8ofVTi3jVT081nhR7sMBUHC1_pFr1w-KALHQreZ-d1AboCI", "link": "http://www.eatingwell.com/recipe/256433/muffin-tin-quiches-with-smoked-cheddar-potato/", "ingredients": ["2 tablespoons extra-virgin olive oil 1½ cups finely diced red-skinned potatoes 1 cup diced red onion ¾ teaspoon salt, divided 8 large eggs 1 cup shredded smoked Cheddar cheese ½ cup low-fat milk ½ teaspoon ground black pepper 1½ cups chopped fresh spinach"], "directions": ["Preheat oven to 325°F. Coat a 12-cup muffin tin with cooking spray. Heat oil in a large skillet over medium heat. Add potatoes, onion and ¼ teaspoon salt and cook, stirring, until the potatoes are just cooked through, about 5 minutes. Remove from heat and let cool 5 minutes. Whisk eggs, cheese, milk, pepper and the remaining ½ teaspoon salt in a large bowl. Stir in spinach and the potato mixture. Divide the quiche mixture among the prepared muffin cups. Bake until firm to the touch, about 25 minutes. Let stand 5 minutes before removing from the tin."]}, {"id": "CB3G", "title": "Muffin-Tin Quiches with Smoked Cheddar & Potato", "image": "https://images.yumprint.com/p1yumprintjv/jVqN9YhzXxap4aKmT8ofVTi3jVT081nhR7sMBUHC1_pFr1w-KALHQreZ-d1AboCI", "link": "http://www.eatingwell.com/recipe/256433/muffin-tin-quiches-with-smoked-cheddar-potato/?utm_source=facebook&utm_medium=social&utm_campaign=etg_749355386_ew_besteverholidays", "ingredients": ["2 tablespoons extra-virgin olive oil 1½ cups finely diced red-skinned potatoes 1 cup diced red onion ¾ teaspoon salt, divided 8 large eggs 1 cup shredded smoked Cheddar cheese ½ cup low-fat milk ½ teaspoon ground black pepper 1½ cups chopped fresh spinach"], "directions": ["Preheat oven to 325°F. Coat a 12-cup muffin tin with cooking spray. Heat oil in a large skillet over medium heat. Add potatoes, onion and ¼ teaspoon salt and cook, stirring, until the potatoes are just cooked through, about 5 minutes. Remove from heat and let cool 5 minutes. Whisk eggs, cheese, milk, pepper and the remaining ½ teaspoon salt in a large bowl. Stir in spinach and the potato mixture. Divide the quiche mixture among the prepared muffin cups. Bake until firm to the touch, about 25 minutes. Let stand 5 minutes before removing from the tin."]}, {"id": "k4TG", "title": "Mustard Green-and-Sweet Onion Frittata", "image": "https://images.yumprint.com/p1yumprintsa/sAk2ykJKwBycsCiGdMeaAWwG_Z9mat9h8uz3nk9953qTNQFtobZ6iSZswEj76he7", "link": "http://www.foodandwine.com/recipes/mustard-green-and-sweet-onion-frittata", "ingredients": ["3 tablespoons extra-virgin olive oil", "1 large sweet onion, diced", "1 1/2 pounds mustard greens, stems discarded and leaves coarsely chopped", "16 large eggs, beaten", "Kosher salt and freshly ground pepper", "1/3 cup grated Parmigiano-Reggiano"], "directions": ["Preheat the oven to 350°. In a large ovenproof nonstick skillet, heat 1 tablespoon of the oil. Add the onion and cook over moderately high heat until golden brown, 10 minutes. Add the greens and cook until wilted.", "Season the eggs with salt and pepper and whisk in the remaining 2 tablespoons of oil. Pour the eggs into the skillet and cook over moderate heat until the bottom and sides begin to set. Lift the sides of the frittata to allow the uncooked eggs to seep under. Continue cooking until the bottom is set and the top is still runny, 3 minutes. Sprinkle the Parmigiano-Reggiano on top.", "Transfer the skillet to the oven and bake for about 8 minutes, until the center of the frittata is set. Slide the frittata onto a cutting board. Cut into 1 1/2-inch squares and serve hot, warm or at room temperature."]}, {"id": "kNAI", "title": "Nut & Seed Banana Oat Snack Bars", "image": "https://images.yumprint.com/p1yumprintui/UiAi8NNjGGiiPVtFMcL3E9hzG_lcuSGC4FO9RAXZv1Lu9wvQ4vw1pOBIo9fVY0YE", "link": "http://www.eatyrgreens.com/nut-seed-banana-oat-snack-bars/", "ingredients": ["1 cup rolled oats", "1/2 cup shelled sunflower seeds", "1/2 cup pepitas (shelled pumpkin seeds)", "1/4 cup almonds, roughly chopped", "1/4 cup walnuts, roughly chopped", "1/4 cup dried cherries or pitted dates, chopped", "3 small ripe bananas", "1 teaspoon vanilla", "1/2 teaspoon salt", "1/2 teaspoon cinnamon", "Butter or other oil, for greasing pan"], "directions": ["Preheat oven to 350°F. Grease the bottom and sides of a 9-by-9-inch square pan.", "In a large bowl, combine the oats, seeds, nuts and dried fruit. Place the bananas, vanilla, salt and cinnamon in the bowl of a small food processor or blender and process until smooth. (You will have about 1 1/4 cup of puree.) Pour the banana puree over the oat mixture and stir until all the dry ingredients are evenly moist. Press mixture evenly into the bottom of the pan.", "Bake for 30 minutes, until firm and lightly browned on the edges. Let cool completely and cut into 6 bars. You can store them in an airtight container for a couple days, but I recommend wrapping them individually and freezing them in a freezer-safe container for up to 3 months."]}, {"id": "Cctv", "title": "Oatmeal Chocolate Chip Pancakes", "image": "https://images.yumprint.com/p1yumprintlm/LMtmIc8W3uRzFglFbgZaaZ2Bg_RU5JTlHc8Vqq0zMVjzxndHUYRdeEGsozMuQzO3", "link": "http://spoonuniversity.com/recipe/how-to-make-oatmeal-chocolate-chip-pancakes-better-than-basic?utm_source=facebook&utm_medium=social&utm_content=fb-health&utm_campaign=spoon-video-social", "ingredients": ["2 cups oat flour ground up oats", "2 teaspoons baking powder", "1/4 teaspoon salt", "1/2 teaspoon cinnamon", "3/4 cup plain Greek yogurt", "1 cup unsweetened almond milk", "1 egg", "1 teaspoon vanilla extract", "1 tablespoon maple syrup", "1/3 cup chocolate chips (or maybe blueberries?)"], "directions": ["In a bowl, mix together the oat flour, baking powder, salt and cinnamon."]}, {"id": "wlxu", "title": "Oatmeal-Almond Protein Pancakes", "image": "https://images.yumprint.com/p1yumprint5g/5GVCtW6RJW6z9C0hV7WASfK6Yt3YZUGY0DPMejwTJ8zy-5p9GKmDXxPiQq0dKKv1", "link": "http://www.eatingwell.com/recipes/oatmeal_almond_protein_pancakes.html", "ingredients": ["1/2 cup unflavored protein powder", "1/2 cup almond meal", "1/2 cup oat flour (see Tip)", "1 tablespoon sugar", "C & H White Sugar Granulated", "$1.99", "Thru 01/26", "1 teaspoon ground cinnamon", "1 teaspoon baking powder", "1/4 teaspoon baking soda", "1/4 teaspoon salt", "2 large eggs", "3/4 cup buttermilk", "2 tablespoons canola oil", "2 teaspoons vanilla extract"], "directions": ["Combine protein powder, almond meal, oat flour, sugar, cinnamon, baking powder, baking soda and salt in a blender; pulse until fully mixed. Add eggs, buttermilk (reduce to 1/2 cup if using whey protein), oil and vanilla; pulse, stopping to scrape down the sides as needed, until combined. Let stand for 15 minutes.", "Coat a large nonstick skillet or griddle with cooking spray; heat over medium-high heat.", "Make about 3 pancakes at a time, using 1/4 cup batter per pancake; reduce the heat to medium. Cook until the edges are dry, 1 to 3 minutes. Flip and cook until golden brown on the other side, 1 to 3 minutes more. Repeat with the remaining batter, using more cooking spray and reducing the heat as needed. Serve warm.", "TIPS & NOTES", "Oat flour is made from finely milled whole oats. It’s a good source of dietary fiber and whole grains. Try it in place of a portion of other flour in recipes like pancakes, quick breads and muffins. Look for it with other whole-grain flours or near gluten-free flours. Or make your own, grind old-fashioned rolled oats in a blender or food processor until they are the texture of flour."]}, {"id": "m43z", "title": "Overnight Egg & Cheese Strata", "image": "https://images.yumprint.com/p1yumprintic/icXBccNsEV02KYvrBVPnSzq9uXTZ1esDyd1II3EzLZ-pNrDOltT4RkRIXchWvlUG", "link": "http://www.epicurious.com/recipes/food/views/Overnight-Egg-Cheese-Strata-395529", "ingredients": ["Butter, for greasing the baking dish", "4 thick slices hearty whole-wheat/wholemeal or multigrain artisan bread {about 4 1/2 oz/130 g}", "2 large eggs, lightly beaten", "1 cup/240 ml whole milk", "8 oz/225 g grated Fontina cheese {about 1 cup}", "Sea salt", "Freshly ground black pepper", "6 to 8 asparagus stalks", "4 thin slices mortadella or prosciutto {optional}", "1 tbsp finely snipped chives"], "directions": ["Preheat the oven to 350°F/180°C/gas 4. Butter a small 4-cup/960-ml ovenproof baking dish.", "Remove the crusts from the bread and cut into slices; you should have about 3 cups. Lay the slices across the baking dish, slightly overlapping and allowing some edges to hang over the sides.", "Whisk together the eggs and milk in a large bowl. Stir in half of the cheese and season with salt and pepper. Pour three-fourths of the egg mixture over the bread cubes.", "Peel the bottom half of the asparagus and break off the stem ends where it snaps naturally. Discard any woody stems.", "Layer the mortadella over the bread and top with asparagus spears. Pour the remaining egg mixture over the top and finish with the remaining cheese. At this point, you can bake the strata immediately, or cover with plastic wrap/cling film and refrigerate overnight for a surprise breakfast in bed.", "Bake the strata until just set, 30 to 35 minutes. Let cool slightly, sprinkle the top with chopped chives, and serve in the baking dish.", "S. Double this recipe easily for a large crowd, and watch it disappear at every New Year's Brunch or potluck. Bake for 1 hour in a 9-by-13-in/23-by-33 cm pan."]}, {"id": "uKoT", "title": "Overnight Oatmeal", "image": "https://images.yumprint.com/p1yumprintcf/cfgK0viihFcqVkiwRwuUF4RTcavX6tMZrPOiAAmOSDiDxehm2Ix32yqz6f98LXjK", "link": "http://www.eatingwell.com/recipes/overnight_oatmeal.html", "ingredients": ["8 cups water", "2 cups steel-cut oats, (see Ingredient note)", "1/3 cup dried cranberries", "1/3 cup dried apricots, chopped", "1/4 teaspoon salt, or to taste"], "directions": ["Combine water, oats, dried cranberries, dried apricots and salt in a 5- or 6-quart slow cooker. Turn heat to low. Put the lid on and cook until the oats are tender and the porridge is creamy, 7 to 8 hours.", "Stovetop Variation Halve the above recipe to accommodate the size of most double boilers: Combine 4 cups water, 1 cup steel-cut oats, 3 tablespoons dried cranberries, 3 tablespoons dried apricots and 1/8 teaspoon salt in the top of a double boiler. Cover and cook over boiling water for about 1 1/2 hours, checking the water level in the bottom of the double boiler from time to time."]}, {"id": "yj9u", "title": "overnight oats", "image": "https://images.yumprint.com/p1yumprint-h/-HaRgZMD6WF77cHZpMv6v4GtbnsOIc8PyVV0sf-8wABAfjpE9qa2YMVdQEuMHj3N", "link": "http://www.epicurious.com/expert-advice/how-make-overnight-oats-jar-recipe-article?BA+Facebook=social_cp_facebook_ba&mbid=social_facebook", "ingredients": ["1 part oats + 2 parts milk + 1/4 part seeds"], "directions": ["Add a pinch of salt no matter what, and then decide how you want your overnight oats to taste. Add a pinch of cinnamon or cardamom or a splash of vanilla if you like. Or stir in some cocoa powder or matcha powder. Then choose your sweetener: maple syrup, honey, agave, date sugar, brown sugar, or white sugar, and stir in a small spoonful. You don't need to add sweetener at all though—I often just add a bit of vanilla and cinnamon without any sugar and then eat it with fresh fruit on top. A small squeeze of lemon juice can help give your overnight oats a nice little tang, and balance out the sweetness. Stir it all together, taste, and adjust the flavoring until it's right where you want it."]}, {"id": "IVYa", "title": "Overnight Oats & Chia Seed Porridge", "image": "https://images.yumprint.com/p1yumprintgk/gktWVQhAMfH78nsgyQJ118UA4DkYPGhZKX62vsmXtT6SPU36HM8FbNjrxt1uOtW3", "link": "https://gutbliss.com/2018/07/09/overnight-oats-and-chia-seed-porridge/", "ingredients": ["½ cup gluten-free rolled oats", "1 tablespoon chia seeds", "½ cup DIY Nut Milk", "½ teaspoon ground cinnamon", "½ teaspoon pure vanilla extract (omit if nut milk is flavored)", "1 teaspoon Manuka honey", "TOPPINGS: fresh fruit (sliced bananas, apples, pears, chopped peaches, or fresh berries), nuts, shredded coconut, seeds"], "directions": ["PLACE THE OATS, chia seeds, nut milk, cinnamon, vanilla, and maple syrup in a mason jar. Mix well. Place in refrigerator overnight. In the morning, stir the mixture and add any desired toppings.", "VARIATION: For a thicker and more filling meal, mash together 1 tablespoon almond butter and ó banana. Place in the mason jar with the oat mixture to soak overnight."]}, {"id": "I84-", "title": "Overnight Oats with Matcha Recipe", "image": "https://images.yumprint.com/p1yumprintec/EC9wIZM8FIe_BsTdwgyZDQExWxPs6yANElPyM5mooRftSRKh36USY95JjbXRZqzI", "link": "https://www.motherearthnews.com/real-food/seasonal-recipes/overnight-oats-matcha-zerz1807zcoo", "ingredients": ["1 apple, peeled, cored, and chopped", "1 tsp pumpkin seeds", "Handful of mixed nuts"], "directions": ["If you have time make this in advance — ideally the night before you wish to eat it.", "Place the oats and chia seeds in a bowl or container.", "In a separate bowl or jar, add 1 tbsp of the almond milk to the matcha powder and whisk to make a smooth paste. Top with the rest of the milk and mix well.", "Pour the matcha milk mixture over the oats, then stir in the cinnamon and honey. Cover and refrigerate overnight.", "When ready to eat, transfer the oats to two bowls and top with the chopped apple, pumpkin seeds, and nuts."]}, {"id": "x8dW", "title": "Paleo Maple Granola", "image": "https://images.yumprint.com/p1yumprinte7/e7nMAdJW6pu87_94_whYwBJ0x-Z9yzUdYw1QIwsH5iQmgvulFyjC9yEETCwvMG_8", "link": "http://www.mommypotamus.com/paleo-maple-granola-recipe/", "ingredients": ["1 cup almond slivers", "1 cup large coconut flakes", "1 cup sunflower seeds", "1 cup chopped pecans", "6 tablespoons maple syrup", "1 tablespoon vanilla extract", "1 1⁄2 teaspoons ground cinnamon", "1⁄2 teaspoon sea salt"], "directions": ["Preheat the oven to 325° F.  Line a large baking sheet with parchment paper.", "In a medium-sized bowl, place the almond slivers, coconut flakes, sunflower seeds and pecans.", "In a separate small bowl, mix together the maple syrup, vanilla, cinnamon and salt.", "Pour the sauce over the bowl of nuts and mix thoroughly.", "Press the mixture into the pan.  It will resemble a large bar recipe.  Bake for 40 minutes.", "Allow the granola to cool.  Once cooled, break it into pieces and add chocolate chips and/or dried fruit if desired.", "Yield: 4 cups"]}, {"id": "KUCO", "title": "Paleo Pumpkin and Carrot Muffins", "image": "https://images.yumprint.com/p1yumprint2n/2Nivs712qhIAnpJxbtfYjq1mR8o1ZYF6JCuFGld5iLbtilLe3CSPkiy3o3cwXID6", "link": "https://nomnompaleo.com/post/101828602863/paleo-pumpkin-and-carrot-muffins", "ingredients": ["3 large eggs at room temperature", "4 medium carrots, peeled", "1½ cups (144 grams) almond flour, spooned and leveled", "1½ teaspoons five spice powder (if you must, you can substitute pumpkin spice blend)", "1 teaspoons baking soda", "½ teaspoon cream of tartar", "½ teaspoon ground cinnamon", "⅛ teaspoon fine sea salt", "¾ cup (183 grams) canned pumpkin purée", "½ cup (170 grams) local honey", "2 tablespoons almond butter", "1 teaspoon melted coconut oil, and a bit extra for greasing the muffin tin if not using paper liners", "1 tablespoon sliced almonds", "1 tablespoon toasted pumpkin seeds"], "directions": ["Heat oven to 350°F with the rack in the middle position, and take your eggs out of the fridge. It’s important that your eggs are at room temperature when you start blending the liquid ingredients, or things’ll get chunky.", "Line a muffin tin with paper liners.", "Confession: Even when I make sure the muffin cups are coated with coconut oil or ghee, my muffins tend to stick. If you don’t want to use paper liners, you can use silicone ones, or just grease the living $%!# out of the cups and fall to your knees and pray that the muffins release.", "…and place the shredded carrots in a doubled piece of cheese cloth or clean dish towel. (Trust me: paper towels will tear.)", "In a large bowl, whisk together the almond flour, five spice powder, baking soda, cream of tartar, ground cinnamon, and sea salt.", "In a separate bowl, whisk the eggs well.", "Mix in the pumpkin, honey, almond butter, and melted coconut oil.", "Again, make sure these ingredients are at room temperature, or the coconut oil will harden and clump up. Not the worst thing in the world, but definitely annoying when your goal is a smooth batter.", "Add the wet ingredients to the dry…", "…and stir until combined.", "Fold in the grated carrots.", "Scoop the batter evenly into the muffin tins, filling them about ¾ full.", "Sprinkle sliced almonds and toasted pumpkin seeds on top before placing the muffins in the oven.", "Bake for about 30 minutes, rotating the muffin tin 180° halfway through the cooking process.", "The muffins are done when a toothpick inserted into the middle comes out clean and the tops feel springy to the touch.", "Cool the tray on a rack for about 5 minutes…", "…and then pop the muffins out and completely cool them directly on the rack.", "Store any uneaten muffins in an airtight container in the refrigerator for up to four days. They freeze beautifully, too! I try to let chilled muffins come up to room temperature before taking a bite, but to be honest, I sometimes usually can’t wait that long. Thankfully, they also taste great right out of the fridge."]}, {"id": "F_rs", "title": "Parmesan Scalloped Potatoes with Spinach", "image": "https://images.yumprint.com/p1yumprint-d/-DPh86It0hXsGrgZ4QLGSlwxCxgsSrRXYCD9l5yOQ2K-6yVHTFpHd30R-_X0zYAU", "link": "http://www.eatingwell.com/recipe/261080/parmesan-scalloped-potatoes-with-spinach/?utm_source=facebook&utm_medium=social&utm_campaign=etg_1149484078_editorialcontent", "ingredients": ["2½ pounds Yukon Gold potatoes, cut into ¼-inch slices (about 8 cups)3 tablespoons extra-virgin olive oil, divided1 small onion, finely chopped (about 1 cup)2 cloves garlic, minced3 tablespoons all-purpose flour", "½ teaspoon salt¼ teaspoon white or black pepper2½ cups low-fat milk", "1 pound chopped frozen spinach, thawed1 cup grated Parmesan cheese, divided"], "directions": ["Position racks in upper and lower third of oven; preheat to 425°F. Toss potatoes with 1 tablespoon oil in a large bowl until well coated. Divide between 2 large baking sheets and spread in an even layer. Roast, rotating the pans from top to bottom about halfway through, until tender and beginning to brown, about 20 to 25 minutes. Meanwhile, heat the remaining 2 tablespoons oil in a large saucepan over medium heat. Add onion; cook, stirring frequently, until very soft and golden brown, 5 to 8 minutes. Add garlic; cook, stirring, until fragrant, about 1 minute more. Add, flour, salt and pepper; cook, stirring for 1 minute more. Add milk; cook, stirring and scraping up any brown bits at the bottom of the pan. Increase heat to medium high; cook, stirring, until the sauce thickens and bubbles, 3 to 5 minutes. Remove from heat. Squeeze spinach to remove any excess moisture; stir into the sauce. When the potatoes are done, remove them from the oven. Preheat the broiler. Transfer half the potatoes to a 2-quart broiler-safe baking dish. Spread half the sauce over the potatoes and top with ½ cup cheese. Add the remaining potatoes and top with the remaining sauce and cheese. Broil, watching carefully, until the sauce is bubbling and the cheese is beginning to brown, 1 to 5 minutes, depending on your broiler. Let stand 10 minutes before serving.", "To make ahead: Roast potatoes (Step 2) up to 30 minutes ahead. Prepare sauce (Step 3), cover and refrigerate for up to 1 day; gently reheat until steaming before combining with the potatoes and cheese."]}, {"id": "Jw-k", "title": "Peanut Butter, Blueberry & Oat Energy Squares", "image": "https://images.yumprint.com/p1yumprintg5/G5OVk31PPmwYcUtaFyMsKeFm9daLSFXtTRf8VJH3lwrbuX25hmofwpiEFVuvxzw-", "link": "http://www.eatingwell.com/recipe/263909/peanut-butter-blueberry-oat-energy-squares/", "ingredients": ["1 cup creamy natural peanut butter", "½ cup pure maple syrup", "2 cups rolled oats, toasted (see Tip)", "½ cup dried blueberries", "½ cup chopped pistachios", "1/2 t salt"], "directions": ["Line an 8-inch-square baking pan with parchment paper, leaving extra hanging over two sides. Lightly coat the parchment with cooking spray. Mix peanut butter and maple syrup in a large bowl. Stir in oats, blueberries, pistachios and salt. Spread the mixture firmly and evenly into the prepared pan. Refrigerate until cold, about 1 hour. Cut into 16 squares.", "To make ahead: Store airtight at room temperature for up to 3 days or refrigerate for up to 1 week.", "Equipment: Parchment paper", "Tip: People with celiac disease or gluten sensitivity should use oats that are labeled “gluten-free,” as oats are often cross-contaminated with wheat and barley."]}, {"id": "JqAt", "title": "Peanut Butter, Blueberry & Oat Energy Squares", "image": "https://images.yumprint.com/p1yumprintg5/G5OVk31PPmwYcUtaFyMsKeFm9daLSFXtTRf8VJH3lwrbuX25hmofwpiEFVuvxzw-", "link": "http://www.eatingwell.com/recipe/263909/peanut-butter-blueberry-oat-energy-squares/?utm_source=facebook.com&utm_medium=social&utm_campaign=eatingwell_eatingwell&utm_content=link_magazine_recipes&utm_term=376727A8-BB4B-11E8-87F2-A2B64F017A06", "ingredients": ["1 cup creamy natural peanut butter½ cup pure maple syrup2 cups rolled oats, toasted (see Tip)½ cup dried blueberries½ cup chopped pistachios"], "directions": ["Line an 8-inch-square baking pan with parchment paper, leaving extra hanging over two sides. Lightly coat the parchment with cooking spray. Mix peanut butter and maple syrup in a large bowl. Stir in oats, blueberries, pistachios and salt. Spread the mixture firmly and evenly into the prepared pan. Refrigerate until cold, about 1 hour. Cut into 16 squares.", "To make ahead: Store airtight at room temperature for up to 3 days or refrigerate for up to 1 week.", "Equipment: Parchment paper", "Tip: People with celiac disease or gluten sensitivity should use oats that are labeled “gluten-free,” as oats are often cross-contaminated with wheat and barley."]}, {"id": "H51J", "title": "Peanut Butter, Blueberry & Oat Energy Squares", "image": "https://images.yumprint.com/p1yumprintg5/G5OVk31PPmwYcUtaFyMsKeFm9daLSFXtTRf8VJH3lwrbuX25hmofwpiEFVuvxzw-", "link": "http://www.eatingwell.com/recipe/263909/peanut-butter-blueberry-oat-energy-squares/?utm_source=facebook&utm_medium=social&utm_campaign=etg_89dd9489-fe56-4167-88ab-f308d524fe20_editorialcontent&utm_content=newcontent&utm_term=new", "ingredients": ["1 cup creamy natural peanut butter", "½ cup pure maple syrup", "2 cups rolled oats, toasted (see Tip)", "½ cup dried blueberries", "½ cup chopped pistachios", "½ teaspoon salt"], "directions": ["Line an 8-inch-square baking pan with parchment paper, leaving extra hanging over two sides. Lightly coat the parchment with cooking spray. Mix peanut butter and maple syrup in a large bowl. Stir in oats, blueberries, pistachios and salt. Spread the mixture firmly and evenly into the prepared pan. Refrigerate until cold, about 1 hour. Cut into 16 squares.", "To make ahead: Store airtight at room temperature for up to 3 days or refrigerate for up to 1 week."]}, {"id": "zgGO", "title": "Peanut Energy Bars", "image": "https://images.yumprint.com/p1yumprintkw/Kwe3SpYtnEhq131FRD_HRHmsca_kIyAUu_zvgZgI2zmUSlh4zpejC4Lvc4QB5biJ", "link": "http://www.eatingwell.com/recipes/peanut_energy_bars.html", "ingredients": ["1/2 cup dry roasted salted peanuts", "1/2 cup roasted sunflower seeds, or other chopped nuts", "2 cups raisins, or other chopped dried fruit", "2 cups rolled or instant oats", "2 cups toasted rice cereal, such as Rice Krispies", "1/4 cup toasted wheat germ, (optional)", "1/2 cup creamy or crunchy natural peanut butter", "1/2 cup packed brown sugar", "1/2 cup light corn syrup, or honey", "1 teaspoon vanilla extract"], "directions": ["Coat an 9-by-13-inch baking pan with cooking spray.", "Combine peanuts, sunflower seeds (or other nuts), raisins (or other dried fruit), oats, rice cereal and wheat germ (if using) in a large bowl.", "Combine peanut butter, brown sugar and corn syrup (or honey) in a large microwaveable bowl; microwave on High until bubbling, 1 to 2 minutes. Add vanilla and stir until blended. Pour the peanut butter mixture over the dry ingredients and stir until coated.", "Transfer the mixture to the prepared pan. Press down firmly. (It helps to coat your fingers with cooking spray.) Let stand for about 1 hour to harden. Cut into bars."]}, {"id": "KWhk", "title": "Pecan Apple Muffins", "image": "https://images.yumprint.com/p1yumprint0v/0vpQfyE_HO7PziLwMh0DuDIfyo929qtS43U-HP-9jYf82v4XYY_PkYK8KJsDip3l", "link": "https://hormonesbalance.com/recipes/pecan-apple-muffins/?utm_source=facebook&utm_medium=post&fbclid=IwAR1D5KLWVQj8EvioOItdG66laKMLfu2zC4lVH9nyUCHHjJG1vvo4NudiIu4", "ingredients": ["1 cup oat flour", "1 cup teff flour (highly nutritious Ethiopian grain but found in our stores now too) or buckwheat or rice flour", "½ cup cornmeal flour (mainly to add some rough texture)", "1 tbsp baking powder", "½ tsp salt", "1 tsp ground cinnamon", "1.5 tsp ground cardamon", "2 tbsp flaxseed meal + 3 tbsp of water (this will replace the eggs)", "½ cup agave syrup", "½ cups almond milk", "1 cup coconut oil (do not keep in the fridge or it will be too hard) or olive oil", "1 inch fresh ginger or ½ tsp of dry ginger", "2 green apples", "1½ cups of pecan nuts"], "directions": ["Pre-heat the oven to 375F or 190C.", "Combine flaxseed meal + water and let it stand for a few minutes.", "Grate apples and ginger.", "Chop pecans to about quarter their full size.", "Combine all dry ingredients (flours, salt, baking powder, spices).", "Combine all wet ingredients (agave, coconut oil, milk).", "Mix dry, wet ingredients and flaxseed into a liquid dough; if it’s not liquid enough, add more almond/soy milk.", "Mix in apples and pecans.", "Bake for 25-30 min or till tops are firm."]}, {"id": "Bv9S", "title": "Pistachio Cardamom Energy Bars", "image": "https://images.yumprint.com/p1yumprintmv/mVtlEmuUU5zqH8Z-S5x8Vj7Mg0-K_fA5Hsp6x9AxSZJgXUOr-ChvUOL9LBln8IuG", "link": "http://gourmandeinthekitchen.com/pistachio-cardamom-energy-bars/?utm_content=buffer8e5fe&utm_medium=social&utm_source=facebook.com&utm_campaign=gitkbuffer", "ingredients": ["1 cup/112g raw shelled pistachios", "1 cup/112g raw or sprouted pumpkin seeds", "Pinch of sea salt", "½ teaspoon ground cardamom", "8 large pitted Medjool dates, (very soft)", "½ tsp. vanilla extract, (or vanilla paste)", "4 teaspoons/20ml coconut oil , in liquid state"], "directions": ["Place pistachios, pumpkin seeds, salt and cardamom in bowl of food processor; pulse briefly until powdery (do not over mix or mixture will be greasy). Add dates, vanilla and coconut oil. Pulse until all ingredients are just combined and mixture starts to clump.", "Line a 9x5 loaf pan with parchment paper. Transfer mixture to pan, and use the back of a spoon to press mixture into a rectangle. Cover and chill in the fridge or freezer until firm.", "Unwrap block, lift out paper and cut into 7 bars. Rewrap each bar in paper and store in an airtight container in the fridge or freezer."]}, {"id": "HoS6", "title": "Poached Eggs", "image": "https://images.yumprint.com/p1yumprintlo/Lo-uW5y8S_zsMTKTBEPYpZIfI4BR0nkjhIfucXOfurHNmIiGpcL-Xk55ffFS4ZdW", "link": "http://www.eatingwell.com/recipe/249145/poached-eggs/?utm_source=facebook&utm_medium=social&utm_campaign=etg_aab7a390-9a87-4b61-be1f-9ab2d1d0341e_editorialcontent&utm_content=evg&utm_term=repuprose", "ingredients": ["4 large eggs ¼ cup distilled white vinegar"], "directions": ["Break each egg into a small bowl. Fill a large, straight-sided skillet or Dutch oven with 2 inches of water; bring to a boil. Add vinegar. Reduce to a gentle simmer: the water should be steaming and small bubbles should come up from the bottom of the pan. Submerging the lip of each bowl into the simmering water, gently add the eggs, one at a time. Cook for 4 minutes for soft set, 5 minutes for medium set and 8 minutes for hard set. Using a slotted spoon, transfer the eggs to a clean dish towel to drain for a minute.", "The poaching pot is much easier to clean if it's still warm from cooking."]}, {"id": "tk7L", "title": "Potato-Kale Hash with Eggs", "image": "https://images.yumprint.com/p1yumprintgd/gdzKTXarsuUC3Uqt3B5WwW1Vw97RqfiGAXLcbnRGISkNt3acXMZypWniwW9BacfY", "link": "http://www.eatingwell.com/recipes/potato_kale_hash_eggs.html?socsrc=ewfb0921154", "ingredients": ["5 cups unseasoned frozen shredded hash browns (see Tip)", "1 medium red onion, thinly sliced", "4 cloves garlic, sliced", "1/4 cup extra-virgin olive oil", "2 tablespoons whole-grain mustard", "1/2 teaspoon salt", "1/2 teaspoon ground pepper", "6 cups chopped kale", "1 cup shredded Gouda cheese, preferably smoked", "4 large eggs"], "directions": ["Position a rack in lower third of oven; preheat to 450°F. Coat a large rimmed baking sheet with cooking spray.", "Combine hash browns, onion, garlic, oil, mustard, salt and pepper in a large bowl. Spread onto the prepared baking sheet. Roast for 10 minutes. Layer kale evenly over the potato mixture. Roast for 5 minutes. Stir the kale into the potatoes until combined. Continue roasting until the kale is tender and the potatoes are starting to brown, 4 to 6 minutes more.", "Carefully push the hash into 4 “nests” and make a well in the center of each, large enough for an egg. Sprinkle 1/4 cup cheese into each well, then carefully break 1 egg into each. Bake, rotating the pan 180 degrees about halfway through, until the whites are barely set, 7 to 11 minutes. (The eggs will continue to cook a little more out of the oven.)"]}, {"id": "tXMV", "title": "Pumpkin Doughnuts", "image": "https://images.yumprint.com/p1yumprintgr/GrQ0cShATupDlNmvkps-On8BmLoIHVvJelvUb0f6gTVJCAPf6PZGVsTHwintAj5p", "link": "http://www.eatingwell.com/recipes/pumpkin_donuts.html?socsrc=ewfb1016156", "ingredients": ["3 tablespoons granulated sugar, divided", "2 cups all-purpose flour", "1 1/2 teaspoons baking powder", "1 1/2 teaspoons baking soda", "1/2 teaspoon salt", "2 teaspoons ground cinnamon", "1/2 teaspoon ground nutmeg", "1 large egg", "1 cup buttermilk", "1 cup packed light brown sugar", "1/2 cup canned unseasoned pumpkin puree", "3 tablespoons canola oil", "1 teaspoon freshly grated lemon zest"], "directions": ["Preheat oven to 400°F. Coat a 6-mold mini Bundt pan with cooking spray. Coat the molds with 1 1/2 tablespoons granulated sugar, tapping out the excess.", "Whisk flour, baking powder, baking soda, salt, cinnamon and nutmeg in a large bowl. Whisk egg, buttermilk, brown sugar, pumpkin, oil and lemon zest in another large bowl. Add the dry ingredients and stir until just combined.", "Spoon about 1/4 cup batter into each mold. (You will use half the batter.)", "Bake the doughnuts until puffed and browned, 14 to 15 minutes. Let cool in the pan for 5 minutes. Loosen the edges and invert the doughnuts onto a wire rack.", "Clean the pan, and coat it with cooking spray and the remaining 1 1/2 tablespoons granulated sugar. Repeat steps 2-4 with the remaining batter. Serve the same day."]}, {"id": "kNzF", "title": "Pumpkin Muffins", "image": "https://images.yumprint.com/p1yumprint7n/7nwLHg9FmVPx1BVagv73LtISW1qRK-Tp78tep29fKV5Gk78KX9BmSsFzXdJOS7Up", "link": "http://simple-nourished-living.com/2008/10/pumpkin-muffins/", "ingredients": ["2 cups all-purpose flour", "2 teaspoons baking powder", "¼ teaspoon baking soda", "¼ teaspoon salt", "1 teaspoon ground cinnamon", "½ teaspoon ground ginger", "⅛ teaspoon freshly grated nutmeg", "Pinch ground allspice", "¼ cup unsalted butter, at room temperature", "¾ cup light brown sugar, packed", "2 large eggs", "1 teaspoon vanilla extract", "1 cup canned un-sweetened pumpkin puree", "¾ cup low fat buttermilk", "½ cup moist, plump golden raisins, dried cranberries, or a combination", "¼ cup chopped pecans or walnuts", "¼ cup unsalted raw sunflower seeds, pumpkin seeds, or a combination for topping"], "directions": ["Center a rack in the oven and preheat the oven to 400 degrees F. Butter or spray a 12-cup regular-size muffin pan or place paper liners in the muffin cups.", "In a bowl, whisk together the flour, baking powder, baking soda, salt and spices and set it aside.", "In a large bowl, beat the butter with an electric mixer at medium speed until soft. Add the brown sugar and continue to beat until light and smooth. Add the eggs one at a time and then continue to beat for another minute after the eggs have been incorporated. Beat in the vanilla.", "Lower the mixer speed and mix in the pumpkin and buttermilk. With the mixer at low speed, add the flour mixture in a steady stream, beating only until they disappear. (To avoid over mixing, you can stop the machine early and stir any remaining dry ingredients into the batter using a rubber spatula.) Stir in the raisins and/or dried cranberries and nuts.", "Divide the batter evenly among the muffin cups and sprinkle a few sunflower seeds and/or pumpkin seeds over the top of each muffin.", "Bake for about 25 minutes, or until a toothpick inserted into the center of the muffins comes out clean. Transfer the pan to a rack and cool the muffins in the pan for 5 minutes, then carefully remove each muffin from its cup and transfer them to a rack to finish cooling."]}, {"id": "uKqh", "title": "Pumpkin No Bake Energy Bites", "image": "https://images.yumprint.com/p1yumprintf-/F-7U4JjCxtybghDsHlQCA7T3zHFbYsSaQ22E3a4nMzML_Jyp8pp-7-C8mgPRkvPm", "link": "http://www.gimmesomeoven.com/pumpkin-no-bake-energy-bites/", "ingredients": ["8 oz. (about 1 packed cup) chopped dates", "1/4 cup honey", "1/4 cup pumpkin puree", "1 Tbsp. chia seeds or flax seeds", "1 tsp. ground cinnamon", "1/2 tsp. ground ginger", "1/4 tsp. ground nutmeg", "pinch of salt", "1 cup old-fashioned oats (dry, not cooked)", "1 cup toasted coconut flakes", "1 cup toasted pepitas (pumpkin seeds)"], "directions": ["Combine the dates, honey, pumpkin puree, chia (or flax) seeds, cinnamon, ginger, nutmeg and salt in a food processor, and pulse until smooth and combined.", "Transfer the mixture to a large bowl, and stir in the oats, coconut flakes and pepitas until evenly combined. Cover and refrigerate for at least 30 minutes.", "Once the mixture is cool (and easier to work with), use a spoon or cookie scoop to shape it into your desired size of energy balls. (Mine were about 1-inch in diameter.) Alternately, you can line a small baking pan with parchment paper, and press the mixture evenly into the pan, let it cool, and then cut into bars.", "Store covered in the refrigerator for up to 2 weeks. (Storing them in the refrigerator especially helps the energy bites hold their shape.)"]}, {"id": "B0v1", "title": "Pumpkin Spice Chia Seed Pudding", "image": "https://images.yumprint.com/p1yumprintfo/fot8tTFmjZ-J1--sXzd7_v95TpzkCVu4oyUGe1qq3EDg7aqtrTWCmC5pr84aEajA", "link": "http://laurenkellynutrition.com/pumpkin-spice-chia-seed-pudding/", "ingredients": ["½ cup pumpkin puree", "1 cup almond milk", "1-2 tablespoons 100% maple syrup (depending on how sweet you want it)", "½ teaspoon vanilla", "4 tablespoons chia seeds", "1 teaspoon pumpkin spice", "chopped pecans or candied pecans for topping"], "directions": ["In a medium bowl, mix together pumpkin and milk until pumpkin is combined.", "Add remaining ingredients. Mix well.", "Place in refrigerator for at least an hour until pudding thickens. (I like to leave it overnight)", "Spoon into bowls and enjoy!"]}, {"id": "Lj-7", "title": "Pumpkin Spiced Donut Holes", "image": "https://images.yumprint.com/p1yumprint5o/5oHcr1EjaEAszZMSybKZyDYBaDB1-HIipERYXqSIN2yPsUcA1_SNxH3Y0xvTd_qM", "link": "https://www.ultrawellnesscenter.com/2017/11/19/thanksgiving-makeover/", "ingredients": ["3 large eggs", "2 tablespoons coconut oil, melted (plus more for greasing the pan)", "1/2 cup pumpkin puree", "1/3 cup maple syrup", "1 teaspoon apple cider vinegar", "1 teaspoon vanilla extract", "2 teaspoons psyllium husk powder", "1/2 cup coconut flour", "1/4 cup coconut sugar", "1/2 teaspoon baking soda", "1/4 teaspoon sea salt", "1 teaspoon ground cinnamon", "1/2 teaspoon ground ginger", "pinch of ground nutmeg", "pinch of ground cloves", "optional: oil for frying (coconut oil)"], "directions": ["Preheat oven to 350°F.Mix the eggs, coconut oil, pumpkin puree, maple syrup apple cider vinegar, and vanilla extract to a large bowl and whisk until mixed well.", "Sift the coconut flour into the wet ingredients then add the remaining ingredients. Whisk well or beat for a minute or two with a hand mixer. Make sure it is well combined. The batter/dough will be very thick.", "Drop by tablespoonfuls onto a greased cookie sheet and bake for 20-25 minutes, until a toothpick comes out clean. Cool completely. If you want your doughnut holes fried, you can heat ½”coconut oil or high heat canola oil in a cast iron pan and fry for about 2 minutes on each side."]}, {"id": "k6hk", "title": "Quinoa Blueberry Pancakes", "image": "https://images.yumprint.com/p1yumprintjh/JH8TlNNrj18_DWEbUDArdivFEferFTXb2WYU0xJhCStH-bHohil6K0WRgyO1ZVkL", "link": "http://www.doctoroz.com/recipe/quinoa-blueberry-pancakes", "ingredients": ["2 1/2 cups quinoa, cooked", "1 cup milk", "4 eggs", "3 tsp baking soda", "1/4 tsp sea salt", "1 tbsp honey", "2 tbsp grapeseed oil", "1 1/2 cups blueberries", "cooking spray", "EMAIL SHOPPING LIST"], "directions": ["In a blender combine: quinoa, honey, oil, eggs and milk – blend till smooth.", "Add in salt, baking powder and blend for a few more seconds.", "Heat a griddle or pan with cooking spray.", "Pour 1/4 cup of batter on to hot griddle or pan.", "Sprinkle blueberries of the top and cook for a few minutes.", "Flip and finish both sides until golden brown."]}, {"id": "C4Wo", "title": "Quinoa Breakfast Bars", "image": "https://images.yumprint.com/p1yumprinthm/hMYDoFikhAsdFx4PjYB7zlHa4ojy_1MNSibwKHVHyMbl5eaUeN9ygKdk_Ov9X9ug", "link": "http://www.theleangreenbean.com/quinoa-breakfast-bars/", "ingredients": ["1 c whole wheat flour (or chickpea flour to make GF)", "1.5 c cooked quinoa", "2 c oats", "1/2 c nuts, chopped", "1 tsp cinnamon", "1 tsp baking soda", "2 Tbsp chia seeds", "2/3 c peanut butter", "1/2 c honey", "2 eggs", "2/3 c applesauce (or mashed banana)", "1tsp vanilla", "1/3 c craisins", "1/3 c chocolate chips (optional)"], "directions": ["Combine quinoa, applesauce, vanilla, eggs, peanut butter and honey in a small bowl and mix well.", "Add the remaining ingredients and stir until just mixed.", "Spoon into a greased 9x13 pan and bake at 375 for 20 min or until golden brown.", "Let cool and cut into bars.", "Store in the refrigerator.", "I cut these into bars and put each one in a snack size Ziploc bag before putting them in the fridge. That way they were ready to go and hubby could just grab a bag on the way out the door to work. I’d recommend letting them cool completely before cutting.", "You can also halve this recipe and make them in an 8×8 pan!"]}, {"id": "IU93", "title": "Quinoa Spinach Omelette Bites", "image": "https://images.yumprint.com/p1yumprintau/aUHQDrYmZAQEecuDvF-NO-anyzUz3GGBlFJ3hi--HjfCQb8PuS3EU6innlrb78DN", "link": "https://www.copymethat.com/r/iBqvjID/quinoa-spinach-omelette-bites/", "ingredients": ["1 cup cooked quinoa, (warmed)", "1/2 cup shredded Cheddar cheese (or mozzarella)", "2 large eggs", "1/3 cup chopped fresh spinach leaves", "1 tbsp chopped parsley", "1/2 tsp Italian seasoning", "1/2 tsp pepper", "1/4 tsp salt"], "directions": ["Preheat oven to 350°F and spray a mini muffin tin with cooking spray.", "In a medium bowl, mix the warm quinoa with the cheese to melt the cheese. Add the eggs, garlic, salt, and spinach leaves. Stir to combine.", "Spoon mixture into mini muffin tins, filling to the top. Bake at 350°F for 20 minutes. Remove from oven and let cool for 10 minutes. Run a small knife around the edges to loosen and pop out of the muffin tin."]}, {"id": "dusJ", "title": "Roasted Red Pepper and Kale Frittata", "image": "https://images.yumprint.com/p1yumprint_i/_ieks5Bi3yRwF7VmYPJkjcZpsJnr3fqloWp0gWEWFfyCb-xAY7G7y70x-6AdD2jT", "link": "http://www.wholeliving.com/216609/roasted-red-pepper-and-kale-frittata", "ingredients": ["1 Tbsp extra-virgin olive oil", "1 sliced scallion", "1 cup chopped kale", "1/4 cup diced roasted red pepper", "Coarse salt and freshly ground black pepper", "2 whisked large eggs"], "directions": ["Heat oven to 350 degrees. In a small ovenproof skillet, heat oil over medium heat. Add scallion and kale and cook, stirring, until just wilted, about 2 minutes. Add red pepper and cook until heated through. Season with salt and pepper.", "Pour eggs over vegetables and transfer skillet to oven. Bake until eggs are cooked through, about 5 minutes."]}, {"id": "JcoS", "title": "Savory Zucchini Chard Muffins", "image": "https://images.yumprint.com/p1yumprintme/MeWzyMCb1Cq-eHMUPynBxq9b39Ba2BlLBANl4toAEi4Ajlkh4nCMg1R4rVC4jljv", "link": "https://www.allrecipes.com/recipe/223316/savory-zucchini-chard-muffins/", "ingredients": ["cooking spray3 tablespoons butter5 slices bacon, diced3/4 cup diced onion1 teaspoon minced garlic8 chard leaves, stems removed and leaves thinly sliced2 cups shredded zucchini3 eggs1 teaspoon saltfreshly ground black pepper to taste1 cup all-purpose flour1 teaspoon baking powder3/4 cup finely shredded Swiss cheeseAdd all ingredients to list"], "directions": ["Preheat oven to 400 degrees F (200 degrees C). Generously spray 12 muffin cups with cooking spray.", "Melt butter in a skillet over medium heat; add bacon. Cook gently until bacon begins to curl, 3 to 5 minutes. Add onion, garlic, and chard leaves; cook and stir until chard has wilted, stirring occasionally, 5 to 8 minutes.", "Transfer chard mixture to a large bowl; stir in zucchini, eggs, salt, and black pepper. Add flour and baking powder; mix until flour is evenly distributed and moistened. Stir in Swiss cheese. Spoon batter into prepared muffin tin.", "Bake in the preheated oven until edges of muffin turn golden brown, about 20 minutes."]}, {"id": "B0wA", "title": "Southwest Quinoa Cakes", "image": "https://images.yumprint.com/p1yumprintfj/FJXQaC5VhqxqIuza8tRbIGcKmJ1oUHSSklUiF0Fy3L-5b_2tcHx-1fAIedZw1zjH", "link": "http://www.eatingwell.com/recipe/250937/southwest-quinoa-cakes", "ingredients": ["2 cups water1 cup quinoa, preferably red quinoa4 large eggs, lightly beaten", "1 cup canned black beans, rinsed3/4 cup reduced-fat cottage cheese1/4 cup sliced scallions2 tablespoons all-purpose flour", "1 teaspoon baking powder1/4 teaspoon salt, plus a pinch, divided", "1 cup shredded pepper Jack cheese1 14-ounce can fire-roasted diced tomatoes1 clove garlic1 small chipotle pepper in adobo sauce (see Tip)1/4 cup chopped fresh cilantro1 avocado, chopped"], "directions": ["Preheat oven to 375°F. Coat a 12-cup nonstick muffin tin with cooking spray. Bring water to a boil in a medium saucepan. Stir in quinoa. Reduce to a simmer, cover and cook until the grains are tender and reveal their spiraled germ, about 15 minutes. Transfer to a large bowl and let cool for about 10 minutes. Add eggs, beans, cottage cheese, scallions, flour, baking powder and 1/4 teaspoon salt to the quinoa and stir until well combined. Divide the mixture among the muffin cups (about 1/4 cup each). Top each quinoa cake with about 1 tablespoon cheese. Bake the cakes until puffed and a little brown on top, about 20 minutes. Let cool in the pan for 5 minutes. Gently loosen and remove with a paring knife. Meanwhile, place tomatoes, garlic, chipotle pepper and a pinch of salt in a blender and puree until smooth. Transfer to a small bowl and stir in cilantro. Serve the cakes with the salsa and avocado.", "Make Ahead Tip: Cover and refrigerate the salsa (Step 5) for up to 3 days; bring to room temperature before serving.", "Chipotle chile peppers in adobo sauce are smoked jalapeños packed in a flavorful, spicy sauce. Look for the small cans with Mexican foods at large supermarkets. Once opened, they'll keep for up to 2 weeks in the refrigerator or 6 months in the freezer."]}, {"id": "vWd8", "title": "Spaghetti Squash Pesto Shrimp Breakfast Bowls", "image": "https://images.yumprint.com/p1yumprintdf/DFECqJpRPTe2wXM27NO-5-TrjEgYUimCLU35xJDO1DktO8dnsXmu0FzvHXwaEKQ9", "link": "http://www.nakedcuisine.com/spaghetti-squash-pesto-shrimp-breakfast-bowls/", "ingredients": ["1/2 a large spaghetti squash, seeds scooped out", "2 Tbs ghee or butter", "1 Tbs basil pesto, homemade or store-bought", "2-4 eggs", "1 Tbs vinegar (for poaching the eggs)", "handful sliced bell pepper", "handful sliced tomato", "handful chopped green onion", "handful arugula or spinach", "1/2 avocado, sliced", "6 wild raw shrimp, peeled and deveined", "1/4 tsp sea salt and pepper"], "directions": ["Either cook your spaghetti squash in the oven at 400F for one hour or in the slow cooker for 2 1/2 hours.", "Start a small pot of water to boil, when its boiling add vinegar and drop the eggs for 3 minutes if you want soft poached, 4 minutes for medium and 5 for hard.", "Melt butter or ghee and basil pesto together in a skillet and pour half over the cooked spaghetti squash, leave the other half in your skillet and add shrimp to it. Cook for 1.5 minutes each side and remove from heat.", "To assemble the bowl simply scoop out the strands of spaghetti squash and push to one side, add greens and the other vegetables, top with poached eggs and shrimp and add salt and pepper to taste. Enjoy!"]}, {"id": "tO1P", "title": "Spiced Breakfast Quinoa", "image": "https://images.yumprint.com/p1yumprintiu/iuKRW2KG10cOD7O6CXvfqaXtHoBSlDvc6x_NEFeoRaLVnhb85USLNO3BAziUy46O", "link": "http://www.eatingwell.com/recipes/breakfast_quinoa.html?socsrc=ewfb1003152", "ingredients": ["1/2 cup quinoa", "1 cup low-fat milk", "1 cup water", "1/2 teaspoon ground cinnamon", "1/8 teaspoon ground nutmeg", "1/8 teaspoon ground ginger", "Pinch of salt", "2 tablespoons honey", "1/2 teaspoon vanilla extract", "1 large egg white", "2 tablespoons currants or raisins"], "directions": ["Place quinoa in a fine-mesh sieve and rinse well with cold water. Heat a medium saucepan over medium-high heat. Add quinoa and cook, stirring, until the grains are separated and smell fragrant, 2 to 4 minutes. Stir in milk, water, cinnamon, nutmeg, ginger and salt. Bring to a boil. Reduce heat to maintain a simmer and cook uncovered, stirring occasionally, until the quinoa is tender, 20 to 25 minutes. Remove from heat. Stir in honey and vanilla.", "Whisk egg white in a small bowl with 1 tablespoon of the hot cereal. Repeat with 5 more tablespoons until the egg white is completely incorporated. Stir in currants (or raisins). Return the cereal to the saucepan and cook, stirring, over medium-low heat until thickened slightly, 1 to 2 minutes.", "Make Ahead Tip: Cover and refrigerate for up to 1 day; serve cold or reheat over low heat or in the microwave; thin with water or milk as desired."]}, {"id": "HXaJ", "title": "Spinach & Cheese Breakfast Skillet", "image": "https://images.yumprint.com/p1yumprinteg/EGBbdk8FXDBxbW1kRo0iTIjVBjEuVjuIzVZ4gaGPTvugJzkrAahPKGMEWUcFr-Jp", "link": "http://www.eatingwell.com/recipe/251204/spinach-cheese-breakfast-skillet/", "ingredients": ["1 small russet potato (about 9 ounces), scrubbed (skin left on)1 slice bacon1 tablespoon extra-virgin olive oil3 cups baby spinach⅛ teaspoon salt2 large eggs⅔ cup shredded Cheddar cheese (1½ ounces)Freshly ground pepper"], "directions": ["Prick potato in several spots with a fork; microwave on High for 4 minutes. Let cool for 5 minutes, then chop into ½-inch cubes. Meanwhile, cook bacon over medium-high heat in an 8-inch cast-iron skillet until crisp. Remove the bacon from the skillet, but leave the bacon drippings in the pan. Add oil and diced potatoes and cook, stirring frequently, until the potatoes are browned, about 5 minutes. Add spinach; stir to combine and just wilt, about 1 minute. Season with salt. Make 2 wells in the center of the hash and crack one egg into each well. Reduce the heat to medium and cook until the eggs are partially set, 2 to 3 minutes. Sprinkle with cheese, cover and cook until the cheese is melted and the eggs whites are completely set, 1 to 2 minutes. Chop the bacon and sprinkle on top. Garnish with a generous grinding of pepper.", "Make Ahead Tip: Cool and refrigerate the microwaved potato (Step 1) in an airtight container for up to 1 day."]}, {"id": "vZm6", "title": "Spinach Mushroom Quiche", "image": "https://images.yumprint.com/p1yumprintjz/jZGAZUIr4hF5O6CgQlnOifwIDDpsBeeQgi2y_1kzic-2WTVKRPj_eDHqwcx0Fm_L", "link": "http://fitlife.tv/recipes/spinach-mushroom-quiche/", "ingredients": ["8 eggs, pasture-raised & organic", "1.5 cup fresh spinach, chopped", "1 cup mushrooms, sliced", "1/2 of a medium onion, chopped (red or white)", "1 tsp sea salt", "1 tsp pepper", "1 tbsp butter or coconut oil", "½ cup coconut milk for creaminess (optional)"], "directions": ["Preheat oven to 350", "Grease 9-12” baking dish with coconut oil or butter", "Crack eggs into a mixing bowl and whisk until egg yolks and whites are mixed", "Add spinach, mushrooms, sea salt and pepper to egg mixture and whisk all ingredients together", "Pour mixture into baking pan", "Bake for 30 minutes, or until cooked through center", "Option to serve with ½ an avocado and top with salsa or hot sauce"]}, {"id": "w05C", "title": "Sprouted Blue Corn, Buckwheat and Blueberry Muffins", "image": "https://images.yumprint.com/p1yumprint7e/7eua7KqhDdUY94a5nPRQ4IKSb-rkPiKmGehtd-9LYh2GYGgzzBH-kw2Fu4M2Zjyq", "link": "http://nourishedkitchen.com/sprouted-blue-corn-buckwheat-and-blueberry-muffins/", "ingredients": ["1¼ cup Pure Living sprouted blue corn flour", "½ cup sprouted buckwheat flour", "2 teaspoons baking powder", "½ teaspoon unrefined sea salt", "1 cup buttermilk", "2 eggs, beaten", "1 teaspoon vanilla extract", "½ cup honey", "¼ cup melted butter", "1 cup fresh or frozen blueberries"], "directions": ["Line a muffin tin with muffin cups, and heat the oven to 400 F.", "In a medium mixing bowl, whisk sprouted blue corn flour and sprouted buckwheat flour together with baking powder and sea salt. In a separate bowl, beat buttermilk, eggs, vanilla and honey together until uniformly combined.", "Slowly pour the wet ingredients into the dry ingredients, beating them as you pour to form a smooth and uniform batter. In a smooth stream, stir in the butter, and then fold in the blueberries.", "Spoon the batter into the muffin cups, filling them ⅔ of the way. Bake about 15 minutes or until a toothpick inserted into the center of the muffin comes out clean."]}, {"id": "I5nP", "title": "Sprouted Blue Corn, Buckwheat and Blueberry Muffins", "image": "https://images.yumprint.com/p1yumprint7e/7eua7KqhDdUY94a5nPRQ4IKSb-rkPiKmGehtd-9LYh2GYGgzzBH-kw2Fu4M2Zjyq", "link": "https://nourishedkitchen.com/sprouted-blue-corn-buckwheat-and-blueberry-muffins/", "ingredients": ["1¼ cup PureLiving sprouted blue corn flour (available here)", "½ cup sprouted buckwheat flour (available here)", "2 teaspoons baking powder", "½ teaspoon unrefined sea salt", "1 cup buttermilk", "2 eggs, beaten", "1 teaspoon vanilla extract", "½ cup honey", "¼ cup melted butter", "1 cup fresh or frozen blueberries"], "directions": ["Line a muffin tin with muffin cups, and heat the oven to 400 F.", "In a medium mixing bowl, whisk sprouted blue corn flour and sprouted buckwheat flour together with baking powder and sea salt. In a separate bowl, beat buttermilk, eggs, vanilla and honey together until uniformly combined.", "Slowly pour the wet ingredients into the dry ingredients, beating them as you pour to form a smooth and uniform batter. In a smooth stream, stir in the butter, and then fold in the blueberries.", "Spoon the batter into the muffin cups, filling them ⅔ of the way. Bake about 15 minutes or until a toothpick inserted into the center of the muffin comes out clean."]}, {"id": "JzpR", "title": "Sprouted Einkorn Apple Muffins with Pecans", "image": "https://images.yumprint.com/p1yumprint-u/-UzSMlH8hckk4yEi-6HdNZcne08jN9Y-mIWpeyoGLBLblQH0AaNuXVHEUZAmrMSE", "link": "https://nourishedkitchen.com/sprouted-einkorn-apple-muffins/", "ingredients": ["½ cup butter, softened", "1 cup whole, unrefined cane sugar (available here)", "1 tablespoon blackstrap molasses", "2 eggs", "1 cup milk kefir (find a starter here)", "2 cups sprouted einkorn flour (available here", "1 teaspoon baking powder", "½ teaspoon baking soda", "½ teaspoon finely ground sea salt", "1 tablespoon ground cinnamon", "½ teaspoon freshly grated nutmeg", "3 medium or 2 large apples, peeled, cored and grated", "1 cup chopped pecans"], "directions": ["Heat the oven to 375 F. Line a muffin tin with muffin cups.", "Beat the butter, sugar an molasses together until creamy, and then beat in the eggs. Gently stir in the milk kefir.", "In a separate bowl, sift the flour, baking powder, baking soda, salt, cinnamon and nutmeg together. Slowly stir the dry ingredients into the wet ingredients, until they form a smooth batter, and then fold in the shredded apple.", "Divide the batter evenly among the muffin cups, sprinkle with chopped walnuts and bake for 25 to 30 minutes, or until a toothpick inserted into the center of the muffins comes out clean.", "Allow the muffins to cool for 5 minutes in the pan, and then gently pull them out and allow them to finish cooling on a wire rack."]}, {"id": "HImP", "title": "Strawberry Cashew Chia Milk (Dairy-Free,", "image": "https://images.yumprint.com/p1yumprint1l/1lTAAcijcIS5LiSoIK9fjRf-Cz8fOYpjyjoTrdmZUVNsCDxE0WsZi_PdKE01-gc3", "link": "http://gourmandeinthekitchen.com/strawberry-cashew-chia-milk/", "ingredients": ["1 recipe for strawberry syrup", "1 recipe for cashew chia milk (or substitute about 3 cups/24oz of homemade or store bought nut milk of choice)", "4oz/120g frozen strawberries"], "directions": ["Place chilled syrup, chilled cashew chia milk and frozen strawberries in a high speed blender and blend until creamy and smooth. Serve immediately.", "Alternatively stir syrup into cashew milk as desired (about 3 Tablespoons per cup) and serve."]}, {"id": "BYgL", "title": "Strawberry Ginger Smoothie", "image": "https://images.yumprint.com/p1yumprintpa/papsh8C0_YwcuMcB_jJAUsSpKoTa8db7OIpiAUVYDJRiIGw2jet2GXqClyUhrkHA", "link": "https://www.hormonesbalance.com/uncategorized/strawberry-ginger-smoothie/", "ingredients": ["1 cup strawberries; fresh or frozen", "2 cup of any tree nut milk (almond, cashew, coconut) or seed milk (sunflower, hemp)", "2 tbsp of raw honey or stevia equivalent", "a handful of raw almonds (or any other nuts like walnuts, pecans or macadamia nuts)", "1 teaspoon of milk thistle (powder or liquid)", "¼ teaspoon camu camu (you can order it online, food highest in vitamin C)", "1 tsp minced fresh ginger root", "1 tbsp flax seed or flax meal"], "directions": ["Combine strawberries, nut milk, ginger, flax seed, almonds and honey in a blender.", "Blend till either very smooth or somewhat smooth if you like chunks in your smoothie.", "Put on a good posture, drink it and start a great day."]}, {"id": "s8dv", "title": "Super Duper Healthy Breakfast Cookies", "image": "https://images.yumprint.com/p1yumprinttn/tNC-4csIHku3Dp7Ak-MkquopY4s1xJfcuMEAOzUXTWbWNzcQBY_VRqu4c6bskfFM", "link": "http://www.thepulpkitchen.com/super-duper-healthy-breakfast-cookies/", "ingredients": ["1 cup rolled oats", "1/4 cup almond meal", "2 tablespoons chia seeds", "1 cup coconut flakes", "1/2 cup mixed nuts, chopped (I used pecans)", "1 cup mixed dried fruit (I used raisins and blueberries this time)", "1/2 teaspoon salt", "1 1/2 teaspoon cinnamon", "1/2 teaspoon all spice", "3 ripe bananas", "1/2 cup applesauce, unsweetened", "1 teaspoon vanilla extract"], "directions": ["Preheat oven to 350 degrees.", "In a bowl mix the first 9 ingredients (from oats to all spice).  In a separate bowl, mash the bananas with a fork until it’s all gooey.  Add the apple sauce and vanilla.  Add the wet ingredients to the dry ones, and mix until is well incorporated.  If the mixture seems too dry, just add more applesauce.  Place heaping tablespoon-fulls onto a cookie sheet, mold into rounds, and press down slightly.  Bake for 20 minutes, until lightly browned.", "Makes 14 big cookies, 133 calories per cookie."]}, {"id": "D-ai", "title": "Super Seeded Grain-Free Granola with Tahini Yogurt Breakfast Bowls (Paleo, Vegan)", "image": "https://images.yumprint.com/p1yumprint5s/5SojgVReEz-Cv-ykOH-eaj3U2y7eQBW0yWp5CbgXCPs_UhS8zPbB7F49_xK-bys2", "link": "http://gourmandeinthekitchen.com/super-seeded-grain-free-granola-tahini-yogurt-breakfast-bowls-paleo-vegan/", "ingredients": ["6 oz/170g coconut milk yogurt (or yogurt of your choice) per serving", "1 Tablespoon/15g tahini per serving", "1 Tablespoon/20g date syrup per serving", "Fresh strawberries (or fruit of your choice)", "Super Seeded granola"], "directions": ["Fold tahini into yogurt leaving some steaks. Drizzle with date syrup and top with sliced strawberries and a few spoonfuls of granola."]}, {"id": "nUUk", "title": "Sweet Potato Scones", "image": "https://images.yumprint.com/p1yumprintbp/bPX-Zu_d5krDJx4k3CvYoKD49TGZbLRZmZAesX5FqnkML5izAlTJGrMIApjwvIgk", "link": null, "ingredients": ["¾ cup unsalted butter, cut into cubes and chilled, plus 1 Tbsp.", "1 sweet potato, peeled and diced", "3 Tbsp. firmly packed brown sugar", "Kosher salt", "2 cups all-purpose flour", "1 Tbsp. baking powder", "¼ tsp. ground cinnamon", "¼ tsp. ground allspice", "Pinch of grated nutmeg", "½ cup dried currants", "¾ cup heavy cream, chilled", "Brown Sugar Icing", "¼ cup powdered sugar", "1 Tbsp. unsalted butter", "¼ cup firmly packed brown sugar", "3 Tbsp. heavy cream"], "directions": ["To make the scones: In a wide sauté pan, melt the 1 Tbsp. but­ter over medium heat. Add the sweet potato and cook, stirring often, until it begins to soften, about 10 minutes. Add 1 tbsp of the brown sugar and cook, stirring often, until the sweet potato caramelizes, 12 to 15 minutes. Just before the sweet potato is done, stir in a pinch of salt. Refrigerate to cool completely, about 1 hour.", "Preheat the oven to 425°F. Line a baking sheet with parchment paper.", "In a food processor, pulse together the flour, baking powder, the remaining 2 Tbsp. brown sugar, 1/2 tsp. salt, cinnamon, allspice, and nutmeg. Scatter the chilled butter cubes over the flour mix­ture and pulse until the mixture resembles coarse crumbs. Do not overprocess.", "Transfer the flour-butter mixture to a large mixing bowl, add the currants and the chilled sweet potato, and toss to coat with the flour-butter mixture. Add the cream, gently stirring with a fork to incorporate. The dough should just barely come together. Do not overmix.", "Dump the dough onto a lightly floured surface, and gently knead into a ball, taking care not to mash the sweet potato cubes. The dough will feel slightly dry. Form into an 8-in disk and cut into eight triangles. Transfer the scones to the prepared baking sheet.", "Bake until the scones are barely golden brown, 18 to 22 min­utes. Let cool on the baking sheet for about 10 minutes, then transfer to a wire rack to cool completely.", "To make the icing: Sift the powdered sugar into a medium bowl. In a small saucepan, combine the butter, brown sugar, and cream over medium-low heat, stirring often, until the but­ter is melted and the mixture is well combined. Pour the butter mixture over the powdered sugar, and whisk until smooth. Let cool completely.", "When the scones are cool, set the wire rack with the scones over the baking sheet. With a small offset spatula or a table knife, spread about 1 tbsp icing on each scone. Let set for at least 15 minutes before serving.", "(To make ahead, store in an airtight container for up to 2 days.)"]}, {"id": "eL3z", "title": "Thai Breakfast Skillet", "image": "https://images.yumprint.com/p1yumprintlr/Lr3JXQfLfLYl67klpT4gFClPqLbJtpJukvmGhuOeC8VO6teChsUVoL2LzxhD2B-g", "link": "http://recipes.carlosvelez.net/breakfast/thai-breakfast-skillet/", "ingredients": ["2 small red potatoes, diced small", "1/4 onion", "3 baby portabellos", "2 chard leaves", "1 small handful of dandelion greens", "1 cup of microgreens", "1/2 package smoked salmon", "4 eggs", "2-4 ounces of coconut milk", "1/2 - 1 lime, juiced"], "directions": ["Chop all ingredients, set up in bowls, and set large pot of water with a bit of white vinegar on high heat", "Scoop a generous spoonful of coconut oil into a non-stick pan and allow to get hot", "Add potatoes and cook for a couple of minutes, stirring occasionally throughout entire cooking process", "Add onions and cook until onions start to turn translucent", "Add mushrooms and cook for a few minutes", "Allow water in pot to heat to just below boiling and lower heat to maintain a steady temperature", "Crack eggs into a small bowl or measuring spoon and lower gently but quickly into pot one at a time", "Let eggs cook for a few minutes, using a rubber spatula to keep them separate", "While eggs cook, add greens and continue to stir", "Greens will also only take a few minutes to cook", "Add coconut milk and lime and let cook for a couple more minutes while removing the eggs", "Scoop eggs out gently with a slotted spoon and lay on a paper towel to dry, season with salt and pepper", "Serve a portion of veggies topped with eggs and microgreens"]}, {"id": "CoE9", "title": "These Dark Chocolate Apricot Breakfast Bars Are The Perfect Healthy Snack", "image": "https://images.yumprint.com/p1yumprint5z/5ZmsQOalQ3BaPJxye8oMF6ECPvGifm0gVsJc90eeiHrxl0y2d9g2xAqEnYesQJQt", "link": "https://www.buzzfeed.com/hitomiaihara/get-an-energy-boost-with-these-dark-chocolate-apricot-breakf?bffbtasty&ref=bffbtasty&utm_term=.et2ooPoBAV#.ronLLgLe7p", "ingredients": ["1 cup puffed rice", "½ cup oats", "½ cup pumpkin seeds", "1 ⅓ cup almonds, roasted", "½ cup dried apricot, diced", "⅓ cup corn syrup", "½ cup honey", "1 teaspoon vanilla extract", "1 bar dark chocolate"], "directions": ["Combine puffed rice, oats, rice, and apricot into a large bowl.", "In a sauce pan, heat corn syrup and honey until it reaches 260°F/126°C. Then carefully add vanilla extract and remove from heat.", "Immediately pour the honey mixture into the bowl, stir, and transfer it onto a parchment paper–lined baking sheet.", "Using a spatula press down the mixture to desired thickness. (Careful - it may still be quite warm!)", "Refrigerate for 30 minutes.", "Heat 1 bar of dark chocolate for 1 minute, then drizzle over the top. Refrigerate for 30 minutes.", "Remove parchment paper and cut into 12 even pieces.", "Wrap each bar with wax paper and store up to 1 week."]}, {"id": "I3Bq", "title": "Toasted Sesame & Cranberry Black Rice Bars", "image": "https://images.yumprint.com/p1yumprintkt/Kt6b6pqDGl_Zh2MGrvgIA9wzRLpV0ZtGKbxXRubH-AhYj3GU1rTMAOtT3haSWCIP", "link": "http://healthyhelperblog.com/toasted-sesame-cranberry-black-rice-bars/", "ingredients": ["1 cup cooked Village Harvest black rice", "½ cup almond meal", "¼ cup rolled oats", "½ cup roasted almonds, chopped", "⅓ cup dried cranberries, chopped", "¼ cup toasted sesame seeds", "2 tsp sesame oil", "3 tbsp honey (maple syrup or agave if you are strict vegan)", "½ cup natural tahini", "½ tsp ground ginger", "¼ tsp salt"], "directions": ["Preheat oven to 350. Blend rice, almond meal, rolled oats, ginger, and salt in a food processor. Add almonds, cranberries, and sesame seeds. On low, heat oil, honey, and tahini, stir until warm and combined. Pour over rice mixture. Use your hands to mix everything together thoroughly. Press down mixture into an 8x8 baking dish that has been lined with parchment paper. Bake for 20 minutes. Cool on a wire wrack completely before slicing and serving."]}, {"id": "x6hK", "title": "Turkish Poached Eggs with Paprika Oil", "image": "https://images.yumprint.com/p1yumprintvw/VwjxaYh_HjTC9xxCFIOHX90Nwp1w847r-2WJsepC_0M8uVETc_iV5VzEo9RJ9Ow2", "link": "http://gourmandeinthekitchen.com/2016/turkish-poached-eggs-with-paprika-oil/?utm_content=bufferb9cca&utm_medium=social&utm_source=twitter.com&utm_campaign=buffer", "ingredients": ["8oz/225 g plain non-dairy coconut yogurt (or regular yogurt), strained", "1 teaspoon/ 5ml fresh lemon juice", "Sea salt and freshly ground black pepper, to taste", "2 oz/56g baby spinach", "2 large eggs", "Pita chips, for serving (optional)"], "directions": ["Stir together the yogurt, lemon juice, salt, and pepper and divide between 2 plates. Set aside.", "Bring a medium saucepan of salted water to a boil. Blanch spinach for 1 minute until just tender. Remove with tongs or a slotted spoon and drain to remove excess water. Set aside.", "To poach the eggs, fill a saute pan ¾ full of water and bring to a gentle simmer. Crack the eggs, one at a time, into a small ramekin and slide them into the water. Gently simmer the eggs for 3 to 5 minutes (depending on how you like your yolks). Remove the eggs from the water with a wire strainer and drain excess water on a clean, kitchen towel.", "Heat olive oil, paprika, cayenne pepper and a pinch of salt in a small skillet over medium heat until fragrant (about 30 seconds). Strain through a fine mesh strainer and reserve. (extra can be stored in an airtight glass container at room temperature.)", "Place half of the spinach and a poached egg on each plate.", "Drizzle warm paprika oil over eggs. Top with a pinch of sumac and serve with pita chips if desired."]}, {"id": "JCcK", "title": "Vanilla Bean Chia Porridge with Sauteed Coconut Caramel Pears", "image": "https://images.yumprint.com/p1yumprintsq/SQE0JkWAZJ2mGvPsXnc-Ef_I95TVhdbPYnwmDgs20te5jb9Xl64ujHOIgGokpjLk", "link": "https://gourmandeinthekitchen.com/vanilla-bean-chia-porridge-with-caramel-pears/", "ingredients": ["1 large or two small pears, cored and thinly sliced", "1 Tablespoon/14g butter or coconut oil for a vegan version", "1 Tablespoon/15ml coconut nectar", "Pinch of sea salt", "Pinch of ground cinnamon"], "directions": ["Start the night before. Stir together the coconut milk, salt, chia seeds and vanilla bean seeds in a jar or sealed container. Refrigerate overnight to plump. Stir to incorporate the seeds if they have settled the following morning.", "The next morning make the sautéed pears.", "In a medium skillet, over medium heat, melt the butter or coconut oil.", "Add the coconut nectar and stir until the mixture begins to bubble. Reduce to a simmer and add the pears. Cook stirring occasionally, until the mixture turns syrupy and a deep golden color and the pears are tender (about 3 to 5 minutes.)", "In the meantime gently reheat the chia porridge in a small saucepan or in the microwave until warm but not boiling.", "Remove the pears from heat and add a pinch of salt.", "Spoon the warmed porridge into cups and top with the pears and caramel syrup; sprinkle with ground cinnamon if desired and serve immediately."]}, {"id": "DLdS", "title": "Vegan Pancakes", "image": "https://images.yumprint.com/p1yumprintbd/bDHab2N5Kpg8x_ZOjC0bIkP6tDkRAZGq2WodXdYJg9ZMoEJPxD2nOuWGwo9LLPvc", "link": "http://www.eatingwell.com/recipe/257348/vegan-pancakes/?utm_source=facebook&utm_medium=social&utm_campaign=etg_832761283_editorialcontent", "ingredients": ["1½ cups white whole-wheat flour (see Tip) 2 teaspoons baking powder ¼ teaspoon salt 1½ cups unsweetened almond milk or other unsweetened nondairy milk ¼ cup unsweetened applesauce 2 tablespoons coconut oil, melted 1 tablespoon sugar 1 teaspoon vanilla extract"], "directions": ["Whisk flour, baking powder and salt in a large bowl. Whisk milk, applesauce, oil, sugar and vanilla in a medium bowl. Make a well in the center of the dry ingredients, add the wet ingredients and whisk just until combined. Resist overmixing—it will make the pancakes tough. Let the batter sit, without stirring, for 10 to 15 minutes. (As the batter rests, the baking powder forms bubbles that create fluffy pancakes.) Coat a large nonstick skillet or griddle with cooking spray; heat over medium heat. Without stirring the batter, measure out pancakes using about ¼ cup batter per pancake and pour into the pan (or onto the griddle). Cook until the edges are dry and you see bubbles on the surface, 2 to 4 minutes. Flip and cook until golden brown on the other side, 2 to 4 minutes more. Repeat with the remaining batter, coating the pan with cooking spray and reducing the heat as needed.", "Make-Ahead Tip: The mixture of dry ingredients can be stored airtight for up to 1 month; the batter can be refrigerated for up to 1 day; cooked pancakes can be frozen airtight, in a single layer, for up to 3 months. Reheat in the microwave or oven.", "Tip: White whole-wheat flour, made from a special variety of white wheat, is light in color and flavor but has the same nutritional properties as regular whole-wheat flour."]}, {"id": "u92K", "title": "Whole Grain Carrot Muffins", "image": "https://images.yumprint.com/p1yumprintbe/BEXn5vuEqu1R6y4wdoR0MfNk4BuUMC6s5YUMo8arr2u3Q_LGUjcIROovc00br_6D", "link": "http://www.strongandbeyond.com/2015/02/whole-grain-carrot-muffins.html#.Vl_bWtKrT4a", "ingredients": ["1½ cups whole-wheat flour", "1 tsp baking soda", "1 tsp ground cinnamon", "½ tsp ground ginger", "½ tsp salt", "½ cup butter, softened", "½ cup honey", "1 egg", "1 tsp pure vanilla extract", "1 cup unsweetened applesauce", "¾ cup carrot shreds"], "directions": ["Preheat your oven to 350 degrees F. Line a muffin pan with paper, foil, or silicone liners, and set aside. In a medium bowl whisk together the flour, baking soda, cinnamon, ginger, and salt. In a large bowl fitted with an electric whisk, mix the butter, honey, egg and vanilla together on medium speed.", "Turn the speed down and slowly add in the flour mixture until well combined. The batter will be fairly thick at this point. Add applesauce and carrots. Divide the batter evenly among the muffin cups. Bake for 22 to 24 minutes or until a toothpick comes and muffins are beginning to turn golden brown on top. Enjoy!"]}, {"id": "vJMe", "title": "Winter Squash Muffins with Cranberries", "image": "https://images.yumprint.com/p1yumprint_5/_5lN-eB8GOcEV7CEBZcYA25SUUIZ93mGnAxY-DLy2O9HBjckOKY264wrZQHy7QbM", "link": "http://www.eatingwell.com/recipes/winter_squash_muffins_cranberries.html", "ingredients": ["1/2 cup old-fashioned rolled oats", "1 1/2 cups white whole-wheat flour", "1/3 cup sugar", "1 1/2 teaspoons baking powder", "3/4 teaspoon baking soda", "1/2 teaspoon ground cinnamon", "1/2 teaspoon salt", "1/4 teaspoon ground allspice", "1/4 teaspoon ground nutmeg", "1 1/2 cups shredded raw winter squash, such as butternut", "1/2 cup chopped fresh cranberries or dried cranberries", "1/2 cup toasted pecans, coarsely chopped (optional)", "2 large eggs", "1/2 cup low-fat plain yogurt, regular or Greek", "3 tablespoons canola oil", "3 tablespoons pure maple syrup", "1 small apple, peeled, if desired, and shredded"], "directions": ["Preheat oven to 375°F. Line 12 (1/2-cup) muffin cups with paper liners and lightly coat with cooking spray. (Alternatively, coat muffin tin with cooking spray and omit liners.)", "Pulse oats in a food processor until ground to the texture of breadcrumbs. Transfer to a mixing bowl and whisk in flour, sugar, baking powder, baking soda, cinnamon, salt, allspice and nutmeg. Stir in squash, cranberries and pecans (if using).", "Whisk eggs, yogurt, oil and syrup in another mixing bowl. Stir in apple. Add the squash mixture and fold until evenly moistened. Divide the batter among the muffin cups, filling them almost to the top.", "Bake until the muffins are golden brown and the tops spring back when lightly touched, 20 to 25 minutes. Let cool in the pan for 10 minutes, then transfer to a wire rack to cool for at least 5 minutes before serving.", "Per serving: 161 calories; 5 g fat (1 g sat, 3 g mono); 32 mg cholesterol; 27 g carbohydrates; 9 g added sugars; 11 g total sugars; 4 g protein; 3 g fiber; 257 mg sodium; 130 mg potassium."]}, {"id": "zwYY", "title": "Zucchini Bread Breakfast Pancakes", "image": "https://images.yumprint.com/p1yumprintdh/DhJ8ImBXD0HLsbX1ilDXogwNrbrsP0wo6S7d7sYI7yd7WMVpV9bnmbQZAGMakYWs", "link": "http://www.eatingwell.com/recipes/zucchini_bread_breakfast_pancakes?socsrc=ewfb0623161link", "ingredients": ["2 cups shredded zucchini", "1 1/4 cups white whole-wheat flour or all-purpose flour", "2 teaspoons baking powder", "1 teaspoon pumpkin pie spice blend", "1/4 teaspoon salt", "2 large eggs", "1 cup plus 2 tablespoons low-fat milk", "2 tablespoons melted butter", "2 tablespoons light brown sugar", "1 teaspoon vanilla extract", "1/2 cup toasted pecans (see Tip), chopped"], "directions": ["Put shredded zucchini in a clean kitchen towel and squeeze to remove as much moisture as possible.", "Whisk flour, baking powder, pumpkin pie spice and salt in a large bowl. Whisk eggs, milk, butter, brown sugar and vanilla in a medium bowl. Make a well in the center of the dry ingredients, add wet ingredients and whisk until combined. Fold in the zucchini and nuts.", "Coat a large nonstick skillet (or griddle) with cooking spray; heat over medium heat. Cook pancakes in batches, using a scant 1/3 cup batter for each and spreading it to make them about 4 inches wide. Cook until bubbles dot the surface, 1 to 3 minutes. Flip and brown on the other side, 1 to 2 minutes more. Reduce the heat if the pancakes are browning too quickly. Serve hot.", "TIPS & NOTES", "Toast nuts before using in a recipe for the best flavor. To toast whole nuts, spread on a baking sheet and bake at 350°F, stirring once, until fragrant, 7 to 9 minutes. To toast chopped, small or sliced nuts, cook in a small dry skillet over medium-low heat, stirring constantly, until fragrant and lightly browned, 2 to 4 minutes."]}, {"id": "ISdh", "title": "Zucchini Mini Muffins", "image": "https://images.yumprint.com/p1yumprint4f/4FE-ZT1aM8bt969DpUBZhyPvmTM3YVFJnQo5TY6y0Oo3l7BzsQCiXN67ostr0EIX", "link": "http://www.eatingwell.com/recipe/265906/zucchini-mini-muffins/?utm_source=facebook&utm_medium=social&utm_campaign=etg_E6D82F8C-8033-11E8-A857-69890F4A2151_editorialcontent&utm_content=new", "ingredients": ["¾ cup all-purpose flour¾ cup white whole-wheat flour1 teaspoon ground cinnamon¾ teaspoon baking soda½ teaspoon salt", "2 large eggs", "¾ cup sugar¼ cup canola oil or unsalted butter, melted1½ teaspoons vanilla extract2 cups shredded and coarsely chopped zucchini½ cup mini chocolate chips"], "directions": ["Preheat oven to 350°F. Coat a 24-cup mini muffin tin with cooking spray. Whisk all-purpose flour, whole-wheat flour, cinnamon, baking soda and salt in a large bowl. Whisk eggs, sugar, oil (or butter) and vanilla in a medium bowl. Stir in zucchini and chocolate chips. Add the wet ingredients to the flour mixture and stir until just combined. Transfer the batter to the prepared muffin tin. Bake until a toothpick inserted into the center of a muffin comes out clean, about 10 minutes. Let cool in the pan for 5 minutes, then turn out onto a rack to cool completely.", "To make ahead: Store in an airtight container at room temperature for up to 2 days or individually wrap in plastic and freeze for up to 1 month."]}]}