{"title": "Appetizers", "recipes": [{"id": "v52P", "title": "Almond Thins", "image": "https://images.yumprint.com/p1yumprintfr/frmXbOaIJqF808OPdVx4LiqmCMgZnmgwqyWoSj5v0Ac7k5sViX69TIZQHLNeghwZ", "link": "http://healthylivinghowto.com/1/post/2011/09/polly-want-a-cracker.html", "ingredients": ["3/4 c. (3 oz.) Almond Flour", "1 Egg White", "1/8 tsp. Garlic Powder", "1/8 tsp. Onion Powder", "3/8 tsp. Celtic Sea Salt"], "directions": ["Mix all ingredients well in a small bowl.", "In between two pieces of parchment paper roll out dough until about 1/8 inch thick.", "Score with a pizza cutter into squares.", "Bake at 325º for 12-15 minutes, or until golden brown.", "Recipe Tips", "When measuring almond flour, I use a spoon and fill the measuring cup. DO NOT PACK, but level with a knife. If using a kitchen scale, it is 3 oz. Pictured below is a double recipe, rolled out thin, and placed directly on the rack in my oven on doubled-up parchment paper."]}, {"id": "JuI1", "title": "Anti-Inflammatory Turmeric Hummus", "image": "https://images.yumprint.com/p1yumprint9p/9pEJXA40HEyvHxjdQzi9Y3kGzCMl9oM-yyOySsTW4wsBkruP9fX3FuBCWPODvflT", "link": "https://www.drlivingood.com/blog/anti-inflammatory-turmeric-hummus", "ingredients": ["1/4 cup tahini", "2 tbsp fresh lemon juice", "2 tbsp olive oil", "1 tsp sea salt", "1 clove garlic", "4 tbsp water (or juice from the chickpeas)", "1 tsp turmeric"], "directions": ["In a food processor or high-powered blender, add all ingredients except the water or chickpea juice.  Pulse a few times to get everything mixed.  While still running, add the water until you get the consistency that you like.  Run the processor until the hummus is creamy and smooth. Serve with your favorite vegetables!"]}, {"id": "nub7", "title": "Applebees Copycat Spicy Queso Blanco", "image": null, "link": null, "ingredients": ["1 tablespoon refined coconut oil (or other neutral oil)", "1 small onion, divided", "2 - 4 jalapeno peppers, seeded, deveined, and minced (divided)", "½ cup heavy cream", "8 ounces Monterey Jack cheese, cut into chunks", "4 ounces white American cheese, cut into chunks", "1 ½ tablespoons fresh chopped cilantro, divided", "1 Roma tomato, deseeded and diced"], "directions": ["Cut onion in half and mince one half. Set aside.", "Warm oil in a small saucepan over medium heat. Add 2/3 of minced jalapeno and grate ½ onion into pan. Stir to coat and cook for 3-5 minutes until tender. Add cream and bring to a bubble. Add cheese a little at a time, stir until cheese is melted. Stir in 1 tablespoon cilantro.", "To create a simple pico de gallo: Combine chopped onion, tomato, ½ tablespoon cilantro, and remaining jalapeno in a bowl.", "Pour queso blanco into a medium size serving bowl (2 ½ cup or larger). Top with pico de gallo. Serve and enjoy!", "COOK’S NOTE: Adjust jalapenos according to the heat you would like. For mild heat, add less. For a spicier dip add more.", "Makes 2 cups."]}, {"id": "oNiT", "title": "Artichoke & Parmesan Stuffed Mushrooms", "image": "https://images.yumprint.com/p1yumprintea/EayeCn0Kotz_zH61W6kDCEpT5A6Bk5m6HvoBtMeEz-3qwc5IcFu__4JMQpHC2Uhs", "link": "http://www.eatingwell.com/recipes/artichoke_parmesan_stuffed_mushrooms.html", "ingredients": ["24 medium cremini (baby bella) or white mushrooms", "4 teaspoons extra-virgin olive oil, divided", "2 tablespoons minced shallot", "2 cloves garlic, minced", "1/2 cup drained marinated artichoke hearts, chopped", "3 tablespoons panko breadcrumbs, divided", "2 tablespoons grated Parmesan cheese", "2 tablespoons low-fat mayonnaise", "1/8 teaspoon dried thyme", "1/4 teaspoon salt", "1/4 teaspoon ground pepper"], "directions": ["Position rack in upper third of oven; preheat broiler to low. Coat a 9-by-13-inch metal baking pan with cooking spray.", "Remove and finely chop mushroom stems. Heat 1 teaspoon oil in a medium skillet over medium heat. Add the stems, shallot and garlic and cook, stirring, until the liquid is evaporated, about 5 minutes. Transfer to a bowl and stir in artichoke hearts, 2 tablespoons breadcrumbs, Parmesan, mayonnaise and thyme.", "Toss the mushroom caps in another bowl with 2 teaspoons oil, salt and pepper. Stuff each with filling and place in the prepared pan. Combine the remaining 1 tablespoon breadcrumbs and 1 teaspoon oil and sprinkle on the mushrooms.", "Broil on the upper rack until the mushrooms are soft and the breadcrumbs are golden, 15 to 20 minutes."]}, {"id": "ybqC", "title": "Asparagus-Mushroom Mini Lasagnas", "image": "https://images.yumprint.com/p1yumprint4j/4JcvS4qUD9186Gti1cUlzcYG8LvuPzdBFSM4PkPbQ3M0oIUG4uoIaXXG8FuwJVF2", "link": "http://www.eatingwell.com/recipes/asparagus_mushroom_mini_lasagnas.html", "ingredients": ["Canola or olive oil cooking spray", "1 cup low-fat milk", "1 tablespoon all-purpose flour", "3/4 cup grated Asiago cheese", "1/8-1/4 teaspoon white or black pepper", "1 tablespoon extra-virgin olive oil", "1 large shallot, finely chopped", "2 cups chopped baby bella mushrooms", "1/4 teaspoon salt", "2 cups thinly sliced asparagus (from 1 bunch)", "24 wonton wrappers", "1 cup part-skim ricotta cheese", "1/4 cup prepared pesto"], "directions": ["Whisk milk and flour in a small saucepan. Bring to a boil over medium-high heat, whisking constantly, until bubbling and thickened enough to coat the back of a spoon, about 3 minutes. Remove from heat and whisk in Asiago and pepper to taste.", "Heat oil in a large skillet over medium-high heat. Add shallot, mushrooms and salt and cook, stirring occasionally, until the mushrooms release their liquid, 3 to 5 minutes. Add asparagus and cook, stirring, until just beginning to soften, about 3 minutes.", "Place a wonton wrapper into the bottom and partway up the sides of each muffin cup. Combine ricotta and pesto in a medium bowl. Spoon about 2 teaspoons of the ricotta mixture into each muffin cup. Spread about 2 teaspoons of the Asiago sauce over the ricotta and top with about 1 tablespoon of the vegetable mixture. Place another wonton wrapper over the filling, pressing down gently to form a “cup.” The corners of the wrappers will stick up, forming 4 little points. Repeat with another layer of the ricotta mixture, Asiago sauce and vegetables. Coat the tops with cooking spray.", "Bake the mini lasagnas until the tips of the wonton wrappers are golden brown and the filling is bubbling, 18 to 20 minutes. Let cool in the pan for 5 minutes. Loosen and remove with a paring knife. Serve warm."]}, {"id": "KUv8", "title": "Avocado and chickpea hummus", "image": "https://images.yumprint.com/p1yumprintqp/qPD0TufkgWHG7RBnjRR1LdUaeWM1P3MXj4s958ClqBQBB_ekhs58Pm53yM265jmZ", "link": "https://cooktopcove.com/2017/01/05/watch-how-to-make-a-healthy-avocado-and-chickpea-mash-sandwich-/?src=bottomxpromo&ro=6&et=fbsub_slowcookerkitchen&eid=50785_s&pid=50785&t=sxp", "ingredients": ["1 15.5-ounce can chickpeas, drained and rinsed", "1 ripe avocado", "1 large clove garlic", "¼ teaspoon paprika", "1 lemon, juiced", "Salt and pepper to taste"], "directions": ["Put all ingredients, from chickpeas to lemon juice, in a food processor. Season with salt and pepper to taste.", "Blend everything together until smooth."]}, {"id": "CE_x", "title": "Avocado Hummus", "image": "https://images.yumprint.com/p1yumprintjj/jJHV4IsAeDl7AN4j1zshugdHT1HkveQYnX4GvtuRZLlBvIllrrynktn8hTTpXmWW", "link": "http://www.eatingwell.com/recipe/256572/avocado-hummus/", "ingredients": ["1 (15 ounce) can no-salt-added chickpeas 1 ripe avocado, halved and pitted 1 cup fresh cilantro leaves ¼ cup tahini ¼ cup extra-virgin olive oil ¼ cup lemon juice 1 clove garlic 1 teaspoon ground cumin ½ teaspoon salt"], "directions": ["Drain chickpeas, reserving 2 tablespoons of the liquid. Transfer the chickpeas and the reserved liquid to a food processor. Add avocado, cilantro, tahini, oil, lemon juice, garlic, cumin and salt. Puree until very smooth. Serve with veggie chips, pita chips or crudités."]}, {"id": "KUv-", "title": "Avocado Hummus", "image": "https://images.yumprint.com/p1yumprint1w/1W0nr7JLSLW608AVpUGOKuLPFhJ67ZFYuUd4FxBobJI6_iElthtyPqHlvTn6eA8m", "link": "http://www.healthy-holistic-living.com/homemade-guacamole-and-hummus-dip-recipe.html", "ingredients": ["1 cup of cooked and cooled (or jarred) organic chick peas", "1 organic lemon, juiced", "As much or as little organic cilantro as you like (I usually use about a small handful)", "2 teaspoons of organic extra virgin olive oil", "½ of an organic avocado", "Pink Himalayan salt and pepper to taste", "Opt. half of an organic jalapeño, seeds removed."], "directions": ["Now you can prepare this dip one of two ways. If you want a more smooth and creamy consistency you can chuck everything in a blender for about a minute until everything is combined. Or you could do what I do, for a more textured snack.", "When I’m eating something I like to know what’s in it, so that’s why more often I skip blending and prepare the dip by hand. I put all of the ingredients, except the cilantro, in a mixing bowl and mashed it all together with a fork, but you can use whatever you prefer. Once everything is to the consistency I like, I put most of the cilantro in and fork it through. Then I put however much I want into a small bowl and top it with the rest of the cilantro."]}, {"id": "HQq1", "title": "Avocado Pesto", "image": "https://images.yumprint.com/p1yumprintkl/KLJYcQHt5-t37EQeyMcOLkbaUhLCkg8NNyd7iSLmlSO27pBvoqvXDRa8UJFbSNm-", "link": "http://www.eatingwell.com/recipe/251078/avocado-pesto/?utm_medium=social&utm_campaign=etg_20180411_editorialcontent", "ingredients": ["1 large bunch fresh basil2 ripe avocados", "½ cup walnuts or hemp seeds2 tablespoons lemon juice", "3 cloves garlic½ teaspoon fine sea salt", "½ cup extra-virgin olive oilGround pepper to taste"], "directions": ["Strip basil leaves from the stems and add to a food processor along with avocados, walnuts (or hemp seeds), lemon juice, garlic and salt; pulse until finely chopped. Add oil and process to form a thick paste. Season with pepper.", "Make Ahead Tip: Press a piece of plastic wrap directly on the surface to prevent browning and refrigerate for up to 5 days."]}, {"id": "ugfd", "title": "Baked Butternut Squash Chips", "image": "https://images.yumprint.com/p1yumprintam/aMGCzMrkBt-imCcC6WFIjPoHiO_-YOONjAU2TLi7K3Ry8QPI8WeasUg-um6AuvLy", "link": "http://www.acouplecooks.com/2012/02/baked-butternut-squash-chips/", "ingredients": ["2 butternut squashes with long necks", "Parmesan cheese", "Olive oil", "Kosher salt"], "directions": ["Preheat the oven to 375°F. Bring a large pot of salted water to a boil.", "Cut the necks of the squashes off of the bases, and peel each neck. Using a sharp knife or mandoline, slice each squash into thin slices, about ⅛th of an inch thick.", "Drop the slices into the boiling water and boil for 2 minutes (this allows the squash to become crispy when baked). After 2 minutes, carefully drain and rinse the slices until they are cool to the touch. Pat the slices dry with a towel to remove excess water.", "Cover two baking sheets with parchment paper and place the slices on top, taking care that the slices do not touch. Brush the slices with a bit of olive oil, sprinkle with kosher salt, and top with finely grated Parmesan cheese.", "Bake the chips until crispy, about 15-20 minutes. Watch carefully and remove the chips once they turn brown and crispy – the timing for your oven may be shorter or longer. You may need to remove the chips in intervals, depending on the evenness of the slice thickness and oven heat. (Alternatively, you can microwave the chips; each batch takes about 10 minutes on high power.)", "Once cooled, store the chips in an airtight container for up to one week."]}, {"id": "jova", "title": "Baked Cream Cheese Wontons", "image": "https://images.yumprint.com/p1yumprint3r/3rNa23f5_KWca0VRPjZfaL2fI1RQAQ5hjaUMP1HnScC198GD2z8u9FIbRwzmm0Pc", "link": "http://damndelicious.net/2014/09/08/baked-cream-cheese-wontons/", "ingredients": ["8 ounces medium shrimp, peeled, deveined and roughly chopped", "4 ounces cream cheese, at room temperature", "2 cloves garlic, minced", "2 green onions, thinly sliced", "1 tablespoon freshly grated ginger", "1 teaspoon sesame oil", "1 teaspoon Sriracha, optional", "Kosher salt and freshly ground black pepper, to taste", "16 2-inch won ton wrappers", "1 large egg, beaten"], "directions": ["Preheat oven to 400 degrees F. Lightly oil a baking sheet or coat with nonstick spray.", "In a large bowl, combine shrimp, cream cheese, garlic, green onions, sesame oil, Sriracha, salt and pepper, to taste.", "To assemble the wontons, place wrappers on a work surface. Spoon 1 1/2 teaspoons of the mixture into the center of each wrapper. Using your finger, rub the edges of the wrappers with egg. Fold all sides over the filling to create an \"X\", pinching the edges to seal.", "Place wontons in a single layer onto the prepared baking sheet. Place into oven and bake for 10-12 minutes, or until golden brown and crisp.", "Serve immediately."]}, {"id": "JnjR", "title": "Baked Eggplant Fries with Goat Cheese Dip Recipe", "image": "https://images.yumprint.com/p1yumprintoj/OJ4_Bmelb8xoQH8K1WMVctHswTlby9OyKUsU24IJjt2YN2icvIKaKXC1cJcH-cZD", "link": "https://gourmandeinthekitchen.com/gluten-free-baked-eggplant-fries-with-goat-cheese-dip/", "ingredients": ["4 ounces/113g goat cheese", "1/4 cup/ 60ml goat milk or goat milk kefir (or regular milk if you can’t find goat milk)", "the juice of half a lemon", "1/4 teaspoon sea salt", "Freshly ground black pepper"], "directions": ["Preheat oven to 425 degrees F. Line a baking sheet with lightly greased parchment paper .", "Cut the eggplant in half then into thin slices lengthwise and cut those into batons about the size of French fries.", "Stir together the arrowroot flour almond flour and salt and divide evenly onto two shallow plates.", "In a separate bowl whisk together the coriander, cumin and cayenne pepper with the coconut oil and egg.", "Roll the eggplant fries into the into the almond flour mixture on the first plate, then quickly dip into the egg mixture and then into the second plate of almond flour.", "Place the eggplant fries evenly onto the baking sheet and sprinkle with an extra pinch of sea salt.", "Bake for 15 to-20 minutes(depending on how think your fries are) or until crispy and browned. Serve with goat cheese dipping sauce."]}, {"id": "AQvq", "title": "Baked Fontina Dip", "image": "https://images.yumprint.com/p1yumprintji/jI0wKur1xDxKoqM5cxveBdxBSjZ6kyw6uFoXfcUUEb8fbmV9ybmuSbbwgjoP0sNt", "link": "http://12tomatoes.com/appetizer-recipe-baked-italian-fontina-cheese-and-herb-dip/?utm_source=12t-12t&utm_medium=social-fbgla&utm_campaign=appetizer-recipe-baked-italian-fontina-cheese-and-herb-dip-ppe", "ingredients": ["2 pounds Italian Fontina cheese, rind removed, cubed (1-2-inch cubes)", "1/2 cup extra-virgin olive oil", "8 cloves garlic, thinly sliced", "1 1/2 tablespoons thyme leaves, minced", "1 1/2 tablespoons rosemary leaves, minced", "1-2 French baguettes, sliced", "Salt and freshly ground pepper, to taste"], "directions": ["Place oven rack in upper portion of oven, 5 inches from the heat. Preheat broiler.", "Take a large, cast-iron skillet and spread an even layer of Fontina cubes along the pan. Drizzle olive oil on top.", "Sprinkle garlic, rosemary, thyme, salt and pepper over the top.", "Place in oven and bake for 5-6 minutes, until cheese is bubbly and starting to brown. Pay close attention because it's easy for cheese to burn.", "Remove from oven and serve immediately, from skillet, dipping slices directly into the cheese. Be careful though, the skillet is really hot."]}, {"id": "lEvG", "title": "Baked Kale Crackers", "image": "https://images.yumprint.com/p1yumprint4h/4Hw19KyqiMbvvdJp77-R4qKyhkG_imj5oFi7wjZyWo86AaAerDKuQtl0h-aGeMIc", "link": "http://www.motherearthnews.com/real-food/baked-kale-crackers-recipe-ze0z1405zcov.aspx#axzz38bakfxJ7", "ingredients": ["• 6 leaves of Lacinto kale, deribbed", "• 2/3 cup ground almonds or mixture of walnuts, pecans, and almonds", "• 1/4 cup sesame seeds", "• 2 tablespoons chia seed", "• 1/4 cup nutritional yeast", "• 1/2 teaspoon salt", "• Dash pepper", "• 1 teaspoon curry powder, chili powder, chipotle powder, or other favorite spice"], "directions": ["Preheat oven to 250 degrees Fahrenheit.", "Line a baking sheet with parchment or aluminum foil.", "Add kale to the bowl of a food processor. Pulse until ground into a paste.", "Add remaining ingredients and pulse until combined.", "Using a silicone spatula, spread mixture onto prepared baking sheet. Score into crackers (make them on the small size; the crackers break easily when too large).", "Bake for 40 to 45 minutes."]}, {"id": "t0qf", "title": "Baked Vegetable Chips", "image": null, "link": "http://www.motherearthnews.com/real-food/baked-vegetable-chips-zmrz1201zalt.aspx", "ingredients": ["Mixed root vegetables, thinly sliced (You may want to peel some vegetables, such as beets, but with most, if you normally like eating the peels, you can leave them on.)", "Olive oil", "Kosher salt and freshly ground pepper", "Any herbs you have on hand (optional)"], "directions": ["Toss the vegetable slices in the oil and seasonings. Line a baking sheet with parchment paper and a single layer of veggie chips. Bake at 275 degrees Fahrenheit for 10 minutes, then flip the slices and bake another 15 minutes. Check the chips every few minutes, until they are crispy but not burnt. Serve warm or cool."]}, {"id": "ghN9", "title": "Baked Zucchini Fries", "image": "https://images.yumprint.com/p1yumprintmu/MU2EArxztpn6BhpMxiQ4w0-oPhFYKHAW93n2LRvUw6_LTELfkhXeCw6tSSFlWMFw", "link": "http://www.inspiredbycharm.com/2014/03/baked-zucchini-fries.html", "ingredients": ["1/2 cup mayonnaise", "2 tablespoons ketchup", "3 tablespoons horseradish sauce", "1/4 teaspoon paprika", "1/4 teaspoon salt", "1/4 teaspoon oregano", "1/8 teaspoon black pepper", "1/8 teaspoon cayenne pepper"], "directions": ["Preheat your oven to 425 degrees F. Spray a baking sheet with cooking spray and set aside.", "In a shallow dish, combine the Panko, Parmesan cheese, oregano, paprika, salt, and pepper. Mix well.", "In a small bowl, whisk two eggs.", "Dip the zucchini sticks in the eggs and then into the Panko mixture. Coat evenly. Then, place the coated zucchini sticks onto the prepared baking sheet.", "Bake for about 20 minutes, turning once about halfway through, until golden brown and crispy.", "To make the dipping sauce, place all of the ingredients in a bowl; then whisk until combined."]}, {"id": "w225", "title": "Basic Healthy Hummus Recipe", "image": "https://images.yumprint.com/p1yumprintlt/lt8YPbA_QXrpHJ7ayiA0ncrIbSGRAeWiTVWNZd-TQmNSMTS2qzac9hUl2JUi-620", "link": "http://www.healthy-holistic-living.com/hummus-health-benefits.html", "ingredients": ["2 cans of chickpeas beans or 2 cups of cooked sprouted chickpeas", "1/4 cup of lemon juice", "1 tablespoon of extra virgin olive oil", "1/4 cup of tahini", "1 peeled garlic clove", "1 teaspoon of cumin", "Grey Celtic sea salt to taste"], "directions": ["Drain canned chickpeas. If cooking dry chickpeas soak them for about an hour, then place them in a large pot and cover with water. Bring it to a boil, and let them boil for five minutes. Remove them from the heat, and let them soak for one hour in the hot water. Then drain the water and rinse the chickpeas before cooking.", "To cook the chickpeas, put them in a large pot, and use about one quart of water per 1 cup of soaked chickpeas. Bring to a boil, reduce to a simmer, and let them cook until tender for about 60 to 90 minutes. When they are cooked, drain them, and they are ready to use for the hummus.", "For the hummus, place all the ingredients in the blender, and blend until smooth. Add more olive oil or water to reach your desired consistency.", "Some people have problems digesting all legumes, including chickpeas. As an alternative, try to replace the chickpeas with two cups of peeled and chopped zucchini and half of an avocado. Also, add another tablespoon of olive oil for flavor. This zucchini hummus will store in the refrigerator for four days."]}, {"id": "vLIP", "title": "Bite-Size Artichoke Dip Poppers", "image": "https://images.yumprint.com/p1yumprintqm/qmS5_eIDS2xGnSzBnhiVuy7nUbC_3Bnze8KurlRAesaZdR2JmIn_jK511nv0KOED", "link": "https://www.yahoo.com/food/the-best-party-app-ever-bite-size-artichoke-dip-121927446768.html", "ingredients": ["2 cans artichoke hearts, coarsely chopped", "1 c mayonnaise", "1 c grated parmesan cheese", "1 lemon", "2 tbsp chives, chopped", "salt and freshly ground pepper", "wonton wrappers (about 3 dozen)", "vegetable oil"], "directions": ["Combine the artichoke hearts, mayonnaise, parmesan, juice of ½ of the lemon juice, 1 teaspoon of the zest, a big pinch of salt and lots of freshly ground pepper in a food processor. Pulse together into a fairly smooth texture.", "In a deep, heavy-bottomed pot, preheat oil to 375 degrees F.", "On a lightly floured surface, lay out the wonton wrapper (keeping the stack of wrappers covered with a damp paper towel.) Spoon a tablespoon of the dip into the center of the wonton wrapper, and then using a dampened finger, moisten the edges. Fold over, and without trapping air in the pocket, seal the popper. Repeat, covering the assembled poppers with a damp paper towel until finished.", "Fry the poppers for 2 minutes, until golden brown and crisp. Drain on a paper towel lined plate and season immediately with salt. Slice the remaining lemon half and squeeze over the poppers and enjoy."]}, {"id": "J2sy", "title": "Broccoli Cheesy Bread", "image": "https://images.yumprint.com/p1yumprintsn/SnlA0SmFJwfxIuo8T7GqVT8YYEqHo6w1jAStBPYYZ-XrKErNJy-ywC9FyEfxIIt6", "link": "https://www.delish.com/cooking/recipe-ideas/a20720559/best-broccoli-cheesy-bread-recipe/?fbclid=IwAR1BlCifoysink02QQL4JfmFOB_prYX-7gQIt6JXytSuZQMCUeIPRdZ5v20", "ingredients": ["3 c. riced broccoli", "1 large egg", "1 1/2 c. shredded mozzarella", "1/4 c. freshly grated Parmesan", "2 cloves garlic, minced", "1/2 tsp. dried oregano", "Kosher salt", "Freshly ground black pepper", "Pinch crushed red pepper flakes (optional)", "2 tsp. freshly chopped parsley", "Warmed marinara, for serving"], "directions": ["Preheat oven to 425° and line a large baking sheet with parchment paper. Microwave riced broccoli for 1 minute to steam. Carefully ring out extra moisture from the broccoli using paper towel or cheese cloth.", "Transfer broccoli to a large bowl and add egg, 1 cup mozzarella, Parmesan, and garlic. Season with oregano, salt, and pepper. Transfer dough to baking sheet and shape into a thin, round crust.", "Bake until golden and dried out, 20 minutes. Top with with remaining 1/2 cup mozzarella and bake until cheese is melted and crust is crispy, 10 minutes more. Garnish with parsley and pepper flakes if using. Serve warm with marinara."]}, {"id": "vLGm", "title": "Cannellini Bean Dip", "image": "https://images.yumprint.com/p1yumprintej/Ejfif4aI04lCsrbZa-IUpkoKoyUra8MawYZikDSYQbjWb-wuSXULJ3c1sBxz5dQ-", "link": "https://www.yahoo.com/food/cannellini-bean-dip-from-jacques-p%C3%A9pin-heart-and-175242478.html", "ingredients": ["One 1-pound can cannellini beans, drained (about 1 ¾ cups)", "1 large garlic clove, crushed", "½ cup diced bread", "¼ cup olive oil", "1 tablespoon water", "¼ teaspoon ground cumin", "½ teaspoon salt", "½ teaspoon Tabasco sauce", "Garnishes", "1/3 cup reserved beans (from above)", "2 teaspoons extra-virgin olive oil", "¼ teaspoon paprika", "½ teaspoon poppy seeds", "1 teaspoon chopped fresh parsley", "3 or 4 tostadas or hard taco shells, broken into wedges, or toasts or rice crackers"], "directions": ["For the dip: Reserve 1/3 cup of the beans for garnish. Put the remaining beans in a blender or food processor. Add all the remaining ingredients and process until very smooth, scraping the bowl with a rubber spatula a few times if need be to help combine the ingredients.", "Transfer the dip (you should have about 2 cups) to a shallow serving dish and create a well in the center.", "For the garnishes: Put the reserved beans in the well in the dip and pour in the olive oil. Sprinkle with the paprika, poppy seeds, and parsley. Serve surrounded by the tostadas or tacos, toasts, or crackers."]}, {"id": "vLIJ", "title": "Caramelized Onion and Bacon Dip from ‘Martha Stewart’s Appetizers’", "image": "https://images.yumprint.com/p1yumprintro/rOX8TIfnYxq7Kii20JXGAT0IHoIoS-ev0gM0ppJCwl-srh_Z7j4tDDekPnCuxloE", "link": "https://www.yahoo.com/food/caramelized-onion-and-bacon-dip-from-martha-128280972866.html", "ingredients": ["2 tablespoons extra-virgin olive oil", "3 pounds yellow onions (about 8 large), halved and thinly sliced", "Coarse salt and freshly ground pepper", "¼ cup red-wine vinegar", "1 tablespoon chopped fresh thyme leaves", "4 ounces bacon, chopped", "1 bar (8 ounces) cream cheese, room temperature", "1 cup sour cream", "Safflower oil, for frying", "4 shallots, thinly sliced into rings"], "directions": ["The dip can be refrigerated, covered, up to 3 days; top with shallots just before serving. Fried shallots will keep up to 1 week at room temperature in an airtight container.", "Give a little inspiration to your friends this New Year's Eve with cookies filled with happy messages, good wishes, and resolutions. Perfect for the holidays, they're also a fun bridal shower or party favor - just change the messages to reflect the occasion. From Alyssa Noui, POPSUGAR Food Pirouette New Year's Cookies Notes The cookies begin to cool and harden right away so begin with 4 until you get fast enough to add one more. Then you can alternate sheet pans every 2-3 minutes. Start with the brownest ones first they will harden the fastest. You will not be moving away from your oven so have all utensils at hand. Ingredients1 cup (16 tablespoons) butter, at room temperature 1 cup sugar 4 egg whites 1 teaspoon vanilla 1 cup flour 40-50 1-by-2 1/2-inch paper strips 40-50 6-inch-square foil wrappesr or wax paper Ribbon Directions Preheat oven to 400°F. Cream the butter, sugar, egg whites, and vanilla until light and fluffy. Slowly add the flour and mix until just blended. Half cup at a time, place the dough into a tempered glass measuring cup and microwave for 15 seconds until pourable. Trace 4-5 3-inch diameter circles on one side of parchment paper. Place paper ink-side down on a half sheet pan. Spoon 1-1 1/2 teaspoons of the batter over a circle template and use the back of the spoon to smooth it into a thin, round layer within in the circle, similar to a crepe. (Thinner is better than too thick; you can tell it’s too thin if you can see the baking sheet through the batter.) Have a cooling rack, offset spatula, and wooden spoon available. Bake for 4-6 minutes. At the first sign of browning around the edges remove the pan. Working quickly, use the offset to lift the soft cookie on to the wooden spoon. Carefully using your fingers - it will be hot - roll the cookie around the spoon handle, pressing the edge into the seam. Place seam side down on rack. Once the cookies are cool, roll paper strips with New Year's resolution messages into a tight roll and insert into the cookie. Roll the cookie in foil, twist sides, and tie with ribbon. Information Category Desserts, Cookies Yield 40-50 cookies Cook Time 1 hour Average( votes): Print recipe"]}, {"id": "neQf", "title": "Cauliflower Tots", "image": "https://images.yumprint.com/p1yumprintnn/nNyso980dOiUERlmtELiuXdg2TkFh_XerxbCNB14o5fGd7EVfWlGAOAUOVNNu0Kt", "link": "http://www.skinnytaste.com/2013/11/cauliflower-tots.html", "ingredients": ["2 cups cooked cauliflower florets, finely chopped *see note", "1 large egg", "1 large egg white", "1/2 cup onion, minced", "3 tbsp minced fresh parsley", "1/2 cup reduced fat sharp cheddar cheese, grated", "1/2 cup seasoned breadcrumbs", "salt and pepper to taste", "cooking spray"], "directions": ["to cook the cauliflower florets, steam a little over 2 cups raw cauliflower florets in a little water covered for for 4 to 5 minutes or until tender but not mushy, then drain well and dry on paper towel, then using a knife finely chop and set 2 cups aside.", "Preheat oven to 400°F.  Spray a nonstick cookie sheet with cooking spray.", "In a medium bowl, combine all of the ingredients and season with salt and pepper to taste.", "Spoon 1 tablespoon of mixture in your hands and roll into small ovals. Place on the cookie sheet and bake for 16-18 minutes, turning halfway through cooking until golden."]}, {"id": "KoiU", "title": "Cheddar Chive Cauliflower Bites", "image": "https://images.yumprint.com/p1yumprintbh/Bh2fslAB6nU4GlelHb9-LN73WHxcG1aLR6qWG4IAhtRh06JjT95QApcHGvBRASa-", "link": "https://marisamoore.com/cheddar-cauliflower-bites/?fbclid=IwAR3Lg-GN6Pj78GzaUhDecJXMpQcT3B_7E13XtQ-ubWrRdh_W5jeh-NXtobo", "ingredients": ["2 eggs", "¼ tsp coarse salt", "¼ tsp cracked black pepper", "16 oz. riced cauliflower (about 5 ½ cups)", "4 oz. shredded Cabot Seriously Sharp Cheddar Cheese (about 1 cup)", "½ cup chopped fresh chives plus more for garnish", "Oil for pan prep, as needed"], "directions": ["Preheat oven to 400ºF. Prepare a 24 mini muffin tin with liners or oil as needed.*", "Beat the eggs with the spices in a large bowl. Add the cauliflower, shredded cheese, and chives. Stir until well combined.", "Spoon the mixture to the top of the muffin tin wells. Bake 20-25 minutes until the cheese is golden and the bites are cooked through. Let cool in the pan 3-5 minutes. Remove from the pan and transfer to a cooling rack if not serving right away. Serve warm or at room temperature."]}, {"id": "z1Cx", "title": "Cheese Stuffed Italian Meatballs", "image": "https://images.yumprint.com/p1yumprint0p/0Pm6hrxhEe0q4_nzOWvkeJgH9XjvORlUIyqTZKPrFON67Oz-oiuY9hbktvDecXXs", "link": "https://www.pamperedchef.com/pws/kris/recipe/Appetizers+%26+Snacks/Italian/Cheese+Stuffed+Italian+Meatballs/1101006", "ingredients": ["2 slices white sandwich bread, torn", "1 lb (450 g) 90% lean ground beef", "1   egg, beaten", "1/2 cup (125 ml) grated Parmesan cheese", "1/4 tsp (1 mL) salt", "2 tsp (10 mL) Italian seasoning", "2 sticks (1 oz/30 g each) part-skim mozzarella string cheese", "1 cup (250 mL) marinara sauce, warmed"], "directions": ["Prepare grill for direct cooking medium-high heat (400-450°F/200-230°C).", "Place torn bread into Manual Food Processor and process until finely chopped. In large mixing bowl, combine bread crumbs, ground beef, egg, cheese, salt and Italian seasoning; mix gently, but thoroughly.", "Slice each string cheese stick into 6 pieces (12 total).", "Spray wells of Meatball & Slider Grill Basket with nonstick cooking spray.", "Using Large Scoop, shape meat mixture into 12 balls. Press one piece of string cheese into the middle of each ball, ensuring string cheese is fully encased with meat.  Place into wells of Basket. Repeat with remaining meatballs.", "Place Basket onto grid of grill. Grill, covered, for 8-10 minutes, turning halfway through grill time or until internal temperature reaches 160°F/71°C (for well-done). Remove from grill.", "Meanwhile, pour marinara sauce in Small Micro-Cooker®. Microwave, covered, on HIGH 2-3 minutes or until hot. Serve meatballs with sauce.", "Yield:", "12 meatballs", "2 servings of meatballs and 2 tbsp /30 mL sauce", "Nutrients per serving:", "Calories 120, Total Fat 7 g, Saturated Fat 3 g, Cholesterol 45 mg, Sodium 280 mg, Carbohydrate 5 g, Fiber 1 g, Protein 11 g", "Cook's Tips:", "For a hot meatball sandwich, split 4 hoagie buns filled with 3 meatballs; top with warm marinara sauce and shredded mozzarella cheese.", "", "Oven Directions: Preheat oven to 450 F/230 C. Place Meatball & Slider Basket on a large sheet pan to catch drippings. Bake for 18-20 mins or until temperature reaches 160 F/71 C, turning basket over halfway through cooking."]}, {"id": "nePO", "title": "Cheesy Baked Cauiflower Tots", "image": "https://images.yumprint.com/p1yumprint7c/7csdeVl-msXxECpTI_cUkIw6tI32ESEp2ZrqeawVf-HlXA1kDJP3bySlB_v6oR5t", "link": "http://www.kalynskitchen.com/2014/03/cheesy-baked-cauliflower-tots.html", "ingredients": ["1/2 large head caulflower, coarsely chopped", "1/3 cup reduced-fat sharp cheddar", "1/4 cup coarsely grated Parmesan cheese", "2 T almond flour", "1/2 tsp. Vege-Sal (or a slightly smaller amount of salt)", "1/2 tsp. Spike Seasoning (Probably optional, but it does add flavor.  You can substitute another all-purpose seasoning blend that tastes good with cauliflower)", "fresh-ground black pepper to taste", "1 egg"], "directions": ["Preheat oven to 400F/200C.  Spray a Mini Muffin Pan with non-stick spray.", "Cut away the leaves of the cauliflower, but use most of the inner core part.  Coarsely chop the cauliflower, place in a micro-wave proof bowl, cover with cling wrap, and microwave 2 minutes on high.  (Microwaves can vary so you may need to experiment with the time, but the cauliflower should be just slightly soft.)  Quickly take off the cling-wrap and let the steam escape, and if you see any water in the bottom of the bowl, put the cauliflower into a colander and let the water drain off.", "Put the steel blade in the food processor, add the cauliflower, and pulse until the cauliflower is finely chopped but still slightly chunky.  (Be careful not to over process so you don't end up with cauliflower puree!)  If there is any water in the food processor bowl, drain the cauliflower again in the colander.", "Put finely chopped cauliflower into a bowl and add the reduced-fat sharp cheddar, coarsely grated Parmesan, almond flour, Vege-Sal or salt, Spike Seasoning (if using), and fresh-ground black pepper. Stir until ingredients are well-combined.  Add the egg and stir until the ingredients are mostly coated with egg.  (You might be tempted to add another egg, but don't.  You'll be surprised how well this sticks together.)", "Use a One Tablespoon Cookie Scoop or a steel one-tablespoon measuring spoon to scoop out rounded spoonfuls of the mixture and place it in the mini muffin pan.  Bake 15 minutes.  Carefully turn each cauliflower tot over in the muffin tin and bake 15 minutes more, or until tots are nicely browned on both sides.  Serve hot; these are best served right out of the oven."]}, {"id": "AGqj", "title": "Cheesy BLT Bites", "image": "https://images.yumprint.com/p1yumprint3l/3LNdp2-JlCwTQwzpHepi6fgHs7NapZO8cqCRjqFpDKK2kJ0buliPZMXYCjfn86uI", "link": "http://www.mommypotamus.com/blt-stuffed-cherry-tomatoes/", "ingredients": ["20 cherry tomatoes (the bigger the better)", "8 pieces of bacon, cooked and crumbled", "½ cup cream cheese (full­fat)", "2 tbsp finely chopped spinach", "1½ tbsp grated parmesan cheese", "dash of sea salt"], "directions": ["Sit tomatoes on your cutting board. Cherry tomatoes will sit flat when placed top down (where they were attached to the stem faces your countertop). Once they are all sitting flat, slice a sliver off the top.", "Scoop out the pulp and seeds and set aside. You can discard or use for making salsa, pasta sauce, etc. I used my 1⁄4 tsp measuring cup to easily scoop out the pulp. A regular spoon was much too big for the job.", "In a bowl, combine the remaining ingredients and mix. Spoon the filling into each tomato (again I used my 1⁄4 tsp measuring cup). To crumble the bacon I placed the cooked strips in unbleached parchment paper and crumpled it with my hand. Keep refrigerated, serve and enjoy!"]}, {"id": "Lgzw", "title": "Cheesy Christmas Tree Bread", "image": null, "link": "https://www.agoudalife.com/cheesy-christmas-tree-bread/#more-13245", "ingredients": ["13 ounce canned refrigerator pizza dough", "parchment paper for lining baking sheet", "6-7 mozzarella cheese sticks", "1 large egg + 1 tablespoon water for egg wash", "3 tablespoons butter melted", "1/2 cup grated parmesan cheese divided", "1 tablespoon fresh parsley finely chopped", "1/2 tablespoon fresh rosemary finely chopped", "1/2 tablespoon fresh basil finely chopped", "1 clove garlic grated", "1 jar marinara and/or pesto for dipping"], "directions": ["Preheat the oven to 400° then line a baking sheet with parchment paper.", "Cut the dough into 30 approximately equal squares then cut the mozzarella cheese sticks into 30 bite size pieces.", "Add a piece of mozzarella to each square of dough then form a ball, rolling with your hands to smooth and seal the edges.", "Place the balls on the prepared baking sheet seam side down in the shape of a tree (see photos) - so the balls are touching. Blend the egg and water in a small bowl and lightly brush each ball with the egg wash.", "Bake 16-18 minutes or until golden brown. While the bread is baking, microwave the butter until melted then stir in half of the parmesan cheese and all of the herbs. Brush onto the rolls, then sprinkle with the remaining parmesan cheese over the top then serve right away with marinara and/or pesto for dipping."]}, {"id": "rOD_", "title": "Cheesy Garlic Bombs", "image": "https://images.yumprint.com/p1yumprintv9/v9Zmn6AE3uCSJHJfQe5VztlH9TL3W47hc3tyi83TPuV8bH8Fs0sAYGKeNk4h24xJ", "link": "http://damndelicious.net/2015/07/17/cheesy-garlic-bombs/", "ingredients": ["1/4 cup unsalted butter, melted", "3 cloves garlic, minced", "1/2 teaspoon dried oregano", "1/2 teaspoon dried basil", "1/4 teaspoon salt", "1 (16-ounce) tube refrigerated buttermilk biscuits", "48 fresh mozzarella pearls, drained*", "1/4 cup freshly grated Parmesan", "2 tablespoons chopped fresh parsley leaves", "Save $5 on Any Fortify Probiotics."], "directions": ["Preheat oven to 425 degrees F. Lightly oil a 24-cup mini muffin tin or coat with nonstick spray.", "In a small bowl, whisk together butter, garlic, oregano, basil and salt; set aside.", "Halve each of the 8 biscuits, making 16 pieces. Working one at a time, use a rolling pin to flatten each piece to about 1/4-inch thickness. Add 3 mozzarella pearls to the center of each biscuit piece before rolling into a ball.", "Place into the prepared muffin tin and brush each ball with half of the butter mixture; sprinkle with Parmesan. Place into oven and bake until golden brown, about 8-10 minutes.", "Serve immediately, brushed with remaining butter mixture and garnished with parsley, if desired."]}, {"id": "yKWL", "title": "Cheesy Kale Chips", "image": "https://images.yumprint.com/p1yumprintln/ln9QM3tDvlF-lWu8eaShwA2YpDTyxAl8lM9wPBhEjVImfSzZ_-mkElmRb4H5Y7rV", "link": "http://nourishedkitchen.com/cheesy-kale-chips/", "ingredients": ["1 cup white miso paste", "2 cloves garlic, (minced)", "½ teaspoon unrefined sea salt", "1 cup nutritional yeast", "2 tablespoons extra virgin olive oil", "2 tablespoons dulse granules", "3 bunches curly kale, (trimmed of stems and torn into bite-sized pieces)"], "directions": ["Combine miso, garlic, salt, nutritional yeast, oil and dulse into a food processor, and process until it forms a smooth paste.", "Working in batches, place kale into a large mixing bowl. Massage kale with the seasoned miso paste so that the paste adheres to the kale leaves. Layer the kale onto a lined food dehydrator tray and dehydrate at 125 F until crispy - about 12 hours."]}, {"id": "Hfca", "title": "Chicken Empanadas", "image": "https://images.yumprint.com/p1yumprinteh/EHdbNdrbQflRt9JosGevOSzEc6U5WLQy0bQLMcKjF5-ZK2kHhOmx2VsR4D0p7JmK", "link": "http://www.eatingwell.com/recipe/262790/chicken-empanadas/?utm_source=facebook&utm_medium=social&utm_campaign=etg_c7370a58-e89f-4fa8-af7d-39f34d521913_editorialcontent&utm_content=newcontent&utm_term=new", "ingredients": ["Dough1½ cups all-purpose flour, plus more for dusting1½ cups white whole-wheat flour2 teaspoons sugar1 teaspoon kosher salt7 tablespoons cold unsalted butter, cut into ¼-inch pieces", "½ cup ice water", "1 large egg, lightly beatenSauce1 cup packed fresh cilantro1 large jalapeño pepper, seeded, if desired, and chopped2 cloves garlic1 large egg yolk4 teaspoons lime juice, divided½ cup canola oil½ teaspoon kosher saltFilling1 tablespoon canola oil1 small yellow onion, finely chopped4 cloves garlic, finely chopped¾ teaspoon kosher salt, divided2 tablespoons tomato paste¾ teaspoon ground cumin2 cups shredded cooked chicken½ cup low-sodium chicken broth3 large hard-boiled eggs, crumbled into ¼- to ½-inch pieces1 tablespoon melted butter, for brushing", "2 h"], "directions": ["To prepare dough: Pulse all-purpose and whole-wheat flours, sugar and 1 teaspoon salt in a food processor. Add butter and pulse until the butter is pea-size and the mixture looks like coarse sand, 6 to 8 times. Add water and beaten egg and pulse until the dough starts to come together into a ball. Turn the mixture out onto a lightly floured work surface and pat it into an oval disk. Wrap in plastic and refrigerate for 1 hour. Meanwhile, prepare sauce: Pulse cilantro, jalapeño and 2 garlic cloves in a mini food processor until finely chopped, scraping down the sides once or twice. Transfer to a small bowl. Add egg yolk and 2 teaspoons lime juice to the mini food processor and pulse until smooth. With the motor running, add ½ cup oil in a thin, steady stream and process until creamy. Add the cilantro mixture, the remaining 2 teaspoons lime juice and ½ teaspoon salt and pulse until well combined. Set aside. To prepare filling: Heat oil in a medium skillet over medium heat. Add onion, garlic and ¼ teaspoon salt. Reduce heat to medium-low and cook, stirring occasionally, until the onion is soft and lightly browned, 6 to 8 minutes. Add tomato paste and cumin; cook, stirring frequently, for 1 minute. Add chicken and broth; cook, stirring and breaking up the chicken slightly, until the broth has almost completely evaporated but the mixture still looks moist, 3 to 5 minutes. Season with the remaining ½ teaspoon salt. Preheat oven to 400°F. Coat a large baking sheet with cooking spray. Divide the dough into 8 equal portions on a floured work surface. Form each into a ball and roll out into a 6-inch circle. Scoop ¼ cup of the filling onto the center and sprinkle with 1 generous tablespoon egg. Fold in half, firmly press the edges together to seal and crimp with a fork. Transfer to the prepared baking sheet. Brush with butter. Bake the empanadas until light golden brown, 25 to 30 minutes. Transfer to a wire rack to cool slightly. Serve warm or at room temperature with the reserved sauce.", "To make ahead: Refrigerate dough, sauce and filling separately for up to 3 days. Let dough stand at room temperature for 10 minutes before rolling."]}, {"id": "ng2I", "title": "Chili Lime Nacho Mozzarella Sticks", "image": "https://images.yumprint.com/p1yumprinthq/HQZkRpXFlTpBqQkk_qpaedBzpWwWhvnTMN3LdXCPN1q-G8uWRLkLV_b7NOMo_h-W", "link": "http://www.carlsbadcravings.com/chili-lime-nacho-mozzarella-sticks/", "ingredients": ["24 mozzarrella sticks", "24 egg roll wrappers", "1/4 cup water (you won't use it all)", "Chili Lime Olive Oil", "1 tablespoon lime juice", "¼ cup olive oil", "½ teaspoon chili powder", "½ teaspoon ground cumin", "¼ teaspoon onion powder", "½ teaspoon garlic powder", "½ teaspoon salt"], "directions": ["Freeze mozzarella sticks for 90 minutes.", "Whisk together the Chili Lime Olive Oil Ingredients in a small bowl.", "Preheat oven to 400 degrees.", "*", "You can also look at the back of your egg roll wrapper for wrapping instructions/pics. Working with one at a time, place mozzarella stick diagonally in the bottom third of the egg roll wrapper. Brush the edges of the wrapper with water. Fold the bottom of the wrapper up tightly over the cheese, then proceed to roll the up the cheese, folding in the edges of the wrapper as you roll. You want the edges to be tightly sealed so the cheese doesn't spill out when cooked. Take care not to tear the wrapper.", "Place wrapped mozzarella sticks on a baking rack placed on a foil lined baking sheet. Brush wrapped mozzarella sticks with Chili Lime Olive Oil, stirring to make sure you get the spices that have settled. Note that the mixture will thicken as flour from the wrappers deposits into the oil.", "Bake for 15 minutes at 400 degrees. Broil for 3-5 minutes, or until golden, then flip mozzarella sticks and continue to broil until other side is golden.", "Serve with Fire Roasted Blender Salsa, Cotija Honey Lime Avocado Dip or Spicy Roasted Red Pepper Feta Dip"]}, {"id": "gWDY", "title": "Chili Lime Shrimp Cups", "image": "https://images.yumprint.com/p1yumprintoe/OeTzoIwi7sV6ETz6j0G2jdCnvw8UONGjNcxNJ1nqD9jm6oX0ljPnT_nAkrtqvAb8", "link": "http://www.inspiredtaste.net/11663/chili-lime-shrimp-cups/", "ingredients": ["2 tablespoons olive oil", "24 medium shrimp, peeled and deveined", "1/2 teaspoon salt", "1 teaspoon chile powder", "2 limes", "1/2 cup arugula", "3 tablespoons sour cream"], "directions": ["Preheat oven to 350 degrees F.", "Prepare wonton shells. Lightly brush wontons with 1 tablespoon of olive oil. Arrange in 24 mini muffin/cupcake cups. Bake 5-7 minutes until golden brown and crisp.", "Toss shrimp with 1 tablespoon of olive oil, salt, 2 teaspoons of lime zest and chile powder. Bake 5-8 minutes until shrimp are opaque throughout.", "To assemble, fill each wonton cup with a few leaves of arugula, a small dollop of sour cream, one shrimp then top with a spritz of lime juice."]}, {"id": "pZDo", "title": "Chipotle's Guacamole", "image": null, "link": "https://www.yahoo.com/food/chipotle-has-finally-unveiled-its-guacamole-recipe-118134168598.html", "ingredients": ["2 ripe Hass avocados (In the restaurant, we use 48 per batch, multiple times per day)", "2 tsp lime juice", "2 tbsp cilantro (chopped)", "¼ cup red onion (finely chopped)", "½ jalapeño, including seeds (finely chopped)", "¼ tsp kosher salt"], "directions": ["Choose the right avocado. It should feel squishy yet firm (like the palm of your hand), and be a nice dark green color on the inside.", "Cut the avocado in half and the remove the pit (carefully!)", "Scoop the avocados and place in a medium bowl.", "Toss and coat with lime juice.", "Add the salt and using a fork or potato masher, mash until a smooth consistency is achieved.", "Fold in the remaining ingredients and mix well.", "Taste the guacamole (over and over) and adjust seasoning if necessary."]}, {"id": "hjUT", "title": "Chorizo Bites with Arugula Pesto", "image": "https://images.yumprint.com/p1yumprint7u/7ueAbbJH94GEA9w3r4u-bzmnt0oOPIoCW5Kx5h5YOvKFJZxHpnP5ljc_heDvGiKr", "link": "http://www.cookingchanneltv.com/recipes/chuck-hughes/chorizo-bites-with-arugula-pesto.html", "ingredients": ["1 (8-inch) link chorizo sausage, cut into 1 1/2-inch chunks", "Dash oil, for sauteing"], "directions": ["To make the pesto: Add the arugula, garlic, cheese, and walnuts to the bowl of a food processor or blender, and puree. As the processer is running, drizzle in the olive oil. This will be used to garnish the Chorizo. Season the mixture with salt, and pepper, to taste. If the pesto is too thick, you can thin it out with water.", "To make the sausage: Cut the sausage link into large 1 1/2-inch chunks. Heat the oil in a saute pan, and saute the sausage until the edges start to brown, about 3 to 4 minutes. Toss the pieces while they fry so they cook all over.", "Add a dash of sherry vinegar to the pan to deglaze and release all the flavors. Transfer the sausage to a platter and serve with dollops of the arugula pesto. Add little cocktail sticks or toothpicks to each piece for easy eating."]}, {"id": "Lgwx", "title": "Christmas Tree Cheese Board", "image": null, "link": "https://muybuenocookbook.com/christmas-tree-cheese-board/?fbclid=IwAR3b8sHcI3eAu66AcJ9jk9u0_2qQN1WZe8N4aCUNM5eOF8T_d86f8syHu08", "ingredients": ["evergreen or cyrpress sprigs", "1 stalk celery", "4 ounces cheddar cheese, cut into 3/4-inch cubes", "4 ounces halloumi cheese, cut into 3/4-inch cubes", "1/2 pound Dill Havarti cheese, cut into 3/4-inch cubes", "seedless green, red, and black grapes", "1 kiwi, sliced", "fresh herbs such as thyme, rosemary, and sage", "1 star fruit slices or persimmon or cheese slices, shaped with a star cookie cutter", "fresh cranberries"], "directions": ["Place greenery/sprigs in the shape of a tree on a wooden tray, platter, or cutting board to resemble a Christmas tree shape.", "Place celery at the bottom for the tree trunk.", "Arrange cheese cubes, grapes, and kiwi in rows on greenery.", "Add fresh herbs between.", "Tuck additional Evergreen sprigs under the ingredients in the shape of a tree, if needed.", "Add star shapes on top of ingredients and top off the tree.", "Sprinkle with fresh cranberries, if using."]}, {"id": "rOCR", "title": "Classic Hummus", "image": "https://images.yumprint.com/p1yumprintbk/bkE7TpuI5yHnpDCX2T5q1nLAVXnZ5_26BdI5kbSrmppz30yrnpBIpkmBWZ4as-mf", "link": "http://www.nobiggie.net/the-creamiest-homemade-hummus/", "ingredients": ["2 cups chickpeas (as prepared above)", "2 garlic cloves, minced", "1 1/2 teaspoons kosher salt", "5 tablespoons lemon juice, freshly squeezed", "1/4 cup water", "1/3 cup tahini, stirred well (tahini is a sesame seed paste…you can find it near the peanut butter)", "1/4 cup extra-virgin olive oil, plus extra for serving"], "directions": ["Place the chickpeas, garlic, and kosher salt in the bowl of your food processor. Process for 15 to 20 seconds. Stop and scrape down the sides of the bowl, and process for another 15 to 20 seconds. Add the lemon juice and water. Continue to process for another 20 seconds. Now add the tahini. Process for 20 seconds, then scrape down the sides of the bowl. With the processor running, slowly drizzle in the olive oil.", "To serve, transfer the hummus to a bowl and drizzle with more olive oil and top with a sprinkle of paprika.", "That’s it! Now it’s up to you on what type of things and flavors you’d like to add to it and what you’d like to dip into it. You’ll have to try making hummus from dried beans, you’ll never go back to canned beans again."]}, {"id": "vLGg", "title": "Cocktail Party Throwback", "image": "https://images.yumprint.com/p1yumprintc2/C2pBWdSCzTYgW3Clcp0VQlLNMCrehRXjtGnOfeLc_Smm7cqOGEY09UvY-fiNAgnd", "link": "https://www.yahoo.com/food/cocktail-party-throwback-baked-cranberry-brie-in-106543572181.html", "ingredients": ["1 sheet of puff pastry, thawed", "1 whole wheel of brie cheese (roughly 8 ounces)", "1/4 cup fresh cranberry sauce", "1 egg, lightly beaten", "Splash of water"], "directions": ["Preheat the oven to 375 degrees F.", "Roll out the puff pastry to 1/4-inch thick. Place the brie in the center of the pastry, then spread the cranberry sauce on top of the cheese. Fold the ends of the pastry over the cheese and crimp to secure it in a little package. Trim extra pastry if needed.", "In a small bowl, whisk together the egg and water. Brush some of the egg wash over the outside of pastry.", "Bake the brie in a baking dish for 30-35 minutes, or until the pastry is golden brown.", "Let cool slightly. Serve with crackers and sliced fruit."]}, {"id": "KjG7", "title": "Cookie Dough Hummus Recipe", "image": "https://images.yumprint.com/p1yumprintgg/gGI083EDp5BpwvcvvL4jqjzCDTzE0lL-qnyJYuHzg3auw88uBVGDK4rK24cLfbEC", "link": "https://thewellnesswayclinics.com/cookie-dough-hummus-recipe/?fbclid=IwAR0gyfdaDiZShKv6IOsi67ReDhqF2Vt3GINxU-aeUMCQRo2rx9XjKbVttHo", "ingredients": ["1 can of unsalted chickpeas/garbanzo beans (15 ounce)*", "1 teaspoon vanilla extract", "1/2 cup and 2 tablespoons natural peanut butter (or other nut butter)", "1/4 cup honey", "pinch of sea salt", "1/2 cup mini chocolate chips"], "directions": ["Drain and thoroughly rinse chickpeas.", "Place Chickpeas, vanilla, peanut butter and honey in a food processor and blend until completely smooth.", "Add chocolate chips after blending.", "Serve with fruit."]}, {"id": "iYlx", "title": "Crab Rangoon Dip", "image": "https://images.yumprint.com/p1yumprintox/oxJesWLIzpHkqmy_vKh1HVfofRQfNTd2bWJwgWJBl6qbzhjvei1yVCT6Lez49tmf", "link": "http://thesweetrib.com/crab-rangoon-dip/", "ingredients": ["2 cups crab meat", "16 oz. cream cheese (2 blocks)", "1/2 cup sour cream", "4 green onions, chopped", "1 1/2 tsp. Worcestershire sauce", "2 Tbsp powdered sugar", "1/2 tsp garlic powder", "1/2 tsp lemon juice"], "directions": ["First, soften the cream cheese in the microwave for about a minute.", "Chop your green onions. Add them and your two cups of crab meat .", "Add the sour cream, Worcestershire sauce, powdered sugar, garlic powder and lemon juice.", "Mix all the ingredients and bake for 30 mins at 350 degrees. Serve hot with chips or fried wontons or pork rinds."]}, {"id": "pdwR", "title": "Cranberry Baked Brie Puff Pastry Bites", "image": "https://images.yumprint.com/p1yumprintlv/LViBm5Lidy209pz1oN85sidfuAhnX5vPEaf-4V9qsUYuSGpnMd9JTKRjE_eGQ8sx", "link": "http://www.wellplated.com/cranberry-baked-brie-puff-pastry/", "ingredients": ["2 10x10-inch sheets puff pastry, thawed in the refrigerator overnight", "1 large egg, beaten", "4 ounces Brie cheese, cold"], "directions": ["Prepare the cranberry sauce: Combine the cranberries, orange juice, water, honey, cinnamon, and salt in a small saucepan. Bring to a simmer over medium heat and cook for 10 minutes, until the cranberries break down and thicken. Let cool.", "Unfold the thawed puff pastry on a lightly floured work surface. With a rolling pin, gently roll the pastry so that it is an even 11-inch square. With a 1 1/2-inch round cookie or biscuit cutter, cut circles out of the pastry (48 rounds total).", "Beat the egg in a small bowl, then lightly brush each pastry. Top 12 of the pastry rounds with 1/4 teaspoon cranberry sauce and 1 small piece Brie cheese, rind included.", "Carefully place the remaining pastry rounds on top of the Brie and cranberry, brushed egg side down. Pinch the ends closed, then gently crimp the edges with a fork to secure. Prick each pastry with a fork to allow the air to escape. (If making ahead, see notes section below.) Repeat with second pastry sheet.", "Place a rack in the upper third of the oven and preheat oven to 375 degrees F. Line a baking sheet with parchment paper. Place pastry on the prepared sheet and brush lightly with egg. Bake for 12 to 16 minutes, or until puffed and golden brown. Remove from the oven and allow to cool for at least 15 minutes before serving. Serve warm or at room temperature.", "Assembled but unbaked puff pastry bites can be placed on a parchment-lined baking sheet and frozen. If freezing for later, still poke holes in the top but omit the exterior egg wash. Once frozen, remove the bites from the baking sheet and transfer to airtight bag. When ready to bake, apply the exterior egg wash. Puff pastry bites may be baked from frozen or thawed in the refrigerator, then baked chilled. If baking from frozen, keep the oven temperature the same, adding 3 to 5 minutes to the baking time. Pastry puffs may also be fully baked, then frozen and will reheat well in the oven."]}, {"id": "K6ox", "title": "Creamy Broccoli White Bean Soup", "image": null, "link": "https://aseasyasapplepie.com/creamy-broccoli-white-bean-soup/", "ingredients": ["1 1/2 tablespoon extra virgin olive oil", "1 shallot thinly sliced", "1 garlic clove thinly sliced or minced", "1/4 teaspoon chili flakes", "1 head of broccoli (450 grams- 1 pound) cut into florets", "1 can cannellini beans (400 grams - 14 ounces) drained and rinsed", "840 ml (3 1/2 cups) vegetable stock low sodium", "salt and freshly ground black pepper to taste", "TOPPINGS (OPTIONAL)", "sunflower seeds", "chili flakes", "fresh oregano", "freshly ground black pepper"], "directions": ["Heat the oil in a large pan over medium heat, and sauté the shallot until soft.", "Add the garlic and sauté for 1 minute or until fragrant.", "Add the broccoli, beans and vegetable stock. Cover and simmer until the broccoli are tender. This will take about 5 minutes. Season with salt and pepper.", "Using an immersion blender, a blender, or a food processor, blend the soup until completely smooth.", "Serve this creamy broccoli white bean soup in bowls garnished with sunflower seeds, chili flakes, fresh oregano, and freshly ground black pepper."]}, {"id": "I_FC", "title": "Creamy Crab Dip", "image": null, "link": "http://www.oncedailydiy.com/2018/03/creamy-crab-dip.html", "ingredients": ["8 oz. Imitation Crab Meat Chopped", "1/3 cup Mayo", "6 oz. Cream Cheese", "1/2 cup Shredded Cheddar Cheese", "1/4 cup Chopped Green Onion", "1 Tbs finely Chopped Jalapeno", "2 finely Chopped Garlic Cloves", "1/2 tsp Garlic Powder", "1/2 tsp Onion Powder", "1/4 tsp Cayenne Pepper"], "directions": ["In a large bowl mix together the cream cheese and mayo until smooth.", "Add all other ingredients to the bowl and mix until combined."]}, {"id": "goVY", "title": "Creamy Edamame and Pea Hummus", "image": "https://images.yumprint.com/p1yumprintxg/XGua1fb4AkL-1znE5tPScSsAwmfk0wc4TEUkQ8_abxc5pilywc4xW0rSaWhssTlU", "link": "http://www.justataste.com/2014/03/creamy-edamame-pea-hummus-dip-recipe/", "ingredients": ["1 cup frozen shelled edamame", "1 cup frozen peas", "1/3 cup tahini", "3 Tablespoons fresh lemon juice", "2 garlic cloves, roughly chopped", "1 teaspoon cumin", "3 Tablespoons water", "3/4 teaspoon salt", "2 Tablespoons olive oil", "Chopped flat-leaf parsley, for garnish", "Assorted crudité or crackers, for serving"], "directions": ["Bring a medium pot of salted water to a boil. Add the edamame and cook just until tender, 3 to 5 minutes. Remove the edamame to a colander. Return the water to a boil, add the peas, and cook just until tender, about 1 minute. Transfer the peas to the colander with the edamame to drain.", "In the bowl of a food processor, pulse together the edamame, peas, tahini, lemon juice, garlic, cumin, water and salt until smooth, scraping down the sides of the bowl as needed.", "With the motor running, drizzle in the olive oil and continue processing until the mixture is a smooth pureé. Taste the hummus and season with additional salt and pepper. Transfer the hummus to a bowl, top with chopped parsley and serve immediately with assorted crudité or crackers."]}, {"id": "pNs8", "title": "Crisp Cucumber Salsa Recipe", "image": "https://images.yumprint.com/p1yumprintyp/Yp8d8GISvkFltX0rKNjToUzBGPl0vdNE1Jj7d3e_vR_vFt80mNoH34QmCQ9VnD-d", "link": "http://www.tasteofhome.com/recipes/crisp-cucumber-salsa", "ingredients": ["2 cups finely chopped seeded peeled cucumber", "1/2 cup finely chopped seeded tomato", "1/4 cup chopped red onion", "2 tablespoons minced fresh parsley", "1 jalapeno pepper, seeded and chopped", "4-1/2 teaspoons minced fresh cilantro", "1 garlic clove, minced", "1/4 cup reduced-fat sour cream", "1-1/2 teaspoons lemon juice", "1-1/2 teaspoons lime juice", "1/4 teaspoon ground cumin", "1/4 teaspoon seasoned salt"], "directions": ["In a small bowl, combine the first seven ingredients. In another bowl, combine the sour cream, lemon juice, lime juice, cumin and seasoned salt. Pour over cucumber mixture and toss gently to coat. Serve immediately with chips. Yield: 2-1/2 cups.", "Nutritional Facts", "1/4 cup (calculated without chips) equals 16 calories, 1 g fat (trace saturated fat), 2 mg cholesterol, 44 mg sodium, 2 g carbohydrate, trace fiber, 1 g protein."]}, {"id": "k4RY", "title": "Crispy Kale with Lemon-Yogurt Dip", "image": "https://images.yumprint.com/p1yumprint7x/7X9cNEJu50EivwEsrnJfJ12PyqGCKZR16vCzJxrWW1EFdpYcwbu9I2HcVeHGSmWt", "link": "http://www.foodandwine.com/recipes/crispy-kale-with-lemon-yogurt-dip", "ingredients": ["1 pound curly kale, stems and large inner ribs removed", "1/4 cup extra-virgin olive oil", "2 garlic cloves, minced", "Salt and freshly ground pepper", "1 cup fat-free plain Greek yogurt", "1 teaspoon finely grated lemon zest", "2 tablespoons fresh lemon juice"], "directions": ["Preheat the oven to 375°. In a bowl, toss the kale with all but 1 tablespoon of the olive oil and half of the garlic. Spread the kale on 2 baking sheets and roast in the upper and lower thirds of the oven for about 15 minutes, until crisp; shift the pans from top to bottom halfway through. Season the kale with salt and pepper and transfer to a large platter.", "In a small bowl, whisk the yogurt with the lemon zest and juice and the remaining garlic and 1 tablespoon of oil. Season with salt and pepper. Serve with the roasted kale."]}, {"id": "eMxo", "title": "Crispy Potato Skins", "image": "https://images.yumprint.com/p1yumprintd3/D3eUNaEmwrcwjw-S7HfA_qb_mhFlHvp2XUcHSpwiee49Rw5OPRL1mRWHPgcWw6d-", "link": "http://www.cuisinerecipes.com/2013/12/26/crispy-potato-skins/?utm_source=CuisineRecipes&utm_medium=email&utm_campaign=7722", "ingredients": ["1 cup sour cream", "3⁄4 cup mayonnaise", "1⁄2 cup chopped scallions", "1⁄4 cup minced fresh cilantro", "1 Tbsp. minced canned chipotle chile", "1⁄4 tsp. canned adobo sauce", "1 Tbsp. fresh lime juice", "1 tsp. Worcestershire sauce"], "directions": ["Preheat oven to 400°.", "For the potato skins, coat potatoes with oil and pierce several times with a fork; transfer to a baking sheet.", "For the dip, slice off root ends of garlic bulbs; season with salt and pepper, drizzle with oil, and wrap in foil. Transfer garlic to baking sheet with the potatoes.", "Roast potatoes and garlic, 45 minutes. Remove garlic and set aside. Increase oven temperature to 450°. Cook potatoes until fork tender, 15 minutes more; set aside.", "Cook bacon in a skillet over medium heat until crisp, 10 minutes; transfer to a paper-towel-lined plate and reserve drippings, setting both aside.", "Combine sour cream, mayonnaise, ½ cup scallions, cilantro, chipotle, adobo sauce, lime juice, and Worcestershire in a bowl. Squeeze cloves from roasted garlic; dice cloves and stir into dip along with bacon. Season dip with salt and pepper.", "Cut potatoes in half lengthwise when cool enough to handle. Scoop out flesh, leaving ¼-inch intact. Cut each half lengthwise into quarters. Transfer potato skins to baking sheet, skin sign up.", "Brush potato skins with some of reserved drippings and return to oven, 10 minutes. Flip skins; brush with remaining drippings and roast 5 minutes more. Sprinkle skins with Cheddar and roast until melted, 1–2 minutes. Garnish skins with scallions and serve with dip.", "Nutrition Information", "Per skin with 1 Tbsp. dip: 108 cal; 7g total fat (2g sat); 10mg chol; 64mg sodium; 10g carb; 1g fiber; 2g protein"]}, {"id": "AHGP", "title": "Cucumber Spears with Citrus Mint Salt", "image": "https://images.yumprint.com/p1yumprintqc/qCbw7Um1HysMwB805OT45COl9rOResZIjZnLOkn6_hTjBeaL-kYwLgLoq_FJkEH_", "link": "http://gourmandeinthekitchen.com/cucumber-spears-with-citrus-mint-salt/", "ingredients": ["2 teaspoons fleur de sel", "The zest of half a lemon", "The zest of half a lime", "4-5 fresh mint leaves", "6 small Persian cucumbers"], "directions": ["Combine the salt, lemon and lime zest and mint leaves in a mortar or a food processor. Grind the ingredients with a pestle or pulse until very coarsely crushed. (Can be made the night before.)", "Cut cucumbers in half or quarters. Toss with flavored salt in a large bowl then place in a colander set over the bowl and drain 15-20 minutes. Shake excess liquid from cucumbers. Skewer cucumber halves if desired.", "Place in freezer on lined baking sheet to chill for at least 15-20 minutes until well chilled. Serve immediately."]}, {"id": "uQXP", "title": "Curried Butternut Squash Dip", "image": "https://images.yumprint.com/p1yumprintld/lDDH2oWzWxQZQEl3PECpQHs5s2Mcdejc-vJQ-EKTstChH-OUlb0u-FPzvO2qgZUL", "link": "http://www.eatingwell.com/recipes/curried_butternut_squash_dip.html?socsrc=EWfb1119156", "ingredients": ["1 2-pound butternut squash", "1 teaspoon extra-virgin olive oil", "1 teaspoon curry powder", "1 teaspoon ground cumin", "1 1/4 cups “lite” coconut milk", "1 tablespoon finely chopped fresh ginger", "1 cup pepitas, toasted, plus more for garnish", "Zest of 1 lime", "1/4 cup lime juice", "1 1/2 teaspoons salt", "3 tablespoons chopped fresh cilantro"], "directions": ["Cut squash in half and remove seeds. Brush with oil and place cut-side down in a baking pan. Roast until tender, about 45 minutes. Let stand until cool enough to handle, then scoop the squash out of the skin.", "Meanwhile, place curry powder and cumin in a small saucepan over medium-low heat; stir until fragrant, 2 to 4 minutes. Add coconut milk and ginger; bring to a boil over high heat. Adjust heat to maintain a simmer and simmer, stirring frequently, until reduced to about 3/4 cup, 13 to 15 minutes.", "Process pepitas in a food processor until finely ground. Add the squash, the coconut milk mixture, lime zest, lime juice and salt; process, scraping down the sides once or twice, until smooth. Refrigerate until cold, about 2 hours. Serve sprinkled with cilantro and pepitas, if desired."]}, {"id": "vAd9", "title": "Dairy-Free Creamy Spinach-Artichoke Dip", "image": "https://images.yumprint.com/p1yumprintah/Ah9UfC3_p2DjLIx0I3RCQpEHi2bLEr94COU1h44GmshRnx3OkChCX8CJEkztVfPE", "link": "http://www.healthhomeandhappiness.com/dairy-free-paleo-spinach-artichoke-dip-made-with-avocado-mayo.html?utm_source=feedburner&utm_medium=email&utm_campaign=Feed%3A+HealthHomeAndHappiness+%28Health%2C+Home%2C+and+Happiness%29", "ingredients": ["1 cup avocado oil (I buy this kind)", "1 egg", "1/2 teaspoon salt", "1 teaspoon lemon juice"], "directions": ["In a blender or food processor, blend egg for 30 seconds.  After 30 seconds, with the blender still running, slowly drip oil through the top – taking a full 2 minutes to drip in 1 cup of oil.  Mayonnaise will emulsify. After emulsified, pulse the blender while adding the salt and lemon juice.  Keep covered in the fridge, use within 5 days."]}, {"id": "KjHa", "title": "Dairy-Free Kickin’ Queso Ingredients", "image": "https://images.yumprint.com/p1yumprintep/EpSBZ7knmRcKKak6Y1v60tvCIUGViUFWC_9Zw3y8XmqCfpqcolOJfjqKqBGcZJoA", "link": "https://thewellnesswayclinics.com/dairy-free-queso/?fbclid=IwAR1FXqa90z-4aof7_G22p2MHHtIW7C7ToYTyQb5iBBPpteBHGM-gecc-iAk", "ingredients": ["1 cup unsalted cashews", "1 cup organic medium salsa", "3/4 cup plain unsweetened coconut milk yogurt", "1 tablespoon white vinegar", "1 1/4 teaspoon smoked paprika", "1 teaspoon ground cumin", "1 teaspoon sea salt", "4 oz can organic green chiles, diced", "1/2 cup organic grape tomatoes"], "directions": ["Put all ingred. except chiles & tomatoes in blender.", "Blend until very smooth.", "After blending, stir in green chiles and tomatoes.", "Optional: heat for short time, and avoid boiling. Whisk constantly until slightly thickened. Overheating will make it chunky."]}, {"id": "r7N7", "title": "Double-Tahini Hummus", "image": "https://images.yumprint.com/p1yumprint6e/6eRR2IiFYCWQeARfcl3biRP0naijWhweRmlzlKMsaIKxR3D8TIQEXTIu_kZ4vp59", "link": "http://www.eatingwell.com/recipes/double_tahini_hummus.html?socsrc=ewfb0730155", "ingredients": ["8 ounces dried chickpeas (about 1 cup)", "1 tablespoon baking soda", "7 large cloves garlic, peeled", "1/2 cup extra-virgin olive oil, divided", "1/2 cup cold tahini (see Tip), divided", "1/4 cup fresh lemon juice plus 1 tablespoon, divided", "1 1/2 teaspoons kosher salt", "1/4 teaspoon ground cumin, plus more for garnish", "Paprika for garnish", "1/4 cup chopped flat-leaf parsley"], "directions": ["Place chickpeas in a medium saucepan and cover with 2 inches of water; stir in baking soda. Soak overnight. (Alternatively, to quick-soak: Bring the chickpea mixture in the saucepan to a boil. Boil for 2 minutes. Remove from heat, cover and let stand for 1 hour.)", "Drain the chickpeas and rinse well. Rinse out the pan. Return the chickpeas to the pan and cover with 2 inches fresh water. Add garlic. Bring to a boil. Keep at a rolling boil until the chickpeas are tender and almost falling apart, 25 to 40 minutes.", "Reserve about 3/4 cup of the cooking water, then drain the chickpeas. Set aside 2 tablespoons of the prettiest chickpeas for garnish. Rinse the remaining chickpeas and garlic and set the colander over a bowl. Refrigerate the chickpea mixture, reserved cooking water and pretty chickpeas separately overnight.", "The next day, combine the chickpeas, 6 of the garlic cloves and 1/2 cup of the reserved cooking water in a food processor (or blender) with 1/4 cup each oil, tahini and 1/4 cup lemon juice, salt and cumin. Process until creamy. Transfer to a serving bowl. Puree the remaining 1/4 cup each oil and tahini with the remaining garlic clove, 2 table-spoons of the cooking water and 1 tablespoon lemon juice until smooth.", "Make an indention in the center of the hummus and spoon in the tahini-lemon mixture. Sprinkle the hummus with cumin and paprika, if desired. Garnish with the reserved whole chickpeas and parsley.", "Make Ahead Tip: Cover and refrigerate hummus (without garnishes) for up to 5 days. Garnish just before serving. Makes 16 servings.", "NUTRITION", "Per serving: (1/4 cup) 159 calories; 12 g fat (2 g sat, 7 g mono); 0 mg cholesterol; 10 g carbohydrates; 0 g added sugars; 2 g total sugars; 4 g protein; 3 g fiber; 139 mg sodium; 135 mg potassium."]}, {"id": "vdRE", "title": "Easy Beef Jerky Recipe", "image": "https://images.yumprint.com/p1yumprintmi/MijhxcVb_c1EGVg_SFVNQAM1xl21VGsbIZSzXbt7PC__sS-fBbkCWaMvq67rF67T", "link": "http://www.motherearthnews.com/real-food/easy-beef-jerky-recipe-zmaz77ndzgoe.aspx", "ingredients": ["Beef flank steak", "Soy sauce", "Garlic salt", "Lemon pepper"], "directions": ["Trim all the fat from as much beef flank steak as you care to prepare (and start with lots, since the meat will shrink a great deal as it dries). Cut the steak lengthwise (with the grain) into long, thin strips that are no more than 1/8 inch thick. Toss with 1/2 cup soy sauce that contains 1/2 teaspoon each of garlic salt and lemon pepper. Then place the strips close together — but not overlapping — in a single layer on a rack over a baking sheet, and bake in a slow oven (150 to 175 degrees Fahrenheit) overnight or 10 to 12 hours. Store the finished jerky at room temperature in an airtight container. If all the fat was trimmed away from the meat in the beginning, this jerky will keep indefinitely."]}, {"id": "l6RL", "title": "Easy Fried Cheese Appetizer", "image": "https://images.yumprint.com/p1yumprint-p/-PjSY7Ibv0smVQlh5Kl5iKavoEJtSFeGQEsqzrXAFchTkCodG6JMsWheF7jTQL1c", "link": "https://www.yahoo.com/food/fricos-cheese-grated-and-baked-into-chips-104940291141.html", "ingredients": ["4 oz. Parmesan cheese, grated (or any grating cheese)"], "directions": ["Line a baking sheet with parchment paper or a silicone baking sheet. Use a tablespoon to measure a spoonful of the grated cheese. With your fingers, shape the cheese into mounds, arranged about 4 in/10 cm apart.", "Bake just until the fricos begin to color, turning golden brown, 2 to 4 minutes.  It’s easy to burn them, so as soon as you notice them darken and smell their fragrance, take them out of the oven. Let them cool on the baking sheet for 3 minutes and then use a metal spatula to transfer the fricos to a wire rack to cool completely.", "If you like, you can make these up to 2 days ahead.  Store them in an airtight container in a cool, dark spot with wax paper between them so they don’t stick together."]}, {"id": "JLqC", "title": "Endurance Crackers", "image": "https://images.yumprint.com/p1yumprintn2/N2oOSEGN3p3GzrDGv7AECcmiCMHSR3Pe3bP238WWAoiRVwnYOtuT9wLaYjNIthcR", "link": "https://ohsheglows.com/2012/01/31/endurance-crackers/", "ingredients": ["1/2 cup chia seeds", "1/2 cup sunflower seeds", "1/2 cup pepita seeds (or pumpkin seeds)", "1/2 cup sesame seeds", "1 cup water", "1 large garlic clove, finely grated on a Microplane", "1/4 teaspoon fine sea salt, plus more for sprinkling"], "directions": ["Preheat the oven to 300ºF. Line a large baking sheet with parchment paper.", "In a large bowl, combine the chia seeds, sunflower seeds, pepita seeds, and sesame seeds.", "Add the water, garlic, and salt. Stir with a spatula until combined. Allow the mixture to sit for a couple of minutes until the chia seeds absorb the water. After the 2-minute rest, when you stir the mixture, you shouldn’t see a pool of water on the bottom of the bowl.", "With the spatula (and a hand, if necessary), spread the mixture onto the prepared baking sheet in two small rectangles, about 12x7 inches each and 1/8 to 1/4 inch thick. Sprinkle additional salt on top.", "Bake for 35 minutes. Remove from the oven and carefully flip each rectangle with a spatula. Bake for 25 to 35 minutes more, until lightly golden around the edges. Watch closely near the end to make sure they don’t burn. Let cool for 10 to 15 minutes on the pan and then break the rectangles into crackers and let cool completely on the pan. Store in an airtight container or jar on the counter for up to 2 weeks. You can also freeze the crackers in freezer bags for up to 1 month."]}, {"id": "lEuX", "title": "Everything Crackers", "image": "https://images.yumprint.com/p1yumprintlb/LBzzCw_dTpCrkdhfkTKOVKuDUp72YyY6ptlexDzkbiftLjHsf--4b1DCSoEs06Nc", "link": "http://consideritjoybaking.com/2013/08/30/everything-crackers-paleo-scd-nut-free/", "ingredients": ["1/2 cup + 2 TBSP raw pepitas (pumpkin seeds)", "1/2 cup raw sunflower seeds", "2 TBSP sesame seeds", "2 TBSP flax seeds (if you don’t have these on hand and don’t want to buy them just sub in extra sunflower seeds here)", "1 TBSP poppy seeds", "1 TBSP dried minced garlic**", "1 TBSP coconut aminos", "1 egg", "1 tsp. sea salt", "1/4 tsp. pepper", "1/4 tsp. onion powder"], "directions": ["*If you also have dried minced onion on hand, try it with 1/2 TBSP minced onion, 1/2 TBSP minced garlic and omit the onion powder.  This was my intention but I didn’t have any dried minced onion.  Either way, they are delicious.  Just giving you options :)**", "Preheat oven to 350.", "In a food processor, pulse 1/2 cup sunflower seeds and 1/2 cup pumpkin seeds until they resemble a meal/flour.  Add all other ingredients (including the remaining 2 TBSP of pumpkin seeds) and pulse to combine.  You want there to be visible seeds in the crackers.", "Spread your mixture onto a sheet of parchment paper.  Then cover with another sheet of parchment paper.  Use a rolling pin to roll the crackers out.  I talk more about rolling out crackers on my Parmesan cracker post if you are interested.", "Use a pizza cutter to cut them into whatever size you prefer.  Sprinkle with a little more sea salt.", "Transfer the crackers and parchment paper to a cookie sheet and bake for approximately 10-15 minutes.  The baking time will depend on the thickness of your crackers.  Just remember that crackers are very thin and can burn very, very quickly.  Watch them closely!"]}, {"id": "IaDD", "title": "Flavor Ground Turkey to Taste Like Sausage", "image": "https://images.yumprint.com/p1yumprint-a/-AKZGZM0UCOc_n052PxSQha54_O0nGHvMuriDXQU2jvL3esDZbIQ2TNkTcuvM2Hu", "link": "https://joyfulhomemaking.com/2014/06/flavor-ground-turkey-to-taste-like-sausage.html", "ingredients": ["pinch of ginger", "clove of minced garlic"], "directions": ["Add to ground turkey and mix well."]}, {"id": "v52s", "title": "Flax Seed Crackers... Gluten-Free/Egg-Free/Flour-less.", "image": "https://images.yumprint.com/p1yumprintfb/FbURXahXY37MVs_gPTq3PZgE8-L2iAHrgvvkKHB5Kr2GkgbVwGK--sUK9XpnraF1", "link": "http://homecookinginmontana.blogspot.com/2013/05/flax-seed-crackers-gluten-freeegg.html", "ingredients": ["1 cup flax seeds(I used golden)", "1 cup water", "1 cup sunflower seeds( I used 1/2 cup raw +1/2 cup roasted)", "1/3 cup millet", "2/3 cup raw sliced almonds", "2 tsps  dried onion powder", "chile flakes to taste, optional", "11/4 tsp kosher salt, or to taste"], "directions": ["In a large bowl, add all ingredients. Mix well to combine evenly. Allow to sit for 10 minutes or more ... until mixture \"clumps\" up and forms a thick \"batter\".", "At this point, you can proceed to bake the crackers, or you could let the cracker mixture soak for 2 hours or so... which is what I ended up doing. The mixture does get drier, but it still works.", "Preheat oven to 170 deg F", "Line a large cookie sheet with parchment paper, and place cracker mixture in center. With wet or oiled hands press the mixture into a thin even layer... about 1/4 inch thick. You will need to wet your hands often, as the mixture can be quite sticky.", "Place pan in preheated oven and bake for 60-80 minutes. Turn cracker sheet over and bake an additional 60-80 minutes... or until you notice the cracker sheet is no longer soft in the center.", "When turning the cracker sheet over, you might find it helpful to use another baking sheet of the same size to help you turn it over without breaking in pieces.", "Turn oven off and allow cracker sheet to dry further in the oven with the residual heat. I leave mine overnight..."]}, {"id": "rO1i", "title": "Fresh Herb Aïoli with Spring Vegetables Recipe | Le Grand Aïoli", "image": "https://images.yumprint.com/p1yumprintt0/t0gj-5InV_eIwz66pX9ie1OvNciIodjcUm_j0-crekKzA_NKTXlAocvUakocWj81", "link": "http://gourmandeinthekitchen.com/2013/herb-aioli-with-vegetables-le-grand-aioli/?utm_content=buffer58f26&utm_medium=social&utm_source=twitter.com&utm_campaign=buffer", "ingredients": ["6 hard boiled eggs, cut in half", "12 oz. green beans, lightly steamed or blanched", "1 lb.young carrots, peeled or well scrubbed", "12 oz. asparagus, lightly steamed or blanched", "1 or 2 bunches mixed radishes, greens and roots trimmed", "1 cup olives (mixture of green and black)"], "directions": ["Finely chop garlic using a mortar and pestle or on a chopping board. Pound garlic with the salt until a paste forms if using a mortar and pestle or with the back of your knife if using a chopping board.", "Add garlic salt paste to the bowl of a food processor along with the fresh herbs and pulse until finely chopped and incorporated.", "Add the egg yolks, lemon juice and mustard powder and pulse again until incorporated.", "Turn processor to on position and drizzle oil in slowly until a thick, shiny aioli is achieved. Aioli can be prepared a day ahead; store in refrigerator.", "Serve with prepared vegetables and hard boiled eggs (see below for how to make hard boiled eggs).", "To cook the eggs (recipe courtesy of McCormick):", "Gently place eggs in single layer in medium saucepan.", "Add enough cold water to cover eggs with one inch of water.", "Bring just to boil on medium-high heat. Remove from heat, cover and let stand about 15 minutes for large eggs.", "After 15 minutes,pour off the hot water and rapidly cool eggs by running them under cold water (or place in ice water) until completely cooled.", "Refrigerate and use within a week."]}, {"id": "mlVD", "title": "Fried Zucchini", "image": "https://images.yumprint.com/p1yumprintp8/p8gRUlY7owFSb5uWKXL93UeH0iL57DJnl-n303AqxNUEI8W9R4RtFhq2zXlVwQrx", "link": "http://www.foodnetwork.com/recipes/giada-de-laurentiis/fried-zucchini-recipe.html", "ingredients": ["Olive oil, for frying", "1 3/4 cups freshly grated Parmesan", "1 1/2 cups panko (Japanese breadcrumbs)", "3/4 teaspoon salt", "2 large eggs", "3 medium zucchini, cut into 3-inch long by 1/2-inch wide strips"], "directions": ["Pour enough oil into a large frying pan to reach a depth of 2 inches. Heat the oil over medium heat until a deep-fry thermometer registers 350 degrees F.", "Stir 1 1/2 cups Parmesan, the panko, and salt in a medium bowl to blend. Whisk the eggs in another medium bowl to blend. Working in batches, dip the zucchini in the eggs to coat completely and allow the excess egg to drip back into the bowl. Coat the zucchini in the panko mixture, patting to adhere and coat completely. Place the zucchini strips on a baking sheet.", "When the oil is hot, working in batches, fry the zucchini sticks until they are golden brown, about 3 minutes. Using a slotted spoon, transfer the fried zucchini to paper towels and drain.", "Arrange the fried zucchini on a platter. Sprinkle with the remaining Parmesan and serve."]}, {"id": "CE_u", "title": "Garlic Hummus", "image": "https://images.yumprint.com/p1yumprint6w/6wH-HySFi07i8zodweHgwsNsHrQcjaPHMmhZBWB0BqP_U2qZifMVZU3fZmrgh62R", "link": "http://www.eatingwell.com/recipe/256571/garlic-hummus/", "ingredients": ["1 (15 ounce) can no-salt-added chickpeas ¼ cup tahini ¼ cup extra-virgin olive oil ¼ cup lemon juice 1 clove garlic 1 teaspoon ground cumin ½ teaspoon chili powder ½ teaspoon salt"], "directions": ["Drain chickpeas, reserving ¼ cup of the liquid. Transfer the chickpeas and the reserved liquid to a food processor. Add tahini, oil, lemon juice, garlic, cumin, chili powder and salt. Puree until very smooth, 2 to 3 minutes."]}, {"id": "vAeV", "title": "Garlic-Spinach Artichoke Dip", "image": "https://images.yumprint.com/p1yumprintf0/f0ehlL-fgnHw7eXg2xT2KaMxfypuBa647Wc4Q6sn_tP-nSYZi9n2Sw076KozAKWQ", "link": "http://www.healthhomeandhappiness.com/imitation-spinach-artichoke-parmesan-dip.html", "ingredients": ["1/3 cup mayonnaise", "2 cups fresh spinach", "2 cloves garlic", "½ cup artichoke hearts", "2 cups Parmesan, grated"], "directions": ["Puree in food processor the first 3 ingredients.", "Add artichokes. Pulse to chop.", "Mix in the cheese and enjoy!", "Keep covered in the refrigerator if you have leftovers."]}, {"id": "JUeO", "title": "Gluten and dairy free cheesy crackers", "image": "https://images.yumprint.com/p1yumprintsr/SrL2NpUpdtc6S_HrxkgAICxQFa-QN3EkyDkJHrz2Ljy9M1tq0aku_qm70UuLZgs_", "link": "https://themerrymakersisters.com/how-do-you-make-gluten-free-crackers/", "ingredients": ["1 cup blanched almond meal", "1/3 cup savoury yeast flakes", "1 egg", "1 tbs. macadamia oil", "salt"], "directions": ["Preheat oven to 180°C (350°F).", "Mix all ingredients together (it should form a sticky dough).", "Between two sheets of baking paper roll out the dough to 3mm thick (more like thin).", "Carefully peel off the top sheet of baking paper.", "Place onto a baking tray and into the oven for 10 -12 minutes or until golden brown.", "Let cool, break apart and enjoy with avo, dip or just by themselves!"]}, {"id": "AMjG", "title": "Gluten Free Soft Pretzel Bites", "image": "https://images.yumprint.com/p1yumprinthd/hdP0ajNP9H4O-ZLXMGLLTb7ZOIrvPm0vEfwrQepdSE7Jsnwm1xLrQF_7fn9Ifr3f", "link": "https://www.swansonvitamins.com/blog/recipes/gluten-free-soft-pretzel-bites?url=/blog/recipes/gluten-free-soft-pretzel-bites&SourceCode=INTESJBR&utm_source=exacttarget&rid=84779178&utm_medium=email&utm_content=recipe-categories&utm_campaign=INTESJBR", "ingredients": ["1 egg, whisked", "Coarse salt"], "directions": ["Combine 1 1/4 cup warm water with yeast in a bowl and allow to sit for 5-10 minutes until the mixture is foamy.", "Using a stand mixer, combine flour, blended chia seeds, 1 teaspoon salt and baking powder.", "Add olive oil and yeast mixture to the stand mixer and use a dough hook until the dough starts to pull away from the sides of the bowl. Stop the mixer as needed and use a spatula to scrape the sides.", "Once fully combined, knead the dough for an additional minute using the dough hook. The dough should be a little wet. If it's too dry, add water as needed; if it's too wet, add flour as needed.", "Place pretzel dough into an oiled bowl, cover with plastic wrap and a towel and allow it to double in size (about 30 minutes to 1 hour).", "Preheat oven to 450 degrees F.", "Lightly grease several baking sheets.", "In a large pot, add 8 cups water and baking soda, whisking to dissolve the baking soda. Allow the baking soda bath to come to a boil while you roll out the dough.", "Keeping your hands wet the entire time will help form the dough easier. Working with a lightly floured surface, cut dough into 6 even pieces. Form each piece of dough into a long log (about 12 inches long and 1 inch wide).", "Cut each log into 8 pieces. These will make up your soft pretzel bites.", "Once the water is boiling, reduce heat to medium-high. Place a few pretzel dough bites into the pot without crowding it. Allow the bites to cook for 30 seconds on each side before removing them with a strainer and placing them on an oiled baking sheet.", "Brush the pretzel bites with a whisked egg and sprinkle with coarse salt.", "Bake until golden brown, 12-15 minutes.", "Allow to cool for 20 minutes. Enjoy plain or with mustard, cheese or another dip."]}, {"id": "K0TO", "title": "Gluten-Free Corn-Free Baked Tortilla Chips", "image": "https://images.yumprint.com/p1yumprintxq/XqZkiOzgU99w3fttDw66rM2wGnUhmDbTOKqa8NIUzRO7whrCYp0TJQRdejl-Ip8D", "link": "https://livingnongmo.org/recipe/gluten-free-corn-free-baked-tortilla-chips/", "ingredients": ["3 large gluten-free brown rice tortillas", "1 Tablesppon unrefined, virgin coconut oil, warmed to liquid", "Zest from 1 lime (about 2 tsp)", "1/2 teaspoon ground coriander", "1/4 teaspoon chili powder", "1/4 teaspoon fine-ground sea salt"], "directions": ["2 baking sheets (or bake in batches using 1 sheet)", "Unbleached parchment paper", "Chef’s knife", "Large glass bowl", "Pre-heat oven to 350°F and prepare lime zest. Stack tortillas and cut into the chip shapes that you want. Try a cookie cutter for fun shapes like stars and hearts. In a bowl, mix together all ingredients except tortillas.", "Now add tortillas, and massage in the spices with your hands so all chips are coated. If you don’t like to get dirty, use a pastry brush to coat both sides of your chips. Add more seasoning and oil if you want—pastry brushes tend to suck up a lot of seasoning so you may need to double the ingredient amounts of you go this route.", "Lay out chips on a parchment-lined baking sheets. Bake for 8 to 10 minutes–no longer because they can burn quickly. Remove from oven and allow to cool. Enjoy!"]}, {"id": "v514", "title": "Grain-Free Crackers... Almond Thins.", "image": "https://images.yumprint.com/p1yumprint-2/-24rg2JTOgDCBtLI0dokpRZS1HO2TxDGUfHBvZRJN_doOPhRmAnHWBCmsgMSpE2W", "link": "http://homecookinginmontana.blogspot.com/2012/03/grain-free-crackers-almond-thins.html", "ingredients": ["1 cup raw almonds, ground finely*", "1 egg white", "pinch of salt, or to taste", "you can use store-bought almond meal(1 cup+/-)"], "directions": ["PREHEAT OVEN TO 350 deg.F.", "Finely grind almonds(I used my Vita-mix). Measure out 1 cup almond meal (use a spoon to measure) and place in a bowl. You will have a bit of leftover almond meal... just set it aside.", "To the 1 cup almond meal add a pinch of salt(I used sea salt) and the egg white. Mix with a fork to fully incorporate.", "If mixture is too wet, add some of the reserved almond meal a TBS at a time until the mixture resembles thick peanut butter... and you can form it into a ball without it being too sticky. I ended up using all of the reserved almond meal( maybe another 1/4 cup) as my egg white was from an ex-large egg.", "Place the ball of almond mixture between 2 large parchment papers and roll out very thin...the thinner, the crispier the cracker.", "Cut squares( or any shape you prefer) using a sharp knife... (you can roll and cut the cracker dough on the back of a parchment-lined baking sheet... or you could roll them out on the counter and then place the crackers(with bottom parchment paper) onto a preheated baking stone... which is what I ended up doing).", "Bake crackers until lightly golden... 5-8 minutes depending on thickness. Don't over-brown. Keep a close eye on them as they bake. They can quickly burn. You may need to watch and remove crackers that brown earlier, especially if the dough is not evenly rolled out.", "Allow crackers to cool... they will continue to crisp up a bit. They aren't overly crunchy... more like tender-crisp, if that's a word:)."]}, {"id": "wmte", "title": "Grainy Mustard Soft Pretzels Recipe", "image": "https://images.yumprint.com/p1yumprintnc/NcmJZbkaViJUpdiuP5LSLmhAddWIo_mpXdhYUQAQm-_DHxiyL2PGDeLbjW3hRdlA", "link": "http://www.motherearthliving.com/food-and-recipes/recipes/soft-pretzels-recipe-ze0z1303zgar.aspx", "ingredients": ["• 3 cups all-purpose flour, plus more if needed", "• 3 tablespoons malt powder", "• 1 1/2 teaspoons kosher salt or flaky or coarse sea salt, plus more for sprinkling", "• 1 cup warm water (105° to 110°F)", "• 2 teaspoons (1 envelope) active dry yeast", "• 3 tablespoons grainy mustard", "• 1 tablespoon baking soda", "• 1 large egg yolk", "• 1 1/2 teaspoons water"], "directions": ["Combine the flour, malt powder, and kosher salt in the bowl of a stand mixer fitted with the paddle attachment and blend for a few moments to mix. Form a well in the center of the flour, pour in the warm water, and scatter the yeast over, stirring it in gently. Let sit until the yeast is frothy, about 5 minutes. Add the mustard to the bowl and blend the wet and dry ingredients together at medium-low speed until a cohesive dough forms. Turn the dough out onto a lightly floured work surface and knead it for 2 to 3 minutes, until smooth. (Different types of mustard have varying levels of moisture; you may need to add a bit more flour if the dough is sticky.)", "Transfer the dough to a lightly oiled bowl, turning the dough so it is evenly coated. Cover the bowl with a kitchen towel and set aside in a warm place until doubled in bulk, about 1 hour.", "Preheat the oven to 375°F. Line a rimmed baking sheet with parchment paper or a silicone baking mat. Fill a large, broad saucepan about two-thirds full with water and set it over medium heat to warm while forming the pretzels. (If the water comes to a boil before needed, reduce the heat to low.)", "Turn the risen dough out onto the counter and punch it down. Cut the dough into quarters, then cut each quarter into thirds, for 12 pieces of relatively even size. Cover the dough pieces with a kitchen towel until needed."]}, {"id": "JcQR", "title": "Grilled Avocado Caprese Crostini", "image": "https://images.yumprint.com/p1yumprintgq/gqQlRR0q-mhSd0ceqnlv1iJWUukxkUjN7AhZ9z4-SgLLQ9BSziA30Pv5OEozf_bB", "link": "https://cafedelites.com/grilled-avocado-caprese-crostini/", "ingredients": ["8 pieces sliced French or Italian baguette, sliced 1/2-inch thick", "2 tablespoons olive oil", "1 avocado, sliced thinly", "9 ounces (250 grams) vine ripened cherry tomatoes, halved", "3.5 ounces (100 grams) fresh bocconcini in water (or baby mozzarella balls)", "1/2 cup basil leaves, divided", "2 tablespoons balsamic glaze"], "directions": ["Preheat oven to 375°F | 190°C.", "Arrange bread on a baking sheet, drizzle both sides with olive oil and bake for 15 - 20 minutes until golden, flipping toasts midway through to crisp all over. Rub the crostini with the cut side of the garlic while still warm and season with a little salt and pepper.", "Divide 1/4 cup of the basil leaves on each slice of bread (about 2-3 basil leaves per bread), then top each with the avocado slices, tomato halves and mozzarella (bocconcini). Season with salt and/or pepper to taste.", "Broil (or grill) for 3-5 minutes, or until cheese has started to melt through.", "Finely chop remaining basil leaves and sprinkle over the crostini. Drizzle with balsamic glaze to serve.", "To make these Avocado Caprese Crostini into Avocado Caprese Bruschetta, use a large sourdough loaf and cut your slices into 1 1/2-inch wide slices. Then double or triple the rest of your ingredients to ensure your topping fully covers each slice!"]}, {"id": "xSkE", "title": "Guacamole Deviled Eggs", "image": "https://images.yumprint.com/p1yumprintlc/LC4W8PkvkSN4SNF3k5nxCCU8Z7JOzeKqR62jL7pxNSQIWFvRkdXPIt2NJhGEpCum", "link": "http://www.simplyrecipes.com/recipes/guacamole_deviled_eggs/", "ingredients": ["6 hard boiled eggs*", "2 ripe avocados", "1 Tbsp lime (or lemon) juice", "1/2 teaspoon salt", "1 Tbsp sour cream (can skip if you need dairy-free)", "1 Tbsp chopped cilantro (plus a several leaves for garnish)", "1 serrano or 1/2 jalapeno chile pepper, minced (include the seeds for more heat, leave them out for less)", "1 Tbsp chopped chives or green onion"], "directions": ["Carefully peel the hard boiled eggs and cut them in half lengthwise. Place them on a serving platter. Scoop out the cooked yolks and set aside.", "Cut the avocados in half. Remove the pit. Scoop out the avocado flesh and place in a bowl. (See How to Cut and Peel an Avocado.) Roughly mash with a fork. Use your fingers to break up one or two of the cooked egg yolks (2 to 4 halves) over the mashed avocado. (Reserve the remaining egg yolks for another use.) Sprinkle with lime juice and salt, and stir in the sour cream. Stir in the chopped cilantro, serrano or jalapeño chile pepper, and chives.", "Scoop a generous spoonful of the avocado mixture into each well of the hard boiled egg whites. Top with a small sprig of fresh cilantro or some chopped chives."]}, {"id": "JcQI", "title": "Guacamole Deviled Eggs", "image": "https://images.yumprint.com/p1yumprintrw/RWntWFUfSUR1zm7MMwtKer37UVs_EQ2rMcvnvolzXmZLNP0Uuiov0IL2RogM2gf9", "link": "http://tiphero.com/guacamole-deviled-eggs-2/", "ingredients": ["6 hard-boiled eggs", "1 ripe avocado", "1 ­½ tablespoons lime juice", "1 tablespoon minced Serrano pepper", "¾ teaspoon kosher salt", "1 tablespoon cilantro, chopped, plus more for garnish", "1 tablespoon chives, chopped"], "directions": ["Gently peel the hard-boiled eggs and cut in half lengthwise.", "Scoop out the yolks and place in a small bowl. Rinse the whites in water and place hole­-side-down on a paper towel to dry.", "Cut the avocado in half and remove the pit. Remove the flesh and add to the bowl with the egg yolks.", "With a fork, mash the yolks and avocado together. Add the lime juice and salt, and stir in the chopped herbs and Serrano pepper.", "Flip the egg whites over so the well faces up and generously spoon the avocado mixture into each one.", "Garnish with fresh cilantro and/or chopped chives.", "What an easy way to spice up deviled eggs! Have you ever tried ones like these before? Are there any other twists on deviled eggs you think we should try? If you love the egg and avocado combo, try our baked avocado eggs recipe."]}, {"id": "gHf2", "title": "Guacamole Hummus", "image": "https://images.yumprint.com/p1yumprintu6/u6DSW6qFi3U0TaLvVPhRpCryDi_Jwy3qqglMRlf5JCO0HHox0ETSza7Rf5zta099", "link": "http://www.marthastewart.com/349717/guacamole-hummus?czone=entertaining%2Fappetizer-recipes%2Fclassic-appetizers&gallery=919621&slide=349717&center=946776", "ingredients": ["1 can (15.5 ounces) chickpeas, rinsed and drained", "3 cups fresh cilantro leaves", "1 garlic clove, chopped", "1 ripe avocado, roughly chopped", "3 tablespoons extra-virgin olive oil", "1 teaspoon fresh lemon juice", "Coarse salt and ground pepper", "Lemon wedges", "Tortilla chips"], "directions": ["In a food processor, combine chickpeas, cilantro, garlic, and avocado. Process until finely chopped. With machine running, add olive oil in a slow, steady stream, then add lemon juice, and then add water, 1 tablespoon at a time, until mixture is smooth. Season to taste with salt and pepper and serve with lemon wedges and tortilla chips."]}, {"id": "yspO", "title": "Guacamole-Stuffed Eggs", "image": "https://images.yumprint.com/p1yumprintg9/g9gBaqDBD8FQKz2vml7_IUz5i38-UGdOK8-QqAZCyFOvstZAbiKQvm1vVW5cUPSY", "link": "http://www.eatingwell.com/recipes/guacamole_stuffed_eggs.html", "ingredients": ["6 large eggs", "1 ripe avocado, diced", "1/4 cup prepared fresh tomato salsa", "1 teaspoon lemon juice", "salt and pepper to taste"], "directions": ["Place eggs in a single layer in a saucepan; cover with water. Bring to a simmer over medium-high heat. Reduce heat to low and cook at the barest simmer for 10 minutes. Remove from heat, pour out hot water and cover the eggs with ice-cold water. Let stand in the water until cool enough to handle before peeling. Let cool to room temperature or refrigerate until cold.", "Meanwhile, mash avocado with salsa and lemon juice in a medium bowl until combined, but still a little chunky.", "Cut each egg in half; remove and discard yolks. Fill each half with about 2 teaspoons guacamole. Sprinkle with salt and pepper.", "Make Ahead Tip: Cover and refrigerate the unpeeled hard-boiled eggs for up to 1 week."]}, {"id": "rYpR", "title": "Healthy Homemade Potato Chips", "image": "https://images.yumprint.com/p1yumprintxx/xXbrycv0ctcaiW5q_T0v05uqVM-Y4Zw6FwLkWDkaW7_cdpk811P6_OWJmkUCnnoE", "link": "http://www.strongandbeyond.com/2015/03/healthy-homemade-potato-chips.html#.VbMEo7N3n4Z", "ingredients": ["2 medium potatoes, peeled", "salt and ground black pepper", "garlic, herbs, optional", "1 tbsp olive oil"], "directions": ["Preheat oven to 450 F. Cut the potatoes in 1/8-inch thick round slices. In a pot of boiling water cook the potato slices for 3-5 minute. Drain well and combine with oil, salt, pepper and spices (garlic, oregano, basil, etc) in a large bowl.", "Place potato slices on baking sheet in one layer. Bake for about 15 minutes until crisp and golden brown. Gently remove the chips and place on a cooling rack or parchment paper; let them cool for few minutes before serving. Enjoy!"]}, {"id": "pdvU", "title": "Herb Cream Cheese and Cherry Tomatoes", "image": "https://images.yumprint.com/p1yumprintgz/GZ4Ik4Jzixv_N9Xd50d13dgC9wLH9ztaDAhT-eDaFDmUrXum9cedkDjqKhPWPttR", "link": "http://erecipecards.blogspot.com/2014/09/cucumber-bites-with-herb-cream-cheese.html", "ingredients": ["FOR THE HERB CREAM CHEESE - 4 Ounces (1 Brick) Cream Cheese, Softened to room temperature", "1/4 Cup Ranch Dressing (Yes, good old Hidden Valley)", "2 TBS Dill (can use other spices... Thyme is excellent also)", "3-4 Long Cucumbers. skinned and Slice into thirty 1 inch slices", "15 Cherry Tomatoes, sliced in half", "Additional Sprinkle of Salt (to Taste, Careful, little goes a long way)", "Additional Sprinkle of Spice (same as used in Cream Cheese) for Garnish", "Additional Sprinkle of Paprika OR a Cajun Spice Mix (optional) for Garnish (and an extra kick if you use the Cajun Mix)"], "directions": ["First, Make up the HERB CREAM CHEESE, in a stand mixer, mix the softened Cream Cheese with the Ranch dressing and herbs. Mix until well combined. Spoon into a piping bag with a star tip.", "Prepare the Cucumber, remove peel, Using a fork, score the sides. Slice into 1 inch pieces. Using a melon Baller, remove a portion of the center of one side of the piece of cucumber, leaving a half moon crater.", "Pipe the Herb Cream Cheese into the crater. Enough to stick out of the top about 1/2 inch.", "Add a half Cherry Tomato partially buried into the Herb Cream Cheese", "Sprinkle additional salt, herbs and spice mix for additional color. Chill in the fridge until ready to serve.", "Serve Chilled and ENJOY!"]}, {"id": "A4X3", "title": "Homemade Crackers", "image": null, "link": "http://www.motherearthnews.com/real-food/homemade-crackers-and-hummus-zbcz1503.aspx", "ingredients": ["• 2 cups of whole wheat pastry flour", "• 1 tsp sea salt", "• 2/3 cup warm water", "• 1/3 cup good quality olive oil"], "directions": ["Mix the ingredients together with a fork or spoon, just until combined. At this point, you can add some extras. I like to add flax seed meal, sunflower seeds, black sesame seeds and garlic granules. Add some rosemary if you like. Add whatever flavors and herbs you and your family likes. Of you put in too much, it will start feeling dry, and if that happens, you can add a little more oil.", "Put a piece of parchment paper on your baking pan, preheat your oven to 375 degrees Fahrenheit.", "Oil your hands and start patting the dough out as thin as you can. If it's easier (and sometimes it does work better) lay the parchment paper on the table, and use a rolling pin to roll your dough out as thin as possible. This will create a more uniform dough ( a little less \"home made\" looking, but bakes more evenly) and will allow you to square up your dough a little better.", "Then, using a pizza cutter, or a ravioli wheel (makes a nice design on the cracker edges), or even a sharp paring knife, cut your dough into squares or rectangles. I ground some fresh black pepper and sea salt onto the tops of them (there is enough oil from your hands to hold this on). Then carefully pick up your parchment paper by the edges and lift it back onto the baking pan. Depending on the size of your baking pan, you may need to divide your dough in half and do it in 2 batches.", "Bake these little beauties at 375 degrees for about 15 minutes (or longer). Ovens vary, and sloppy cooks like me mess up baking times, because I put in a little too much water or oil, or basically change recipes because I think something sounds good, so I toss it in. So really, just watch it after 15 minutes, and when the crackers are all golden brown and crispy looking, take them out. Cool on racks, and they will crisp up even more as they cool.", "These crackers are great for appetizers, with toppings. Even something as simple as a small piece of cheese. Or peanut butter. Or - hummus. When I did a workshop recently and brought these crackers, I made a batch of home made hummus to put on them. Everyone raved. In the event you think hummus is only something you buy at the deli...let me help you. Here is my favorite simple hummus recipe, made with canned chickpeas (that I buy by the case for my pantry. I keep them on hand because they are soooo nutritious.)"]}, {"id": "JGcb", "title": "Homemade Multi-Seed Crackers", "image": null, "link": "http://www.eatingwell.com/recipe/267766/homemade-multi-seed-crackers/?utm_source=facebook.com&utm_medium=social&utm_campaign=eatingwell_eatingwell&utm_content=video_recipes&utm_term=2018101911&fbclid=IwAR0IB8GJmWZ2wlZPH7PllXHYUlu7by7V_qo07CXLAqCjybPvTpQhXUbwWjU", "ingredients": ["1 cup cooked brown rice, at room temperature1 cup cooked quinoa, at room temperature¼ cup sesame seeds¼ cup flaxseeds¼ cup sunflower seeds2 tablespoons reduced-sodium tamari2 tablespoons water¼ teaspoon salt¼ teaspoon ground pepper"], "directions": ["Place oven racks in upper and lower sections of the oven. Preheat to 350°F. Cut 3 pieces of parchment paper the size of a large baking sheet. Place rice, quinoa, sesame seeds, flaxseeds, sunflower seeds, tamari, water, salt and pepper in a food processor. Process until finely chopped and coming together in a ball. The dough will be sticky. Divide the dough in half. Place 1 piece of dough between 2 sheets of the prepared parchment paper. Roll out as thin as possible. Remove the top sheet of parchment and place the dough with parchment on a baking sheet. Repeat with the remaining dough and prepared parchment. Bake for 15 minutes. Switch the position of the baking sheets and continue baking until dark around the edges and crisp, 12 to 15 minutes more. Remove from oven and carefully break into roughly shaped crackers. If some crackers aren't fully crisp, return them to the oven and bake for 5 to 10 minutes more.", "To make ahead: Store crackers in an airtight container for up to 1 week."]}, {"id": "tXXU", "title": "Homemade Pita Recipes", "image": "https://images.yumprint.com/p1yumprintvk/vkF1beIdM-AHgJJ0xodtyt2ocka21t3I44Rq7jNzDepofDnV05-8nMpMoOg1qtbG", "link": "http://www.motherearthliving.com/Cooking-Methods/homemade-pita-recipes-roasted-red-pepper-hummus.aspx?utm_source=sailthru&utm_medium=onsite", "ingredients": ["• 1 tablespoon extra-virgin olive oil", "• 2 tablespoons fresh lemon juice", "• 3/4 teaspoon paprika", "• Cayenne pepper to taste", "• 1/2 teaspoon salt", "• 2 to 3 tablespoons water", "• Fresh parsley for garnish", "• 6 pitas, each cut into six wedges"], "directions": ["Blacken the peppers by placing them on the gas or electric burner and turn them with tongs as they blacken. Put the peppers into a paper bag to cool. Process the beans, garlic, thyme, oil, and lemon juice in a food processor.", "Gash each pepper and add any juice to the bean mixture. Scrape off the blackened skin with the blade of a table knife. Quarter each pepper, discarding ribs and seeds. Coarsely chop the quarters and add them to the bean mixture along with the paprika, cayenne, and salt. Process, adding water as needed, until the mixture forms a smooth paste.", "Serve in a bowl garnished with the parsley and surrounded by the pita wedges."]}, {"id": "wYaq", "title": "Homemade Texas Mission Salsa", "image": "https://images.yumprint.com/p1yumprinteo/Eo534ekXT5dnw2FsJyeex9eYWcSklI1tbYRZkC8eyAQNXanPqgDpU71hMCxMiBl3", "link": "http://www.howdoesshe.com/muy-delicioso/", "ingredients": ["1- 28 oz. can of tomatoes, or two smaller cans (whole, sliced, diced…whatever)", "2-4 garlic cloves sliced a couple of times", "1/2 – 1 seeded (unless you live on the wild side) jalapeño pepper", "a fist full of cilantro", "1/4-1/2 of a small onion cut into chunks", "heaping 1/2 tsp. black pepper", "1 tsp. salt"], "directions": ["Blend all ingredients until chopped and mixed well. Eat it up! Refrigerate it if there’s any left over. It’s actually even better after it’s been hanging out in the refrigerator over night because the black pepper flavor comes out more.", "Feeling a little wild and crazy? Add a squeeze of lime."]}, {"id": "tean", "title": "Homemade Vegetable Chips", "image": "https://images.yumprint.com/p1yumprintie/IeSPzg_gvasAoIC2SC5bvc877vxDSdz0geMmLO3_-fEmsebGZkjeTmmUzbuEZefY", "link": "http://www.rodalesorganiclife.com/food/homemade-vegetable-chips?cid=Soc_Facebook_MotherEarthLiving_0915", "ingredients": ["1 medium summer squash", "1 zucchini", "5 baby golden beets, scrubbed", "1 medium parsnip, scrubbed", "1 medium carrot, scrubbed", "3 large kale leaves, rinsed well and torn into 1-inch pieces", "3 tablespoons extra-virgin olive oil"], "directions": ["Place a rack in center of oven and preheat to 250 degrees. Line two rimmed baking sheets with parchment paper.", "With a mandoline or very sharp knife, very thinly slice each of the vegetables lengthwise. Arrange vegetable slices in a single layer on baking sheets and brush with olive oil.", "Bake for 30 minutes, then carefully flip vegetables and return to oven until vegetables are crisp, 30 to 40 minutes longer.", "Let vegetables cool completely on baking sheets, then transfer to an airtight container. They will last up to 2 weeks stored in a cool, dry place."]}, {"id": "iItw", "title": "Hot Corn Dip", "image": "https://images.yumprint.com/p1yumprintel/elwEmzpfvCW0eqjYOr5E5t6XVY3ksnGjHqAatYTIRjcpBsdjWDQUNyF4wUsCcZYh", "link": "http://yeswecoupon.com/hot-corn-dip/", "ingredients": ["2 cups shredded cheddar cheese", "1 cup shredded monterey jack cheese", "2 tbs chipotle peppers in adobo sauce, diced small", "1 small can (4oz) diced green chilies, undrained", "½ cup mayo", "¼ teaspoon garlic powder", "1 11oz can of corn, drained", "1 small tomato", "2 tablespoons cilantro, chopped", "2 tablespoons green onion, sliced thin"], "directions": ["Preheat oven to 350 degrees", "Mix the cheeses, peppers, chilies, mayo, garlic, and corn together. Place in oven safe dish", "Bake 20 minutes or until golden brown and bubbly", "Top with diced tomatoes, green onions, and cilantro. Serve immediately with tortilla chips"]}, {"id": "vLF4", "title": "Hot Creamy Kale Dip", "image": "https://images.yumprint.com/p1yumprintq3/q36jWDvkgzSKnKqo376w1HTpNkrctVls4auojpLFIm6D8UJeH15MX-NqDgOEWjc5", "link": "https://www.yahoo.com/food/hot-creamy-kale-dip-recipe-117803167271.html", "ingredients": ["½ cup raw cashews", "1 tablespoon yellow miso paste", "½ cup water", "1 tablespoon olive oil", "1 cup finely chopped yellow onion", "½ teaspoon ground cumin", "pinch cayenne pepper", "6 cups packed curly kale leaves, finely chopped", "Sea salt", "2 tablespoons fresh lemon juice", "1 tablespoon nutritional yeast", "¼ cup hemp seeds, plus additional for garnish"], "directions": ["Place the cashews, miso paste, and water in a blender and blend until the mixture is as smooth as possible.", "Heat the oil in a large pan over medium-high heat. Add the onion and sauté for 3 to 4 minutes, or until onions are softened and translucent. Add the cumin, cayenne, kale, and a big pinch of salt and cook, stirring constantly, for about 1 minute or until kale is wilted to about half its original size and bright green. Reduce the heat to medium-low and pour in the cashew mixture (don’t clean the blender — you’ll be adding ingredients back into it shortly). Cook the mixture for 3 to 4 minutes longer, stirring constantly to prevent burning. Remove from heat and spoon the kale back into the blender. Add the lemon juice, nutritional yeast, and hemp seeds, and blend to partially puree while still leaving small textural bits of the vegetables intact. (You will likely need to stop the blender several times and manually stir the ingredients back down toward the blades before blending again.)", "Taste the dip, add additional salt as needed, then serve.", "Serving suggestions: Use this dip as a spread for toast or crackers, brown rice cakes, or wrapped in a sprouted tortilla"]}, {"id": "HW_G", "title": "Hot Spinach and Artichoke Dip", "image": "https://images.yumprint.com/p1yumprintny/NyyML7bolmN6WXwCttYKp0mZA44HAlbgjlFtDzWwsaxJVKGec_iitcL6ACRyteMl", "link": "https://www.skinnytaste.com/hot-spinach-and-artichoke-dip/", "ingredients": ["13.75 oz artichoke hearts packed in water, drained", "10 oz frozen spinach, thawed and squeezed", "1/4 cup chopped shallots", "1 clove garlic", "1/2 cup fat free Greek yogurt", "1/2 cup light mayonnaise", "2/3 cup Parmigiano Reggiano", "4 oz shredded part skim mozzarella cheese", "salt and fresh pepper to taste", "olive oil spray"], "directions": ["Preheat oven to 375°F.", "In a small food processor, coarsely chop the artichoke hearts with the garlic and shallots.", "Combine all the ingredients in a medium bowl.", "Place in an oven-proof dish and bake at 375° for 20-25 minutes, until hot and cheese is melted. Serve right away."]}, {"id": "mieT", "title": "Houston's Artichoke Spinach Dip", "image": "https://images.yumprint.com/p1yumprintqd/qD_jZIn7sPofnU5K0TzyYqIGLBbhOcr_lPeFn-H2NhaVk2uzNRo1Ue3lfIeTjhDy", "link": "http://www.copykat.com/2009/03/29/houstons-artichoke-spinach-dip/", "ingredients": ["1 (6.25 ounce) jar marinated artichokes (drained)", "1 (10 ounce) package frozen chopped spinach (thawed and drained very well)", "1/2 teaspoon minced garlic", "1/3 cup freshly grated romano cheese", "1/4 cup Freshly grated parmesan cheese", "1 cup shredded mozzarella cheese", "1/3 cup heavy cream or half and half", "1/2 cup sour cream"], "directions": ["In food processor blend artichokes, Romano cheese, garlic and Parmesan cheese for about 1 - 1 1/2 minutes. Artichokes and cheeses should be minced, but should not be pasty.", "In a mixing bowl add drained spinach, cream, sour cream, mozzarella, stir well. Spoon into mixing bowl mixture from food processor. Blend all ingredients. Mixture should have a medium thick consistency. Spray an oven proof shallow serving dish. Pour artichoke mixture into baking dish and bake for 20 - 25 minutes at 350 degrees.", "Artichoke dip should be a little bubbly and cheese melted through. Remove from oven and serve with your favorite heated tortilla chips, sour cream and salsa and enjoy."]}, {"id": "H6Oq", "title": "How To Make Hummus from Scratch", "image": "https://images.yumprint.com/p1yumprintjm/JMgtgI82ty-r_akhkrkpemVNW8wuc8CdfXGIBBDPZYahCiOWG9wxhqENIp1F38Xh", "link": "https://www.thekitchn.com/how-to-make-hummus-from-scratch-cooking-lessons-from-the-kitchn-107560", "ingredients": ["1 (15-ounce) can chickpeas (about 2 cups drained, cooked chickpeas)", "3 tablespoons extra-virgin olive oil", "3 tablespoons tahini", "1 1/2 tablespoons lemon juice (from 1/2 lemon), plus more as needed", "1 small clove garlic, coarsely chopped", "1 teaspoon salt", "1/2 teaspoon finely ground black pepperServing options: Pita wedges, pita chips, raw sliced vegetables", "Equipment", "Food processor or blender", "Can opener", "Fine mesh strainer", "Measuring cups and spoons", "Citrus reamer, optional", "Rubber spatula"], "directions": ["Drain and rinse the chickpeas. Drain the chickpeas into a strainer, reserving the liquid from the can. If time and patience allows, pinch the skins from each of the chickpeas; this will make your hummus smoother.", "Combine all ingredients in the food processor. Combine the chickpeas, olive oil, tahini, lemon juice, garlic, salt, and pepper in the bowl of the food processor fitted with the blade attachment or blender.", "Blend hummus until smooth, at least 5 minutes. Process the hummus continuously until it becomes very smooth, 5 minutes. Scrape down the sides of the bowl as needed to integrate any large chunks.", "Taste and adjust seasonings. Taste and add more of any of the ingredients to taste. If your hummus is stiffer than you'd like, blend 2 to 3 tablespoons of the reserved chickpea liquid to thin it out and make the hummus creamier.", "Transfer to a bowl and serve. Scrape the hummus into a bowl and serve with pita chips or raw vegetables.", "Hummus Variations:", "• For even tastier and more authentic hummus, try cooking your own chickpeas from scratch: How to Cook Beans on the Stovetop", "• Add 1 to 3 teaspoons of spices for more flavor, like cumin, sumac, harissa, or smoked paprika.", "• Drizzle a little pomegranate molasses or sprinkle a pinch of sumac on top.", "• For a roasted vegetable hummus, blend in 1 cup of roasted vegetables such as eggplant, zucchini, bell peppers, or garlic.", "• For an olive hummus, fold in 3/4 cup of chopped green or black olives.", "• For a nutty hummus, blend in some lightly toasted walnuts, almonds, or pine nuts.", "• For a more lemony hummus, add 1/4 cup of chopped preserved lemons.", "Storage: Hummus will also keep for up to 1 week in a sealed container in the refrigerator."]}, {"id": "BpSe", "title": "Hummus Recipe", "image": "https://images.yumprint.com/p1yumprint_f/_FTXnNURuKZ4w9IhvgqijKf9YsafIYhICUCvyregIeOuKX6reCyyVshNBSD1hHbT", "link": "https://draxe.com/recipe/hummus/", "ingredients": ["2 cups garbonzo beans, drained", "1/3 cup tahini", "¼ cup lemon juice", "1 teaspoon sea salt", "2 cloves garlic, minced", "1 tablespoon olive oil", "paprika to taste"], "directions": ["Place all ingredients into a food processor and blend until smooth."]}, {"id": "J1f1", "title": "Hummus Recipe", "image": "https://images.yumprint.com/p1yumprint_t/_Tb3HwEIeSX5iPGYWTe9qKvVkhNU4GEfzcKXFZMKO44qZfF1n0ulzssiO3bHxtsO", "link": "https://www.themediterraneandish.com/how-to-make-hummus/?utm_content=buffere17cb&utm_medium=social&utm_source=twitter.com&utm_campaign=buffer_mel_twitter", "ingredients": ["3 cups (200 grams) cooked chickpeas, peeled (from 1 to 1 1/4 cup dry chickpeas or from quality canned chickpeas. See recipe notes for more instructions on cooking and peeling chickpeas)", "1 to 2 garlic cloves, minced", "3 to 4 ice cubes", "1/3 cup  (79 grams) tahini paste", "½ tsp kosher salt", "Juice of 1 lemon", "Hot water (if needed)", "Early Harvest Greek extra virgin olive oil", "Sumac"], "directions": ["Add chickpeas and minced garlic to the bowl of a food processor. Puree until a smooth, powder-like mixture forms.", "While processor is running, add ice cubes, tahini, salt, and lemon juice. Blend for about 4 minutes or so. Check, and if the consistency is too thick still, run processor and slowly add a little hot water. Blend until you reach desired silky smooth consistency.", "Spread in a serving bowl and add a generous drizzle of Early Harvest EVOO. Add a few chickpeas to the middle, if you like. Sprinkle sumac on top. Enjoy with warm pita wedges and your favorite veggies."]}, {"id": "A4XU", "title": "Hummus Recipe", "image": "https://images.yumprint.com/p1yumprint4o/4OSby4RMXXMmXhcrEH1_3GEhDCaHb4DHFKlNZDhd8R2RLDCgr0IMulWUWv6oo87_", "link": "http://www.motherearthnews.com/real-food/homemade-crackers-and-hummus-zbcz1503.aspx", "ingredients": ["• 1/4 cup lemon juice", "• 1/4 cup water", "• 2 15-ounce cans of garbanzo beans, one drained, one with liquid", "• 1/4 cup raw sesame seeds", "• 1 tbsp olive oil", "• 2 garlic cloves, peeled (more if you like it really garlicky)", "• 1 tsp ground cumin", "• 1/2 tsp sea salt"], "directions": ["Put all ingredients into your blender and process until smooth. It tastes even better if you can make it ahead of time and allow it to sit in the fridge so the flavors can meld. This is a simple hummus recipe. Hummus is a staple of many Middle Eastern countries, especially Israel, Palestine and other Arabic regions. It's made of ingredients that would be found in any middle eastern garden and kitchen. It can be used as a dip or a sandwich spread. It is a powerhouse of nutrition...between the chickpeas and the sesame seeds and the lemon juice and the garlic — wow !! Hummus is high in Iron and Vitamin C, contains significant amounts of folate and Vitamin B6. It's high in protein and dietary fiber from the beans. Contains the amino acid methionine, which complements the protein of the chickpeas. Hummus serves as a complete protein when served with bread."]}, {"id": "ng3Y", "title": "Individual Seven-Layer Dips", "image": "https://images.yumprint.com/p1yumprintry/RYbWsrmSW_581DU__geQJCmjDwN0aKYloeZ0FLhkpBH2gEgtmclbK__Bm81KxyY2", "link": "http://www.the-girl-who-ate-everything.com/2011/12/individual-seven-layer-dips.html", "ingredients": ["1 (16 ounce) can refried beans", "1 (1 ounce) package taco seasoning", "1 cup guacamole or make homemade guacamole", "1 (8 ounce) container sour cream", "1 cup chunky salsa or pico de gallo; or make homemade pico de gallo", "1 cup shredded cheddar or Mexican blend cheese", "2 Roma tomatoes, diced", "1/2 bunch of green onions, sliced", "1 (2.25 ounce) can of sliced olives, drained", "8 (9 ounce) plastic tumblers", "tortilla chips"], "directions": ["In a small bowl mix taco seasoning with refried beans. Some people prefer to mix their taco seasoning with the sour cream layer but I wanted a bright white layer so I did it with the beans.", "Here's how the layers are assembled:", "Layer 1: beans and taco seasoning; Layer 2: sour cream; Layer 3: guacamole; Layer 4: salsa or pico de gallo; Layer 5: cheese; Layer 6: tomatoes; Layer 7: green onions and olives", "In each plastic glass, layer about 2 Tablespoons of the beans, followed by 2 Tablespoons of sour cream, 2 Tablespoons of guacamole, 2 Tablespoons of salsa or pico de gallo, and 2 Tablespoons of cheese. Make sure you drain your salsa or pico to get the excess liquid out before you pour it on. Then top with about 1-2 teaspoons of tomatoes, olives, and green onion (If making ahead of time, wait to add these toppings until shortly before serving).", "Garnish with one tortilla chip. Store in the refrigerator until serving and serve with chips. Makes around 8 individual dips."]}, {"id": "JEUL", "title": "Jalapeno Popper Deviled Eggs", "image": "https://images.yumprint.com/p1yumprintjs/jSo9mAo-EkGm9U9ATV9FUkxvbt1o41eYrNSucqD7kINFrvILseSzaxSUj-u1kK14", "link": "https://www.bhg.com/recipe/jalapeno-popper-deviled-eggs/?utm_source=facebook.com&utm_medium=social&utm_campaign=eatingwell_eatingwell&utm_content=video_internalcrosspromotion&utm_term=2018101515", "ingredients": ["cup shredded pepper jack cheese", "hard cooked eggs", "tablespoons mayonnaise", "tablespoons cream cheese, softened", "jalapeno, seeded and finely chopped", "tablespoons sliced green onions", "Salt and pepper", "3", "slices bacon, crisp cooked and finely crumbled", "Chili powder"], "directions": ["Preheat oven to 400F. Line a baking sheet with parchment paper. Place about 1 tablespoon of the shredded cheese on prepared sheet; pat into a 2-inch circle. Repeat with remaining cheese, allowing 2 inches between circles. Bake for 7 to 8 minutes or until bubbly and lightly golden. Let stand on baking sheet for 1 to 2 minutes or until cooled but still pliable. Carefully peel off paper. Place cheese crisps on a wire rack; cool completely. Once cool, break cheese crisps into smaller pieces.", "Halve hard-cooked eggs lengthwise and remove yolks. Set whites aside. Place yolks in a small bowl; mash with a fork. Add mayo, cream cheese, jalapeno, green onions; mix well Season to taste with salt and pepper. Fill the egg halves with the yolk mixture and top each egg half with a bit of crispy cheese and bacon. Sprinkle with chili powder."]}, {"id": "gcPI", "title": "Kale Chips", "image": "https://images.yumprint.com/p1yumprintwv/WV8TWdKNpj4rveiEdblAgNL6NFBHw5jDxVg0WOOTulKhnObAm8DCO79-T1ps8x1W", "link": "http://rabbitfoodformybunnyteeth.com/kale-chips/", "ingredients": ["1 bunch curly kale", "1 Tbsp olive oil", "1/2 tsp ground sea salt or seasoning salt to taste (one of my favorites is Lawry’s)"], "directions": ["Preheat oven to 350 degrees. Rinse and dry kale leaves. Remove kale leaves from stems. Place the leaves in a mixing bowl and drizzle with olive oil. Massage the kale until the olive oil is evenly coated onto the kale. Place kale directly onto a baking sheet and sprinkle with sea salt or seasoning. Don’t worry about perfectly spacing out the Kale chips on the baking sheet, they can slightly overlap because they will shrink dramatically in size. Place the baking sheet in the oven and bake for 10-15 minutes or until crisp, moving the chips around and flipping them half way to ensure that they are evenly baked.", "Note: Kale chips shrink after they are baked, so let the leaves be bigger than you would like them to be before baking. Below is a photograph of the kale chips before and after the baking process."]}, {"id": "LjQm", "title": "Keto Pizza Roll-Ups", "image": "https://images.yumprint.com/p1yumprintl0/l0Z-VvMK57gzGxTDyHDq-hUfTHWAWxALelisa8wBmP8Znwr7v5DlSTGUZ_fCICyx", "link": "https://hip2keto.com/recipes/easy-keto-pizza-roll-ups/?fbclid=IwAR0wLzUzDGT3lWU4mqC3e6fbJSfVhP6rm24xJIWZ0XIMmvrbliQHpoVM6jw", "ingredients": ["11 slices of mozzarella cheese", "Mini pepperoni slices", "Italian seasoning", "Favorite keto dipping sauce"], "directions": ["Preheat oven to 400 degrees.", "Line a cookie sheet with parchment paper. Place sliced cheese on parchment paper to avoid any sticking. Put in the oven for 6 minutes or until cheese slices start to brown around the edges.  Remove from the oven.", "Sprinkle Italian seasoning on melted cheese and add as little or as much pepperoni as you would like. I did 3 mini slices per cheese slice.", "Give the cheese about 2 minutes to cool, then gently roll them up and serve."]}, {"id": "o-le", "title": "Lemongrass Chicken Wings", "image": "https://images.yumprint.com/p1yumprinto5/O543dCVFnT0h2F7Pktj3b5gvkxs4B5OTw48zj2jwvPyyYlXH9p4l86dY2rLoeQRB", "link": "https://www.yahoo.com/food/lemongrass-chicken-wings-recipe-from-good-food-111523105976.html", "ingredients": ["1 cup plus 1 tablespoon Green Curry Paste (recipe below)", "1 tablespoon butter, at room temperature Chopped fresh cilantro, for garnish", "1 lime, cut into wedges"], "directions": ["Cut the chicken wings through the center joint to separate the drummettes. Transfer to a large bowl.", "Rub the chicken with 1 cup of the curry paste to coat. Cover and marinate in the refrigerator for at least 2 hours.", "Prepare a grill for medium heat. Oil the grill grate.", "Grill the chicken wings for about 10 minutes, turning as needed, or until slightly charred and cooked through. In a bowl, toss the chicken with the remaining 1 tablespoon curry paste and butter to coat. Transfer to a platter, sprinkle with cilantro, and serve immediately with lime wedges.", "Make-Ahead: The chicken can be marinated for up to 2 days.", "Green Curry Paste", "Makes 2 cups", "2 teaspoons coriander seeds", "2/3 cup packed fresh cilantro leaves", "1/3 cup packed fresh basil leaves", "2 large shallots, peeled and quartered", "8 garlic cloves", "2 lemongrass stalks, trimmed to 8 inches and thinly sliced", "1 4-inch piece fresh ginger, peeled and coarsely chopped", "4 Thai chiles or small serrano chiles, coarsely chopped", "2 kaffir lime leaves, coarsely chopped", "2 tablespoons fish sauce", "1/4 cup canola oil", "Heat a small heavy sauté pan over medium heat. Add the coriander seeds and stir for about 3 minutes, or until toasted. Transfer the coriander seeds to a plate to cool.", "In a small food processor, combine the coriander seeds, cilantro, basil, shallots, garlic, lemongrass, ginger, chiles, and lime leaves and process, stopping occasionally to scrape down the sides of the bowl, until very finely chopped. Add the fish sauce and oil and process, stopping occasionally to scrape down the sides of the processor, until a coarse paste forms."]}, {"id": "eTq3", "title": "Lighter Spinach & Artichoke Dip", "image": "https://images.yumprint.com/p1yumprintjw/jWOmrSOUdLNxZ26DKMdpiVNxecrgb3hYGsG4qd3uvuS4R732fl11E9TR5AiFy-TL", "link": "http://www.recipegirl.com/2014/01/20/lighter-spinach-and-artichoke-dip/", "ingredients": ["2 cups (8 ounces) shredded part-skim mozzarella cheese, divided", "1/2 cup fat-free sour cream, divided", "1/4 cup (1 ounce) grated fresh Parmesan cheese, divided", "1/4 teaspoon black pepper", "3 cloves garlic, minced", "1 (14 ounce) can artichoke hearts, drained and chopped", "2 (8 ounce) packages 1/3-less-fat cream cheese, at room temperature", "1 (10-ounce) package frozen chopped spinach, thawed, drained and squeezed dry"], "directions": ["Preheat oven to 350°F. Spray 1 1/2-quart baking dish with nonstick spray.", "Combine 1 1/2 cups mozzarella, sour cream, 2 Tablespoons Parmesan, pepper, garlic, artichoke hearts, cream cheese and spinach in a large bowl. Stir until well-blended. Spoon the mixture into the prepared baking dish. Sprinkle with 1/2 cup mozzarella and the remaining 2 Tablespoons Parmesan.", "Bake for 40 minutes or until bubbly and golden brown on top. Serve with vegetables or chips (extra calories for the chips!)", "Nutritional Information per serving:", "Serving size: About 1/3 cup", "Calories per serving: 106", "Fat per serving: 6.3g", "Saturated Fat per serving: 4.3g", "Sugar per serving: .8g", "Sodium per serving: 228.2mg", "Fiber per serving: .8g", "Protein per serving: 6.2g", "Cholesterol per serving: 20.4mg", "Carbohydrates per serving: 3.6g"]}, {"id": "lit5", "title": "Liver Pate", "image": "https://images.yumprint.com/p1yumprintqr/QrNbFBT1LU-ChIufbigSHIH8ZZVEFAat7jHXg7XT5IFwdg_t5a2qaZL9DOqUMTiU", "link": "http://www.thenourishinggourmet.com/2009/08/5-dish-delicious-flavorful-pate-liver-at-its-best.html", "ingredients": ["1 pound of chicken livers, washed", "1 cup of minced onions", "Garlic, three cloves, minced", "1 teaspoon dried thyme", "1/4 cup of", "8 fillets of anchovies", "(I used ones wrapped in capers)", "1/4 cup of white wine", "1/4 teaspoon nutmeg", "1/4 teaspoon allspice", "pinch of red pepper flakes", "ghee, plus two more tablespoons", "(Butter could be used as well)"], "directions": ["1-Over high heat in a large saucepan, heat ghee. Add onions when hot, stir, cooking for about 5 minutes, or until softened, add garlic and thyme, cook for a minute or two more. Take off of heat and pour this mixture into food processor.", "2-Heat the remaining two tablespoons of ghee until hot and add livers, cook until done on the outside but still a bit pink in the inside, add to food processor.", "3-To food processor add:anchovies, wine, nutmeg, allspice and pepper flakes.", "Process until well pureed and all of the ingredients are well combined.", "I usually form my pate’s in three 8 ounce ramekins. I place some plastic wrap in the ramekins, followed by the pate. I freeze two of them, and place on in the fridge. When the pate is set, I turn it out onto a plate and remove the plastic wrap. It’s as simple as that!"]}, {"id": "DvjE", "title": "Macadamia Zucchini Hummus", "image": "https://images.yumprint.com/p1yumprintps/PSHwW8aF-4FtVfV1V3Xgi08w9E0B14NB81R88dHasqBx9FAcVrhDdI41PqtJ-jhx", "link": "http://blog.radiantlifecatalog.com/bid/66496/Soaked-Nut-Hummus-with-Macadamias-and-Zucchini", "ingredients": ["1/2 large zucchini, peeled and chopped (about 1 3/4 cup)", "1/2 cup sprouted macadamia nuts (purchased or homemade)", "2 tbsp tahini", "2 tbsp unrefined olive oil", "Juice from 1 lemon", "1-2 cloves garlic", "1 tsp sea salt, celtic salt or himalayan salt", "1 tsp cumin", "3 Easy Steps"], "directions": ["Toss your ingredients into a food processor.", "Blend on high until well-mixed. Texture should be even and just slightly grainy.", "Garnish with paprika (if you are feeling fancy that is) and serve!"]}, {"id": "zQWL", "title": "Making Sprouted Hummus", "image": "https://images.yumprint.com/p1yumprint-c/-chqS9Kv4fAEVjB4_Bml25E1Y1qsBJg3LCorpMfyVt9iao-agmMlcOMeRFweV6rS", "link": "http://nourishedkitchen.com/sprouted-hummus-recipe/", "ingredients": ["½ cup dried Palouse Brand Garbanzo Beans (buy them here)", "1 clove garlic", "1 minced serrano pepper, optional", "3 tablespoons fresh lemon juice", "1 teaspoon unrefined sea salt", "2 tablespoons sesame tahini", "½ cup extra virgin olive oil (see sources)"], "directions": ["Rinse the garbanzo beans, and pick out any loose bits of debris. Place them in a bowl, and cover them with warm water by two inches. Cover, and allow them to soak at least 18 and up to 24 hours. Drain the beans and rinse them well.", "Pour the beans into a fine-mesh sieve or into a sprouting jar (available here). Rinse and drain the beans two to three times a day for two to three days, or until the sprouts barely emerges from the tip of the bean.", "Rinse the beans well, and pour them into a medium saucepan, cover with water, and bring to a boil over high heat. Reduce the heat to medium and continue simmering the beans for 1½ hours, or until tender. Drain and rinse well in cold water.", "Slip the papery skin that envelops the garbanzo beans off, and place the beans into the basin of a food processor. Add the garlic, serrano pepper, lemon juice, salt and tahini. Pulse for ten seconds until the ingredients are loosely blended.", "Pour the olive oil into the feeder tube, so it drips into the basin of the food processor in a slow and thin stream, and process until the olive oil is spent and the hummus is well-emulsified. Serve immediately, or spoon into an airtight container. It will keep in the fridge about a week.", "Cook 8 cups chickpeas in a pressure cooker. Bring to the boil and (very important!) remove any froth that appears before fixing the pressure lid. After 30 minutes pressure cooking turn off heat and let sit for a few hours.", "Drain water and keep aside then place the chickpeas in a large mixing bowl.", "Use a ‘stick’ blender to mince and combine the chickpeas with 2 cups fresh lemon juice & pulp, 1cup chopped fresh garlic and 2 cups tahini. Take your time blending and add a few spoons of cooking water if necessary. The blender will feel hot after a few minutes; give it a rest until cool. Blend until the mixture is smooth and creamy. Fill containers with the hummus. Freezes well. Add chilli, olive oil, herbs etc before serving."]}, {"id": "r3ic", "title": "Making Sprouted Hummus", "image": "https://images.yumprint.com/p1yumprintcm/CmLVuueBdozTSRlBl7onwbef4aWuVrMccWAU03Ts5xjjSt2XrcCG_R5xZh_o5SOl", "link": "http://nourishedkitchen.com/sprouted-hummus-recipe/", "ingredients": ["1/2 cup dried Palouse Brand Garbanzo Beans (buy them here)", "1 clove garlic", "1 minced serrano pepper, optional", "3 tablespoons fresh lemon juice", "1 teaspoon unrefined sea salt", "2 tablespoons sesame tahini", "1/2 cup extra virgin olive oil (see sources)"], "directions": ["Rinse the garbanzo beans, and pick out any loose bits of debris. Place them in a bowl, and cover them with warm water by two inches. Cover, and allow them to soak at least 18 and up to 24 hours. Drain the beans and rinse them well.", "Pour the beans into a fine-mesh sieve or into a sprouting jar (available here). Rinse and drain the beans two to three times a day for two to three days, or until the sprouts barely emerges from the tip of the bean.", "Rinse the beans well, and pour them into a medium saucepan, cover with water, and bring to a boil over high heat. Reduce the heat to medium and continue simmering the beans for 1 1/2 hours, or until tender. Drain and rinse well in cold water.", "Slip the papery skin that envelops the garbanzo beans off, and place the beans into the basin of a food processor. Add the garlic, serrano pepper, lemon juice, salt and tahini. Pulse for ten seconds until the ingredients are loosely blended.", "Pour the olive oil into the feeder tube, so it drips into the basin of the food processor in a slow and thin stream, and process until the olive oil is spent and the hummus is well-emulsified. Serve immediately, or spoon into an airtight container. It will keep in the fridge about a week."]}, {"id": "sJl4", "title": "Mango + Avocado Salsa on Pan-Seared Salmon", "image": "https://images.yumprint.com/p1yumprintey/EyXJSfSDznHw7w9F8HbJrxc1Dduj51qv1LRAQ_2_44-STOPpAeUOx3wd51NiXalo", "link": "http://nomnompaleo.com/post/56076300574/mango-avocado-salsa-on-pan-seared-salmon", "ingredients": ["2 cups diced ripe mango (about 2 mangos)", "½ cup finely diced red onion", "1 cup diced Hass avocado (1 medium avocado)", "¼ cup minced fresh cilantro", "2 tablespoons extra virgin olive oil", "freshly ground black pepper", "big pinch of kosher salt", "¼ teaspoon red pepper flakes", "Juice from 1 lime"], "directions": ["Grab two ripe mangos and dice them up.", "Clueless about mangos? Check out this video from the National Mango Board, which shows you how to pick a ripe one and cut it up.", "Place the diced mango in a bowl…", "…and add all the other ingredients, like so:", "Stir to combine, and adjust for seasoning. Easy, right?"]}, {"id": "m8UF", "title": "Mango Jerk Wings", "image": "https://images.yumprint.com/p1yumprintxi/XIL1EiIsRsc5cH4NzbAegK_Ya7H9kRHU15Fj7USzpH-8qtJmLihc4z_Q3-2nO3k6", "link": "https://www.yahoo.com/food/mango-jerk-super-bowl-wings-from-grandbaby-cakes-108844179986.html", "ingredients": ["1 tablespoon olive oil", "½ medium sized onion, diced", "1½ cups mango, cubed", "¼ cup fresh-squeezed lime or lemon juice", "⅔ cup mango nectar or orange juice", "2 tablespoons brown sugar", "1 tablespoon honey", "1½ teaspoons allspice", "1 teaspoon ginger", "1 teaspoon cinnamon", "½ teaspoon paprika", "¼ teaspoon cayenne", "1 teaspoon ground nutmeg", "¼ teaspoon ground cloves", "2 teaspoons garlic powder", "1½ pounds chicken wings, split at the joints", "Salt and pepper, to taste"], "directions": ["Add olive oil to pan, and cook onion until soft. Next, sauté mango until tender.", "Add mango, lime (or lemon) juice, mango nectar (or orange juice), brown sugar, honey, and all spices to blender or food processor and blend until smooth. If it needs to thin a bit more, add a little bit more lime and mango juice.", "Pour marinade into a large resealable bag and add chicken to marinade to submerge it completely. Seal and refrigerate for at least 4 hours, and up to 8 hours.", "Preheat oven to 425 degrees and line a baking sheet with nonstick foil or parchment paper.", "Remove chicken from marinade and season with salt and pepper on both sides. Bake chicken on first side for 15 minutes, then turn over. For more flavor, feel free to baste chicken with marinade during cooking. Cook for another 10-15 minutes or until chicken is completely done, marinade is sticky on chicken, and it is browned."]}, {"id": "uQv_", "title": "Mayo-Free Egg Salad Topped Crostinis", "image": "https://images.yumprint.com/p1yumprintiw/IwxH_vKWvQdpUSMKSjkb8s01qMfkn27V-vbNk01sqAEArCwsxMZGHx8EjWkPw0gw", "link": "http://thewholetara.com/mayo-free-egg-salad-topped-crostinis/", "ingredients": ["5 hard-boiled eggs", "1 avocado", "½ lemon, squeezed", "salt and pepper, to taste", "1 baguette whole-wheat bread, sliced"], "directions": ["In a medium sized bowl, with a fork mash the hard boiled eggs. Add avocado and mash with the eggs to form a chunky mixture.", "Squeeze lemon into the bowl and season with salt and pepper. Taste and adjust seasoning accordingly.", "Lightly toast the bread in a preheated oven and top with egg salad."]}, {"id": "KjG-", "title": "Meatballs Recipe", "image": "https://images.yumprint.com/p1yumprintci/cinw0AAJbrH0c4doEo2l7pTFiKRHod-wBShu1tnmuegL7ku83mgIQAJv2Dpo_sXP", "link": "https://thewellnesswayclinics.com/meatballs-recipe/?fbclid=IwAR0E8lKRWDQRVPm284yro_oFYGFMHrkNXVefinNljGyW3zhW6dTe4VV8z0o", "ingredients": ["– 1 lb ground venison, buffalo, or beef", "– 2 teaspoons oregano", "– 1 teaspoon Italian seasoning", "– 1/4 cup of diced onion", "– 1 teaspoon salt", "– 2 teaspoons organic beef bouillon (no MSG or sugar)", "– 1/4 cup shredded cheese (optional)"], "directions": ["Stir all ingredients together, then let sit in refrigerator overnight", "Shape into round balls", "Fry in pan with coconut oil or bake at 350 degrees until cooked all the way through"]}, {"id": "KoiX", "title": "Mediterranean Tuna Salad Bites", "image": "https://images.yumprint.com/p1yumprint-t/-tuzDtKa3EYLP_GHhJq1-lqYoyUzJ6Sqvom8NP4boxqLOAoBoL2r0n2Bc70ens1y", "link": "https://marisamoore.com/greek-tuna-salad-bites/?fbclid=IwAR0PxpM4qDAdD5dWKGF3BbwjvhhO9FOeab-mwRR5UPl2vvKFBU-B9OIlUeg", "ingredients": ["2 medium cucumbers sliced into thick rounds", "2- 6 ounce can white tuna drained and flaked", "Juice of 1/2 a lemon", "½ cup diced red bell pepper", "¼ cup diced sweet or red onion", "¼ cup chopped black olives", "2 tablespoons minced garlic", "2 tablespoons extra virgin olive oil", "2 tablespoons fresh parsley finely chopped", "Salt pepper and dried oregano to taste"], "directions": ["Slice the cucumber into rounds. (I prefer to leave the skin on for color, fiber and to make it easier to hold the appetizer.) Set aside.", "In a medium bowl, use a fork to combine the remaining ingredients. Mix well. Place 1 heaping spoonful of tuna salad onto each of the cucumber rounds."]}, {"id": "tgi1", "title": "Microwave Potato Chips", "image": "https://images.yumprint.com/p1yumprint37/37NDPRAbxy6-9g1kJej5-43OODvYqJyAS1lKgBXiO2oK-v1tJskY-PhjjkQGzitS", "link": "http://www.eatingwell.com/recipes/microwave_potato_chips.html", "ingredients": ["1 1/3 pounds Yukon Gold or red potatoes, unpeeled, scrubbed", "2 teaspoons extra-virgin olive oil", "1/2 teaspoon salt"], "directions": ["Slice potatoes into thin (1/8-inch) rounds. Toss the slices in a medium bowl with oil and salt to coat evenly.", "Coat a large microwave-proof plate with cooking spray. Arrange some potato slices in a single layer on the plate. Microwave, uncovered, on High until some slices start to brown, 2 to 3 minutes (depending on potato thickness and microwave power). Turn the slices over and continue microwaving until they start to crisp and brown around the edges, 2 to 4 minutes more. Check frequently and rearrange slices as needed to prevent scorching. Transfer the chips to another plate and allow to cool completely. (They will crisp more as they cool.) Repeat with the remaining potato slices."]}, {"id": "v63e", "title": "Middle Eastern Layered Dip", "image": "https://images.yumprint.com/p1yumprint_z/_Z7FFOM1xym376cxp2LLA83Hp6O--u98rkQFYLzOvaJ1IAan8wIVBJI1xeo7ve_Z", "link": "http://www.eatingwell.com/recipes/middle_eastern_layered_dip.html?socsrc=ewfb0111167", "ingredients": ["1 8-ounce container prepared hummus", "1 cup nonfat or low-fat plain Greek yogurt", "1 cup chopped unpeeled English cucumber", "1 medium tomato, chopped", "1/3 cup sliced Kalamata olives", "1/3 cup crumbled feta cheese", "1 teaspoon dried oregano", "1 teaspoon sumac (optional; see Tip)"], "directions": ["PREPARATION", "Spread hummus in a shallow 2-quart dish. Layer yogurt, cucumber, tomato, olives and feta on top. Sprinkle with oregano and sumac (if using) just before serving.", "TIPS & NOTES", "Make Ahead Tip: Assemble up to 1 hour ahead.", "The tart red berries of the Mediterranean sumac bush add fruity, sour flavor to many regional dishes. Find ground sumac in Middle Eastern markets, specialty food shops and online at penzeys.com."]}, {"id": "v52v", "title": "Onion Flavored Chia Seed Crackers...Gluten-free, Nut-Free, Egg-Free.", "image": "https://images.yumprint.com/p1yumprint8t/8tWxIIXcdn0FT9pyY-chqWc04vJar8PfsPhMnB62nPT253GmgYIlr5BziLggcnbV", "link": "http://homecookinginmontana.blogspot.com/2013/04/chia-seed-crackersgluten-free-nut-free.html", "ingredients": ["1 cup chia seeds", "1 cup water", "2 TBS sesame seeds", "2/3 cup raw pumpkin seeds", "2/3 cup raw sunflower seeds", "2 tsps onion powder", "1 1/4 tsp kosher salt, or to taste"], "directions": ["Preheat oven to 170 deg F...  for a raw version use a dehydrator.", "Line a sheet pan with parchment paper", "Mix chia seeds and water... it will thicken rather quickly.", "Add rest of the ingredients and mix to combine thoroughly.", "Using wet or oiled hands spread mixture unto parchment paper and spread thinly and evenly... as thin as you can get it... maybe 1/4 inch thickness.", "Place in preheated oven and bake for 60-70 minutes.... turn cracker \"sheet\" over and bake another hour or so... depending how thin you spread the cracker.  If you find it difficult to turn the cracker(in case it breaks), use another cookie sheet to help you turn it over... as you would use a plate to turn over a big pancake in a skillet:).", "Turn heat off and allow cracker to dry out in the oven.  I just left mine overnight in the oven.", "Break cracker sheet in smaller pieces. Serve as a snack or with dip of choice..."]}, {"id": "pdyH", "title": "Onion Strings", "image": "https://images.yumprint.com/p1yumprintrt/rTw___2_Hgk1J6b5vgbhm9KXTMQQMbad1LVJKsNTPKu8hx3Nh4OckRoTkK7h3vZh", "link": "http://thepioneerwoman.com/cooking/2008/03/onion-strings-oh-yeah-baby/", "ingredients": ["1 whole Large Onion", "2 cups Buttermilk", "2 cups All-purpose Flour", "1 Tablespoon (scant) Salt", "1/4 teaspoon (to 1/2 Teaspoon) Cayenne Pepper", "1 quart (to 2 Quarts) Canola Oil", "Black Pepper To Taste"], "directions": ["Slice onion very thin. Place in a baking dish and cover with buttermilk and soak for at least an hour.", "Combine dry ingredients and set aside.", "Heat oil to 375 degrees.", "Grab a handful of onions, throw into the flour mixture, tap to shake off excess, and PLUNGE into hot oil. Fry for a few minutes and remove as soon as golden brown.", "Repeat until onions are gone.", "Eat before your family sees them.", "Repeat with another onion, because they’ll be really mad they didn’t get any."]}, {"id": "gO2l", "title": "Paleo Zucchini chips", "image": null, "link": "http://www.paleoforever.com/awesome-paleo-zucchini-chips-recipe/", "ingredients": ["One Zucchini", "Paleo friendly cooking spray", "Salt & Pepper"], "directions": ["Slice your Zucchini as thin as possible. I just use a food processor. It is faster and more consistent with the slicing.", "Pre-heat your oven to 225 degrees Fahrenheit.", "Spray your baking sheet with your paleo friendly cooking spray.", "Lay out all the chips and spray cooking sprat lightly on the chips.", "Bake for about 45 minutes to an hour, or until they get to the right level of crispiness for you.", "Eat within two to three hours.", "Comment: I realized these come out way better if you just broil them for 10-15 mins."]}, {"id": "vLIL", "title": "Parmesan and Herb Crisps", "image": "https://images.yumprint.com/p1yumprinto5/o5GWnWmB3koplVXkFomDmAUNWNdHn7o2EvZvvbrBbWAi69jw-C99EX2nfYo5T3AP", "link": "https://www.yahoo.com/food/parmesan-and-herb-crisps-are-the-perfect-party-155350864.html", "ingredients": ["1 clove garlic, minced", "1 tablespoon parsley, finely chopped", "1 tablespoon marjoram, finely chopped", "1 tablespoon chives, finely chopped", "¼ teaspoon lemon zest", "¼ teaspoon freshly cracked pepper"], "directions": ["Preheat oven to 350°F (180°C). Toss cheese with garlic, parsley, marjoram, chives, lemon zest, and pepper until combined. With a tablespoon measure, create generous mounds of the mixture and place onto parchment paper-lined baking sheets, spacing them at least 2 inches apart. Tamp each down gently with the back of the tablespoon to flatten slightly.", "Bake 7 to 10 minutes, or until golden brown and crunchy. Cool completely. Store in airtight container, between pieces of wax paper or parchment paper, for up to two days."]}, {"id": "A53A", "title": "Parsnip and Carrot Chips Recipe", "image": null, "link": "http://www.motherearthliving.com/food-and-recipes/recipes/carrot-chips-recipe-parsnip-ze0z1303zgar.aspx", "ingredients": ["3 large carrots (about 1 pound)", "2 large parsnips (about 1 pound)", "Vegetable oil, for frying", "1 teaspoon kosher salt or flaky or coarse sea salt", "1/2 teaspoon minced fresh thyme"], "directions": ["After peeling one of the carrots, use the vegetable peeler to peel away long strips from the whole length of the carrot, allowing the strips to drop into a large bowl. Turn the carrot in your hand about one-quarter turn after every 4 or 5 strips, so you’ll generally have strips of similar width and length overall. Do the same with the remaining carrots and the parsnips, both of which have a tough core that should be discarded once you get there (the color tends to change slightly).", "Pour about 2 inches of oil into a large heavy saucepan (the oil should not come more than halfway up the sides of the pan). Bring to 375°F over medium heat.", "While the oil is heating, combine the salt and thyme in a small dish and rub them together between your fingers for a bit to release the aromatics of the thyme.", "Carefully add a handful of the vegetable strips to the oil and fry until lightly browned and crisp, 1 to 2 minutes. Use the back of a slotted spoon to gently press the strips down into the oil and spread them out a bit to help ensure even cooking. When crisped, lift out the strips and scatter them on paper towels to drain. Repeat with the remaining vegetable strips, allowing the oil to reheat between batches as needed.", "Transfer the chips to a serving bowl, sprinkle the thyme-salt mixture over them, and serve. They will be best served shortly after frying."]}, {"id": "Cfba", "title": "Pear-Pecan Cheese Ball", "image": "https://images.yumprint.com/p1yumprintp7/p7BL26neNpXDR5fl26vssmKUgiVFeNEzG9EMc2oaL0OqTLk-lOpwSo618J-lfQWZ", "link": "http://www.eatingwell.com/recipe/252865/pear-pecan-cheese-ball/", "ingredients": ["8 ounces reduced-fat cream cheese, softened1 1/4 cups shredded extra-sharp Cheddar cheese", "1 medium firm ripe pear, finely chopped1 scallion, white and green separated, finely chopped1/2 teaspoon salt1/4 teaspoon ground pepper1/3 cup finely chopped toasted pecans"], "directions": ["Stir cream cheese, Cheddar, pear, scallion white, salt and pepper together in a medium bowl. Coat a large piece of plastic wrap with cooking spray. Scoop the cheese mixture onto it. Using the plastic wrap to help you, form the cheese mixture into a ball, then completely wrap in plastic. Refrigerate for at least 1 hour and up to 2 days. Just before serving, combine pecans and the reserved scallion greens in a shallow dish. Roll the cheese ball in the mixture, pressing to adhere."]}, {"id": "pdy-", "title": "Pioneer Woman’s Classic Hummus", "image": "https://images.yumprint.com/p1yumprintdx/dx0luiKDzEWA5W1KW-Q10xvgvs0oT7AHYhms3Ix8cPdQFIscTrEkDRmWLFCOA_QO", "link": "http://thepioneerwoman.com/cooking/2009/05/classic-hummus/", "ingredients": ["3 cans (14.5 Oz.) Garbanzo Beans, Rinsed And Drained", "1/3 cup Plus 1 Tablespoon Tahini", "3 cloves Garlic, Chopped, Or More To Taste", "1/2 whole Lemon, Juiced", "1/2 teaspoon Ground Cumin, Or More To Taste", "Salt To Taste", "Fresh Basil Or Italian Parsley", "3 Tablespoons To 5 Tablespoons Cold Water", "1 Tablespoon Olive Oil"], "directions": ["Combine chickpeas with all ingredients, except water and olive oil, in a blender or food processor.", "Pulse until mixture becomes somewhat smooth and combined, but do not over mix.", "Add water as necessary to facilitate blending. At the end, add olive oil and pulse no more than three times, just to incorporate.", "Pour mixture into a bowl and stir to ensure mixture is combined. Serve immediately or refrigerate for up to three days in the fridge."]}, {"id": "eNde", "title": "Pomegranate Guac", "image": "https://images.yumprint.com/p1yumprintq3/q3rGlCNUBRcbub0S-0lrfOGPgGtsvG-LawZYrETJlBpmy2HCYFc_Lb98L3DZXTKU", "link": "http://recipes.carlosvelez.net/munchies/pomegranate-guac/", "ingredients": ["2 Avocados, diced very small", "1/4 cup onions, diced", "1 Tbsp jalapeño, diced", "1/3 cup cilantro, finely chopped", "1/2 lime, juiced", "1/4 cup pomegranate seeds (see the video below for how to de-seed a pomegranate)", "3/4 cloves of garlic, roasted or raw", "Salt to taste", "California Citrus Rub to taste", "Beanfield's Sea Salt flavored Bean & Rice Chips (see the picture below)"], "directions": ["Dice onions and raw garlic (if you don't have roasted garlic on hand)", "If you have roasted garlic, just mince it", "Heat butter or coconut oil in a small pan", "Add onions and cook for a few minutes", "Add raw garlic and cook until lightly browned and set aside", "In a medium sized bowl mix all ingredients and serve with those delicious chips!", "Notes", "We roast a chicken about once a week, and roast a whole head of garlic with it. The chicken is delicious, the broth we make with the bones is delightful, and the roasted garlic is insane. We get to add it to delicious food like this guacamole all week!"]}, {"id": "jgK7", "title": "Pulled Pork Nachos Fit for Game Day", "image": "https://images.yumprint.com/p1yumprint37/37DqJpTmQafDVtXJm6o_53HkID6EGfqXomxMsmSO53d6fvIlGTgp7-WZ6EFyiuiJ", "link": "https://www.yahoo.com/food/pulled-pork-nachos-forever-94845542403.html", "ingredients": ["2 pounds pulled pork, smoked or not, warm", "2 hearts of romaine, shaved", "1 bag yellow corn chips", "1 cup heavy cream", "16 slices American cheese", "1/2 cup red onion, small dice", "1/2 cup green onion, sliced into thin rings", "1 cup shredded mozzarella"], "directions": ["Combine all the ingredients for the sauce in a medium sized sauce pan and stir to combine. Place the pan over medium heat and bring the sauce to a simmer. Reduce the heat to low and let it sit for half and hour. Remove the sauce from the heat until needed.", "Heat the oven to 500° F. Line an 18 x 13-inch half sheet tray with foil. Spread the shaved romaine lettuce across the bottom of the pan. Top with half the mozzarella and sprinkle with half the red onion. I know you think this step is crazy, but the wilted romaine that soaks up any and all juices will be your favorite part of the nachos. Trust me.", "Lay the bag of chips on its side and open it from the bottom. This keeps all the broken bits on the bottom, and the whole, good-looking chips stay on top. Place the bag onto the lettuce bottom side-down, and lift it slowly. Spread the chips out if needed.", "Place the cream in a small saucepan and bring it to a boil over medium heat. Add the slices of cheese, a slice or two at a time, only adding more when the first slices have melted. Be careful with the heat — the sauce can scorch. When all the slices have melted, turn the heat down to a simmer.", "Dress the pork with a couple of tablespoons of sauce just to dampen it. Don’t bathe the pork in the sauce. Spread the pork out across the top of the chips, then sprinkle with the remaining mozzarella.", "Place the nachos into the oven and bake 10 minutes or until the chips on top begin to brown. Remove the tray from the oven.", "Using a large spoon, drizzle the warm barbecue sauce across the chips to taste. It doesn’t require as much sauce as you might think, plus the pork is already coated too, and you can always serve more sauce on the side.", "Spoon the cheese sauce across the top, then top with the green onion and the remaining red onion. Serve."]}, {"id": "J5tR", "title": "Pumpkin Seeds with Everything Bagel Seasoning", "image": "https://images.yumprint.com/p1yumprintd7/d7rRzvg7wTI9uUA1VBoku2WgZybZX8Vq275skqSDR96Bdrsuc4qoQdhkSWc_3-0z", "link": "http://www.eatingwell.com/recipe/260752/pumpkin-seeds-with-everything-bagel-seasoning?utm_medium=social&utm_campaign=eatingwell_eatingwell&utm_content=link_recipes&utm_source=facebook.com&utm_term=D25B7656-04A2-11E9-9370-C08C0F4A2151&fbclid=IwAR36NjBG41dkmcu-Yv3jbdc2Iirgkjl3w_L545JVoqKIFIu_XfstXQUm23Q", "ingredients": ["2 cups pumpkin seeds", "1 teaspoon dried minced garlic", "1 teaspoon dried minced onion", "1 teaspoon poppy seeds", "1 teaspoon sesame seeds", "1 teaspoon salt½ teaspoon ground pepper", "1 egg white, beaten until frothy"], "directions": ["Preheat oven to 300°F. Spread pumpkin seeds on a large rimmed baking sheet in an even layer. Bake, stirring once, until lightly toasted, about 40 minutes. Meanwhile, combine dried garlic, dried onion, poppy seeds, sesame seeds, salt and pepper in a small bowl. Remove the pumpkin seeds from the oven and carefully transfer to a medium bowl. Pour egg white over the pumpkin seeds and stir to coat. Sprinkle the garlic mixture over the pumpkin seeds; stir to coat. Return the pumpkin seeds to the baking sheet and spread in an even layer. Bake until lightly browned, 10 to 15 minutes more. Cool completely before serving.", "To make ahead: Store airtight for up to 3 days."]}, {"id": "noV-", "title": "Raw Onion Bread", "image": "https://images.yumprint.com/p1yumprint7h/7HAPL2Vc5Xt2rpAftXMN0K1rTJL37XTFk5LvFSQyoUadELgjoSRI3eGhkbw4mr88", "link": "http://golubkakitchen.com/2010/03/raw-onion-bread.html", "ingredients": ["1/2 lb yellow onions – sliced", "1 cup raw sunflower seeds – soaked for 1 hour", "1/4 cup nama shoyu", "1/4 cup olive oil", "1 cup flax seeds – ground in a coffee grinder"], "directions": ["In a food processor, whirl onions, sunflower seeds, nama shoyu and olive oil until smooth. Add flax seeds and blend until thoroughly combined. Spread on Teflex sheets, sprinkle with poppy seeds, brown/golden/both flax seeds, light/black/both raw sesame seeds, sunflower seeds, and minced parsley. With wet hands press all the garnishing ingredients into the batter. Dehydrate at 105F for 6 hours. Flip, carefully peel the sheet away, and dehydrate for another couple of hours, until the batter is no longer sticky. Cut into crackers of desired size. Return the pieces onto trays and dehydrate for a total of 18-24 hours. Keep refrigerated in air-tight glass containers."]}, {"id": "CE_y", "title": "Roasted Beet Hummus", "image": "https://images.yumprint.com/p1yumprint-s/-sbSReQq8TKUlED06zrK4GKLlpgY5DXSEYPILvMawpPW63IR_6mCiuYDNxL1E_rO", "link": "http://www.eatingwell.com/recipe/256574/roasted-beet-hummus/", "ingredients": ["1 (15 ounce) can no-salt-added chickpeas, rinsed 8 ounces roasted beets, coarsely chopped and patted dry ¼ cup tahini ¼ cup extra-virgin olive oil ¼ cup lemon juice 1 clove garlic 1 teaspoon ground cumin ½ teaspoon salt"], "directions": ["Combine chickpeas, beets, tahini, oil, lemon juice, garlic, cumin and salt in a food processor. Puree until very smooth, 2 to 3 minutes. Serve with veggie chips, pita chips or crudités."]}, {"id": "jKAV", "title": "Roasted Figs", "image": "https://images.yumprint.com/p1yumprintd6/D695e5e2w_r9i5uIxu6bOgFxJKu9hLt3ncP5Bw3AoaHa9qQU1RNqLP1N8dBF_ypq", "link": "http://www.popsugar.com/food/Easy-Roasted-Fig-Goat-Cheese-Recipe-9205886", "ingredients": ["12 Black Mission figs, halved vertically", "1 tablespoon unsalted butter", "3 tablespoons balsamic vinegar", "3 tablespoons honey", "2-3 ounces fresh goat cheese", "Flaky sea salt, to taste"], "directions": ["Preheat the oven to 400ºF.", "While the oven preheats, melt the butter in a small saucepan, along with the balsamic vinegar, honey, and a hefty pinch of salt. Bring to a boil, then reduce to a simmer and cook about 5 minutes, or until slightly thickened.", "Place the figs, cut side up, in a baking dish the size of a pie pan. Top each fig half with a 1/2 teaspoon to 1 teaspoon of goat cheese. Drizzle the balsamic vinegar syrup over the figs.", "Roast in the oven until very soft, 10 to 15 minutes.", "Arrange on a platter and sprinkle with flaky salt."]}, {"id": "eF7l", "title": "Roasted Red Pepper Hummus", "image": "https://images.yumprint.com/p1yumprintwd/wDRe9-Vuz0CRP4IhE9cHeIgyAe7QqynTxLFfr-3CIXt9bueJwseeq-nOakrr9l4S", "link": "http://evolvingmotherhood.com/2010/03/roasted-red-pepper-hummus.html", "ingredients": ["1 (15 oz) can chick peas", "1 garlic clove", "juice of half a lemon", "3 whole roasted red peppers", "1/4 cup Olive Oil", "salt to taste"], "directions": ["In a blender or food processor, blend the chick peas, garlic, lemon juice, roasted red peppers, and olive oil until the ingredients form a creamy, paste-like consistency. Salt to taste and serve with whole wheat crackers, pita chips, or veggies."]}, {"id": "CE_A", "title": "Roasted Red Pepper Hummus", "image": "https://images.yumprint.com/p1yumprintpb/pBt3T6S43e0wSl6jTSzxgcUukb97AkKeFBtsgwzFOsgkZf-zjQS3Xu3UYVaNevOd", "link": "http://www.eatingwell.com/recipe/256573/roasted-red-pepper-hummus/", "ingredients": ["1 (15 ounce) can no-salt-added chickpeas, rinsed 1 (7 ounce) jar roasted red peppers, drained and blotted dry ¼ cup tahini ¼ cup extra-virgin olive oil ¼ cup lemon juice 1 clove garlic 1 teaspoon ground cumin ½ teaspoon salt"], "directions": ["Combine chickpeas, peppers, tahini, oil, lemon juice, garlic, cumin and salt in a food processor. Puree until very smooth. Serve with veggie chips, pita chips or crudités."]}, {"id": "Jm6N", "title": "Roasted Tomato Caprese Summer Rolls", "image": null, "link": "https://www.cookinglight.com/recipes/roasted-tomato-caprese-summer-rolls/?utm_source=facebook.com&utm_medium=social&utm_campaign=eatingwell_eatingwell&utm_content=internalcrosspromotion_cookinglight&utm_term=2018091115", "ingredients": ["2 cups halved cherry tomatoes 1 tablespoon olive oil 1/2 teaspoon garlic powder 1/2 teaspoon dried oregano 1/4 teaspoon kosher salt 1/2 cup balsamic vinegar 8 (6-inch) rice paper wrappers 1 cup loosely packed fresh basil leaves 5 ounces fresh mozzarella cheese, torn into bite-size pieces 1 cup shredded romaine lettuce"], "directions": ["Preheat oven to 425°F. Combine tomatoes and oil on a baking sheet lined with parchment paper; toss to coat. Sprinkle with garlic powder, oregano, and salt. Roast in until lightly caramelized, 14 to 16 minutes. Cool to room temperature, about 5 minutes.", "Meanwhile, bring vinegar to a boil in a small saucepan over medium-high; reduce to medium-low, and simmer until reduced by half, about 5 minutes. Remove from heat; set aside.", "Fill a 9-inch pie dish with warm water. Dip 1 wrapper in warm water; let soak 5 seconds. Lay flat on a clean work surface, place a large basil leaf on one end so that half of the basil leaf is hanging out of wrapper. Leaving a 1-inch border, fill center of wrapper with a row of shredded lettuce. Top with a row of 3 to 4 cheese pieces, 3 to 4 tomato halves, and more basil. Fold end of wrapper (opposite large basil) leaf over, and tightly roll into a cylinder so basil leaf end is open, and other end is sealed tightly. Transfer to a clean baking sheet. Repeat with remaining wrappers, basil, lettuce, cheese, and tomatoes. Store in refrigerator covered with a damp towel until ready to eat. Serve with balsamic reduction on the side."]}, {"id": "pJ_h", "title": "salsa verde cruda", "image": "https://images.yumprint.com/p1yumprintk0/k0XP29i3c_P2pGxO-nGFKE5LDQunv_PgXz-46znhDfs_M0swMRzgv0LwMZxtd1Dt", "link": "http://www.foodrepublic.com/2012/01/16/salsa-verde-cruda-recipe", "ingredients": ["12 tomatillos", "3 fresh serrano chiles, sliced", "1/4 cup white onion, chopped", "1/4 teaspoon minced garlic", "salt"], "directions": ["Blend all the ingredients together. You can decide if you want the salsa chunky or smooth, just be sure you don’t blend too much. You still want to be able to see the seeds from the tomatillos.", "Taste for salt and serve in bowl or a mortar.", "Feel free to add some chopped white onion, chopped cilantro and diced avocado for more texture and flavor."]}, {"id": "fk-8", "title": "Savory Sweet Potato Balls", "image": "https://images.yumprint.com/p1yumprintya/yA9vvyV3kgvu6M11EUP9uGUApcAjezdPeIru8mo03dxcgruq-Dq8pjQUnXFu7PpK", "link": "http://www.betternutrition.com/avoid-gluten-holiday-foods/food/goglutenfree/1430", "ingredients": ["1\u0007½ lbs. sweet potatoes (about 2 medium), peeled and cut into small chunks", "2 Tbs. organic extra virgin olive oil", "4 Tbs. almond meal or ground pecans", "5/8 tsp. unrefined sea salt", "½ tsp. gluten-free garlic powder", "½ tsp. dried oregano", "2 \u0007tsp. fresh thyme leaves, minced, or ¼ tsp. ground dried thyme", "4 Tbs. thinly sliced spinach leaves", "1 medium shallot, minced", "6 Tbs. finely chopped pecans"], "directions": ["Preheat oven to 400°F. Steam sweet potato pieces over medium heat in medium pot until tender, about 10–15 minutes. Allow sweet potatoes to cool slightly, then place them in food processor. Add olive oil, almond meal, salt, garlic powder, oregano, and thyme, and process until smooth. Turn food processor off, and mix in spinach, shallot, and pecans until well distributed.", "Drop batter by rounded tablespoon on parchment-lined cookie sheet. Using slightly wet hands, round each spoonful of batter into smooth ball with slightly flat bottom. Bake 20 minutes. Allow to cool 5–10 minutes before removing from parchment paper and serving.", "Makes 28 balls", "These morsels make a nice appetizer at a holiday party, and the balls also go very well with eggs and turkey sausage for brunch. For a more carb-conscious option, omit the pecans, reduce the amount of salt and shallot, and use the batter as a spread in collard wraps stuffed with turkey or chicken pieces."]}, {"id": "CpdU", "title": "Sesame Nori Roasted Cashews", "image": "https://images.yumprint.com/p1yumprint3a/3aZBsSKG0STFMWBl8gZf41Pgt-I9MnJSZI1QJYewZxittz0rISon4mrRgjXUNw1G", "link": "http://gourmandeinthekitchen.com/sesame-nori-roasted-cashews/?utm_content=buffer07bce&utm_medium=social&utm_source=facebook.com&utm_campaign=gitkbuffer", "ingredients": ["2 sheets of nori", "2 cups/224g cashews , raw", "2 Tablespoons/30g maple syrup", "1 Tablespoon/15ml coconut oil", "2 Tablespoons/30ml coconut aminos (or gluten-free tamari)", "2 Tablespoons/14g white sesame seeds", "2 Tablespoons/14g black sesame seeds", "½ tsp sea salt"], "directions": ["Preheat oven to 350 F.", "Place nori sheets directly on oven rack and toast for 3-5 minutes until crisp. Remove from oven and set aside.", "Place cashews on a baking sheet and roast for 5-7 minutes until barely golden.", "Meanwhile, in a small saucepan over medium heat, combine the maple syrup, coconut oil and coconut aminos. Cook stirring constantly until the mixture becomes frothy and slightly sticky (about 2 minutes.)", "Add the roasted cashews and stir until coated. Tear the toasted nori sheet with your hands and stir into the cashews along with the sesame seeds.", "Pour the mixture back onto the sheet pan, spreading it out in a single layer, then sprinkle with sea salt. Return to oven and roast for an additional 7 minutes until browned.", "Remove from oven and let cool on the sheet pan.", "Allow to cool complete before storing in an airtight container or serving."]}, {"id": "uB_J", "title": "Sesame Nori Roasted Cashews", "image": "https://images.yumprint.com/p1yumprint3a/3aZBsSKG0STFMWBl8gZf41Pgt-I9MnJSZI1QJYewZxittz0rISon4mrRgjXUNw1G", "link": "http://gourmandeinthekitchen.com/2015/sesame-nori-roasted-cashews/?utm_content=bufferb7024&utm_medium=social&utm_source=twitter.com&utm_campaign=buffer", "ingredients": ["2 sheets of nori", "2 cups/224g cashews , raw", "2 Tablespoons/30g maple syrup", "1 Tablespoon/15ml coconut oil", "2 Tablespoons/30ml coconut aminos (or gluten-free tamari)", "2 Tablespoons/14g white sesame seeds", "2 Tablespoons/14g black sesame seeds", "½ tsp sea salt"], "directions": ["Preheat oven to 350 F.", "Place nori sheets directly on oven rack and toast for 3-5 minutes until crisp. Remove from oven and set aside.", "Place cashews on a baking sheet and roast for 5-7 minutes until barely golden.", "Meanwhile, in a small saucepan over medium heat, combine the maple syrup, coconut oil and coconut aminos. Cook stirring constantly until the mixture becomes frothy and slightly sticky (about 2 minutes.)", "Add the roasted cashews and stir until coated. Tear the toasted nori sheet with your hands and stir into the cashews along with the sesame seeds.", "Pour the mixture back onto the sheet pan, spreading it out in a single layer, then sprinkle with sea salt. Return to oven and roast for an additional 7 minutes until browned.", "Remove from oven and let cool on the sheet pan.", "Allow to cool complete before storing in an airtight container or serving."]}, {"id": "vAe9", "title": "Sesame Sunflower Seed Grain Free Cracker Recipe", "image": "https://images.yumprint.com/p1yumprint70/70YDXJpjoX1UbzCrZoTJvWcRx2agq5H2RYHmzoEHfIgLJU5XXAnOanZvXbRFut-c", "link": "http://www.healthhomeandhappiness.com/grain-free-crackers-made-with-sesame-and-sunflower-seeds.html", "ingredients": ["1 cup unsalted sunflower seeds, hulled (I have also used pumpkin seeds with great success!) ~buy sprouted pumpkin or sunflower seeds here~", "1 teaspoon sea salt (the coarse kind is fine)", "3 cloves of garlic, peeled", "1 cup sesame seeds, hulled ~buy sprouted sesame seeds here~", "Up to 1/4 cup water"], "directions": ["Preheat oven to 350 degrees.", "In the bowl of the food processor, using the regular metal blade, combine the sunflower seeds, salt, and garlic. Turn food processor on and let it whir for 2-3 minutes until the seeds have turned into a dense flour. Add in the sesame seeds and pulse to mix (the sesame seeds don’t need to mix all the way in). Slowly add in the water, a couple tablespoons at a time, until the seeds all clump together in a ball. Remove and knead to distribute the sesame seeds through the sunflower seed mixture. The mixture isn’t a very pretty color at this point, but it improves beautifully with baking.", "Between parchment paper, roll the dough out until it is very thin for crisper crackers, or up to 1/4 inch thick for more sturdy crackers, in as close to a rectangle shape as possible. Using the parchment paper, flip the whole rectangle of dough onto a cookie sheet, keep the crackers on a layer of parchment paper to bake for easy removal. Cut into rectangles with a pizza cutter or sharp knife. We’ll use the cut lines to break the crackers on after they’re cooked.", "Bake for 15-20 minutes, or until golden brown. Allow to cool while still on the cookie sheet, then break along scored lines and serve."]}, {"id": "zpKR", "title": "Sesame-Thyme Crackers with Whipped Feta", "image": "https://images.yumprint.com/p1yumprintnf/NFvp8sEZZ_8w3kXfgfMPYBOJrkUs8_kWksA-PTZRJu-H5HVF-R0_mRIY4o0HUEqP", "link": "http://www.countryliving.com/food-drinks/recipes/a38503/sesame-thyme-crackers-with-whipped-feta-recipe/", "ingredients": ["1/4 c. extra-virgin olive oil, plus more for baking", "2 1/2 c. all-purpose flour, spooned and leveled, plus more for work surface", "1/2 c. whole wheat flour, spooned and leveled", "3 tbsp. sesame seeds", "1 tbsp. fresh thyme leaves", "2 tsp. Kosher salt", "1 tbsp. Honey", "Flaky sea salt, optional", "Tomato-Shallot Spread"], "directions": ["Preheat oven to 425 degrees F. Lightly oil two baking sheets.", "Whisk together flours, sesame seeds, thyme, and salt in a bowl. Make a well in the center and add oil, honey, and 1 cup cold water. Stir with a wooden spoon until dough comes together. Turn out onto a lightly floured work surface and knead until dough is soft and supple, 4 to 6 minutes. Cover with plastic wrap and let rest, at room temperature, 30 minutes.", "Divide dough into 4 pieces. Roll 2 pieces, one at a time, on a lightly floured work surface into a roughly 16\"-x-12\" rectangle. Transfer to prepared baking sheets. Lightly brush dough with oil. Season with flaky sea salt, if desired.", "Bake, rotating sheets from front to back and top to bottom halfway through, until golden and bubbly, 8 to 12 minutes. Cool completely on baking sheets. Repeat with remaining dough.", "Serve whole or broken into pieces, with Whipped Feta and Tomato-Shallot Spread alongside."]}, {"id": "Cpbc", "title": "Shiitake Mushrooms and Bitter Greens in Phyllo Recipe", "image": "https://images.yumprint.com/p1yumprintr6/R6kDBy9_So0ZsInS0NuRF-d16y5J2xRV6QehkL9kuWrExjdgDZQfYe9bFNBw3HHT", "link": "http://www.motherearthliving.com/food-and-recipes/recipes/winter-recipes/shittake-mushrooms-and-bitter-greens-in-phyllo-zm0z16ndzfol", "ingredients": ["• 2 tablespoons grapeseed oil", "• 4 garlic cloves, minced", "• 1 large red onion, diced", "• 20 shiitake mushroom caps, thinly sliced", "• 2 tablespoons mirin", "• 4 cups chopped bitter leafy greens (collards, kale, mustard greensor dandelion greens)", "• Sea salt and freshly ground black pepper", "• 1 package phyllo dough (at least 9 sheets)", "• Extra virgin olive oil"], "directions": ["In a large saute pan over medium heat, saute garlic and onion in grapeseed oil until soft. Add mushrooms and saute 5 minutes. Stir in mirin and greens, cover and cook 5 minutes or until greens wilt and turn bright green. Season with salt and pepper to taste and set aside to cool.", "Preheat oven to 350 degrees. Defrost phyllo according to directions on package. On dry surface, lay out 2 sheets of phyllo — one on top of the other. Brush or spray lightly with olive oil, top with one more sheet of phyllo and again brush or spray with oil. Cut sheets from top to bottom into 4 strips.", "Gently scoop out filling, draining excess liquid from each scoop, and place along edge of phyllo closest to you at the bottom of each strip. Fold bottom corner up and over greens to opposite edge and continue folding, as you would fold up a flag, until you reach the top of each strip. Continue making pockets until all greens are used up. Gently place pockets on parchment-lined cookie sheet, brush or spray lightly with olive oil and bake 25 minutes or until dough is golden brown."]}, {"id": "eB8e", "title": "Shrimp & Cucumber Appetizers", "image": "https://images.yumprint.com/p1yumprintuc/Ucm88Q4Sls4etLoLTTpUOj_pM7xxhw0ai-dF4AfDMLlzJwrs3LIoZiqBN5ZNCNvS", "link": "http://wellnessmama.com/4848/shrimp-cucumber-appetizers/", "ingredients": ["1 cucumber (organic if possible since you are leaving some of the skin on)", "½ cup strained greek yogurt (You can also use cream cheese, but this version has probiotics)", "10-12 shrimp (precooked)", "1 t. dried dill or fresh", "pinch of sea salt"], "directions": ["Peel the cucumber in alternating strips to leave a striped look on the outside.", "Slice the cucumber into ¼ to ½ inch slices and put on a plate.", "Mix the strained greek yogurt or cream cheese with the dill, salt and pepper.", "Put a small amount of the yogurt mix on top of each piece of cucumber and top each one with a (precooked) shrimp.", "Serve immediately or keep in fridge up to six hours."]}, {"id": "yFpD", "title": "Shrimp Ceviche", "image": "https://images.yumprint.com/p1yumprintvc/Vc-bMDD8troR1goNLkmagMkKjyFKDSNlaL5gwoh9LZvoLMQggCdK0PIJHKBsEjZ-", "link": "http://www.eatingwell.com/recipes/shrimp_ceviche.html?socsrc=ewfb0415162", "ingredients": ["2 quarts water", "1/4 cup kosher salt", "CEVICHE", "1 pound raw shrimp (21-25 per pound), peeled and deveined", "Juice of 2 lemons", "Juice of 2 limes", "Juice of 2 oranges", "1 cup diced seeded peeled cucumber (1/4-inch dice)", "1/2 cup finely chopped red onion", "2 serrano chiles, seeded and finely chopped", "1 cup diced seeded tomato", "1 avocado, chopped into 1/2-inch pieces", "1 tablespoon roughly chopped cilantro leaves, plus more leaves for garnish", "1/4 cup extra-virgin olive oil", "1/4 teaspoon kosher salt"], "directions": ["Combine water and 1/4 cup salt in a large saucepan; bring to a boil over high heat. Add shrimp and immediately turn off the heat. Let the shrimp sit until just cooked through, about 3 minutes. Transfer to a cutting board until cool enough to handle, about 10 minutes.", "Chop the shrimp into 1/2-inch pieces and place in a medium nonreactive bowl (see Tip). Add lemon, lime and orange juice. Stir in cucumber, onion and chiles. Refrigerate for 1 hour.", "Stir tomato, avocado, chopped cilantro, oil and 1/4 teaspoon salt into the shrimp mixture. Let stand at room temperature for 30 minutes before serving. Garnish with cilantro leaves, if desired.", "TIPS & NOTES", "Make Ahead Tip: Prepare through Step 2 and refrigerate for up to 4 hours.", "Kitchen Tip: A nonreactive bowl or pan—stainless-steel, enamel-coated or glass—is necessary when cooking with acidic foods, such as lemon, to prevent the food from reacting with the pan. Reactive pans, such as aluminum and cast-iron, can impart an off color and/or off flavor."]}, {"id": "vLJa", "title": "Shrimp Cocktail with Three Sauces from ‘Martha Stewart’s Appetizers’", "image": "https://images.yumprint.com/p1yumprintsi/SI6coVBSA9mlFinW79KFC6da31vdTCEeD95g3bCoD8ULNEXKni1-eb6_vZPvOeW-", "link": "https://www.yahoo.com/food/shrimp-cocktail-with-three-sauces-from-martha-128281281896.html", "ingredients": ["1 lemon, halved", "2 dried bay leaves", "Coarse salt", "2 pounds shell-on large shrimp (16 to 20 count)", "Two-Ingredient Sauces (recipes follow), for serving"], "directions": ["Once cool, boiled shrimp can be refrigerated, covered, up to 1 day.", "about shrimp", "Most shrimp is flash-frozen before being sold at fish markets and grocery stores, so you can buy packages from the freezer section without sacrificing quality. Whenever possible, look for shrimp labeled “wild-caught,” and with the shells and tails intact, which will help keep the shrimp moist and plump during cooking."]}, {"id": "v5OI", "title": "Slow Cooker Spinach Artichoke Dip", "image": "https://images.yumprint.com/p1yumprintvj/vJqWRyhc9bLvuBoxl9ppBch5Sz8IlcM390L9M_0xMCzDv-EQlv0NjT22cGU_R2Tw", "link": "http://www.gimmesomeoven.com/slow-cooker-spinach-artichoke-dip/", "ingredients": ["1 (10 oz.) bag fresh baby spinach, roughly chopped", "1 (13.75 oz.) can quartered artichoke hearts, chopped and drained", "1 (8 ounce) brick low-fat cream cheese, cut into 1-inch cubes", "1 cup light sour cream or plain Greek yogurt", "1 cup shredded Mozzarella cheese", "1/2 cup grated Parmesan cheese", "1/3 cup finely-chopped white or red onion", "4 cloves garlic, minced", "1/2 tsp. black pepper", "1/4 tsp. salt"], "directions": ["Combine all ingredients in a large mixing bowl and stir until evenly combined.  (You can also stir the mixture actually inside the bowl of your slow cooker, but it would be easier in a large mixing bowl.)  Transfer the mixture to the bowl of your slow cooker, that has been misted on the inside beforehand with cooking spray.", "Cook on low for 3-4 hours or on high for 2 hours, or until the dip is completely warmed through and the cheese is melted.  Give the dip a good stir and season with extra salt and pepper if needed.", "Transfer to a serving dish, and serve warm with chips or bread or pita crackers or whatever dippers you'd like."]}, {"id": "yspX", "title": "Slow-Cooker Chicken Enchilada Dip", "image": "https://images.yumprint.com/p1yumprintq0/Q0Uku6khw9vtdc4mWTLsbbfJe1QzZ12yXiweE34XLBQ1x4lLt9OcW6gzPUnmLV9M", "link": "http://www.eatingwell.com/recipes/slow_cooker_chicken_enchilada_dip.html?socsrc=ewfb0421153", "ingredients": ["2 cups chopped fresh tomatoes (about 2 medium)", "1 cup chopped onion", "2 cloves garlic", "1 fresh jalapeño pepper, stemmed", "1 tablespoon chili powder", "1 teaspoon ground cumin", "3/4 teaspoon salt", "1 pound boneless, skinless chicken breast", "8 ounces reduced-fat cream cheese", "1 15-ounce can black beans, rinsed", "1 cup corn, fresh or frozen (thawed)", "1 cup shredded sharp Cheddar cheese", "2 tablespoons sliced scallions", "2 tablespoons chopped fresh cilantro"], "directions": ["Combine tomatoes, onion, garlic, jalapeño, chili powder, cumin and salt in a blender. Puree until smooth.", "Pour the sauce into a 5- to 6-quart slow cooker. Nestle chicken into the sauce. Cover and cook on High for 3 hours or on Low for 6 hours.", "Remove the chicken and shred using two forks. Stir the chicken back into the sauce in the slow cooker. Add cream cheese, beans, corn and Cheddar. Stir to combine. Cover and cook on High until the cheese is melted and the sauce is hot, 10 to 15 minutes.", "Serve the dip topped with scallions and cilantro.", "Make Ahead Tip: Cover and refrigerate for up to 1 day. Reheat before serving.", "Could also be made without chicken for veggie dip."]}, {"id": "CoVX", "title": "Slow-Cooker Chicken Enchilada Dip", "image": "https://images.yumprint.com/p1yumprintlo/LOX1VZsHFF2IOepiCtEwrLtzb_AlTRns66AzCEc8LHY8M66xSU5vsVGKxOYWQtat", "link": "http://www.eatingwell.com/recipe/251429/slow-cooker-chicken-enchilada-dip?utm_source=facebook&utm_medium=social&utm_campaign=etg_editorialcontent", "ingredients": ["2 cups chopped fresh tomatoes (about 2 medium) 1 cup chopped onion 2 cloves garlic 1 fresh jalapeño pepper, stemmed 1 tablespoon chili powder 1 teaspoon ground cumin 3/4 teaspoon salt 1 pound boneless, skinless chicken breast 8 ounces reduced-fat cream cheese 1 15-ounce can black beans, rinsed 1 cup corn, fresh or frozen (thawed) 1 cup shredded sharp Cheddar cheese 2 tablespoons sliced scallions 2 tablespoons chopped fresh cilantro"], "directions": ["Combine tomatoes, onion, garlic, jalapeno, chili powder, cumin and salt in a blender. Puree until smooth. Pour the sauce into a 5- to 6-quart slow cooker. Nestle chicken into the sauce. Cover and cook on High for 3 hours or on Low for 6 hours. Remove the chicken and shred using two forks. Stir the chicken back into the sauce in the slow cooker. Add cream cheese, beans, corn and Cheddar. Stir to combine. Cover and cook on High until the cheese is melted and the sauce is hot, 10 to 15 minutes. Serve the dip topped with scallions and cilantro.", "Make Ahead Tip: Cover and refrigerate for up to 1 day. Reheat before serving."]}, {"id": "A1Zy", "title": "Slow-Cooker Chicken Enchilada Dip", "image": "https://images.yumprint.com/p1yumprintlo/LOX1VZsHFF2IOepiCtEwrLtzb_AlTRns66AzCEc8LHY8M66xSU5vsVGKxOYWQtat", "link": "http://www.eatingwell.com/recipe/251429/slow-cooker-chicken-enchilada-dip?utm_source=facebook&utm_medium=social&utm_campaign=etg_editorialcontent", "ingredients": ["2 cups chopped fresh tomatoes (about 2 medium) 1 cup chopped onion 2 cloves garlic 1 fresh jalapeño pepper, stemmed 1 tablespoon chili powder 1 teaspoon ground cumin 3/4 teaspoon salt 1 pound boneless, skinless chicken breast 8 ounces reduced-fat cream cheese 1 15-ounce can black beans, rinsed 1 cup corn, fresh or frozen (thawed) 1 cup shredded sharp Cheddar cheese 2 tablespoons sliced scallions 2 tablespoons chopped fresh cilantro"], "directions": ["Combine tomatoes, onion, garlic, jalapeno, chili powder, cumin and salt in a blender. Puree until smooth. Pour the sauce into a 5- to 6-quart slow cooker. Nestle chicken into the sauce. Cover and cook on High for 3 hours or on Low for 6 hours. Remove the chicken and shred using two forks. Stir the chicken back into the sauce in the slow cooker. Add cream cheese, beans, corn and Cheddar. Stir to combine. Cover and cook on High until the cheese is melted and the sauce is hot, 10 to 15 minutes. Serve the dip topped with scallions and cilantro.", "Make Ahead Tip: Cover and refrigerate for up to 1 day. Reheat before serving."]}, {"id": "KVmU", "title": "Smashed baby potatoes.", "image": "https://images.yumprint.com/p1yumprintqw/Qw5mqTzbkZ1RGTAQETntUl7ZhJiID1RBLBm3jDJGh2fz6CaSVNYW1XZ64clJfKfp", "link": "https://michellebreau.com/blog/smashedbabypotatoes?fbclid=IwAR0oD4-SSRQ-ImUtr2DIZHZidN8OziCLNPLzbSucrQVpxe9guNqPLb-XdrY", "ingredients": ["1-2 pounds of washed baby potatoes", "Juice of a lemon", "1 avocado", "Avocado oil", "Pink salt"], "directions": ["Pre-heat oven to 385F. Boil baby potatoes until soft, then allow to cool slightly. Smash each potato on a parchment-lined pan using a fork, brush a small amount of avocado oil over each potato and roast until crispy.", "While the potatoes are roasting, add the avocado, lemon juice, pink salt and another glug of avocado oil to your blender and blend until creamy. Drizzle mixture over your potatoes and devour."]}, {"id": "tyJU", "title": "Spaghetti and Meatballs Muffin Bites", "image": "https://images.yumprint.com/p1yumprinta0/a0BObZ718gBLBAzrPax3UJ0QQ4WZYdY3q0wpD2JaopGDlnvvC7lI-_HG-whOYc7X", "link": "http://allrecipes.com/recipe/240333/spaghetti-and-meatballs-muffin-bites/", "ingredients": ["6 ounces spaghetti", "1 1/2 tablespoons olive oil", "1 1/2 cups grated Parmesan cheese, divided", "1 1/2 cups tomato-based pasta sauce", "12 (1 ounce) cooked meatballs"], "directions": ["Bring a large pot of lightly salted water to a boil. Cook spaghetti in the boiling water, stirring occasionally until cooked through but firm to the bite, about 7 minutes. Drain and toss in a bowl with olive oil; refrigerate until cooled, about 15 minutes.", "Preheat oven to 375 degrees F (190 degrees C). Spray 12 muffin cups with cooking spray.", "Toss cooled spaghetti with 1 cup Parmesan cheese. Divide spaghetti between the 12 prepared muffin cups, arranging noodles in each cup to create \"nests\" for the meatballs.", "Top each \"nest\" with 1 tablespoon pasta sauce, 1 meatball, and 1 more tablespoon pasta sauce, respectively. Sprinkle remaining Parmesan cheese over the tops of each meatball \"nest.\"", "Bake in the preheated oven until pasta and meatballs are heated through and cheese melts, 20 to 25 minutes. Cool slightly before transferring muffin bites to a serving platter."]}, {"id": "vLIK", "title": "Speedy Sweet Potato Quesadillas", "image": "https://images.yumprint.com/p1yumprintsv/SVVS3PNmUQ00isligAcJ-ypmsSBuWrXxyVqPeYx4qtVQtoJxNYCgr-Na6v4psfdh", "link": "https://www.yahoo.com/food/speedy-sweet-potato-quesadillas-from-a-modern-way-124752618706.html", "ingredients": ["1 sweet potato, peeled and grated", "1 tablespoon maple syrup", "Sea salt and freshly ground black pepper", "1 teaspoon chipotle paste", "1 red chile, seeded and finely chopped", "1 (15-ounce/400 g) can navy beans, rinsed and drained", "1 avocado", "½ a lime", "A few sprigs of fresh mint or cilantro, leaves picked and chopped", "4 corn tortillas"], "directions": ["Heat a small amount of olive oil in a pan, add the sweet potato and the maple syrup, and season with salt and pepper. Add the chipotle paste and the chopped chile and cook for a few minutes until the potato has softened and lost its rawness.", "Transfer to a bowl and add the beans, then use a potato masher to mash everything a little—you will still have some flecks of unmashed sweet potato. Season if needed.", "Mash the avocado with a little lime juice and stir in the herbs. I use the potato masher again here.", "Now heat a frying pan big enough for your tortillas. Lay a tortilla flat in the pan, spoon a quarter of the mixture onto one half of it, then fold over", "the other half. Dry fry on one side until it’s blistered and golden brown, then flip over and do the same on the other side. Keep the quesadilla warm in a low oven while you do this with the rest of the tortillas.", "Serve straight from the pan with the mashed avocado.", "Serve with a couple of handfuls of lemon-dressed salad leaves.", "Serve with a crunchy salad of radishes, leaves, shaved fennel, and cilantro and a quick tomato salsa."]}, {"id": "vzIt", "title": "Spiced Spanish Almonds", "image": "https://images.yumprint.com/p1yumprintng/nGJOVUToBlGiPs4etzD8x0izm8ndMS-5009Zt0osSVkbHbqr_xJGtc3fuAHYg47_", "link": "http://www.eatingwell.com/recipes/spiced_spanish_almonds.html", "ingredients": ["1/4 cup light brown sugar", "2 teaspoons ground cumin", "1 teaspoon hot paprika", "1 teaspoon dried thyme", "1 teaspoon kosher salt", "1/4 teaspoon cayenne pepper", "1 large egg white", "1 tablespoon water", "1 pound (about 3 cups) raw whole almonds"], "directions": ["Preheat oven to 275°F. Coat a large rimmed baking sheet with cooking spray.", "Whisk brown sugar, cumin, paprika, thyme, salt and cayenne in a large bowl. Whisk egg white and water in a medium bowl until foamy. Add almonds and stir to coat; pour through a sieve to drain off excess egg white. Transfer the almonds to the bowl of spices; stir well to coat. Spread evenly on the prepared baking sheet.", "Bake the almonds for 30 minutes. Stir, reduce the oven temperature to 200° and bake until the almonds are dry and golden, about 30 minutes more. Let cool before serving, about 20 minutes."]}, {"id": "pdx2", "title": "Spinach and Artichoke Dip", "image": "https://images.yumprint.com/p1yumprint8w/8wDKcq_-7Sq36h70lUT5evnOaYrgYjYyS1DVHY8i31V33ShBNyQbvEldnvgaOHy2", "link": "http://erecipecards.blogspot.com/2013/08/spinach-and-artichoke-dip-52-simple-but.html", "ingredients": ["8 OZ Cream Cheese", "16 OZ Sour Cream", "8 TBS (1 Stick) Butter", "2 Cups Freshly Grated Parmesan Cheese", "1 small jar (14 OZ) Quartered Marinated Artichoke Hearts, drained and chopped", "One 10 OZ Box Frozen Spinach, Frozen and SQUEEZED to remove as much liquid as possible", "2 Medium Jalapeno Peppers, seeds and white inner ribs removed then Minced fine", "3 Cloves Garlic, minced"], "directions": ["In a medium pot over medium heat, melt together cream cheese, sour cream, butter and parmesan cheese, stirring frequently until melted and an even consistency. It should start to bubble.", "Stir in coarsely chopped artichoke hearts, jalapenos and Squeezed spinach Finally, stir in minced garlic cloves.", "Serve HOT with chips, crackers or bread and ENJOY!"]}, {"id": "IZwM", "title": "Spinach and Artichoke Dip Recipe", "image": "https://images.yumprint.com/p1yumprintvb/vbBq5zqZwDRpkAFwLgQsjVFL1gtSGDIxsw27WGowv9IBrp3968bAqmGIhtDwMPaM", "link": "https://natashaskitchen.com/spinach-and-artichoke-dip-recipe/", "ingredients": ["8oz cream cheese (reduced fat is ok)", "16 oz light sour cream", "1 stick (8 tbsp) unsalted butter", "1 1/2 – 2 cups shredded Parmesan cheese", "14 oz quartered artichoke hearts, drained and coarsely chopped", "4 oz can diced jalapeños, drained", "10 oz frozen spinach (thawed and drained)", "2-3 garlic cloves, pressed"], "directions": ["How to Make the BEST Spinach and Artichoke Dip:", "In a medium pot over medium heat, melt together 8oz cream cheese, 16 oz sour cream, 1 stick butter and 1.5-2 cups parmesan cheese, stirring frequently until melted and an even consistency. It should start to bubble.", "Stir in coarsely chopped artichoke hearts, your drained jalapeños and drained spinach (I used my hands to squeeze spinach over the sink to remove excess water). Finally, stir in 2-3 pressed garlic cloves."]}, {"id": "f_h1", "title": "Spinach Hummus", "image": "https://images.yumprint.com/p1yumprint39/39sIu8BiJcxUYmbgvAuXILYNvOrcmFb7yTUJz-F-1kSh4UNb7R24jz3S__hoR1aT", "link": "http://rabbitfoodformybunnyteeth.com/spinach-hummus-cabo-chips-giveaway/", "ingredients": ["1.5 cups spinach, packed", "1 15oz can garbanzo beans", "3 Tbsp lemon juice", "1 glove garlic", "1/8 tsp sea salt"], "directions": ["Combine all ingredients in a high powered blender or food processor and puree until creamy and smooth. The mixture will resemble a thick paste."]}, {"id": "B6ng", "title": "Split Pea Purée with Roasted Root Vegetables", "image": "https://images.yumprint.com/p1yumprintga/gAe-U6paB0ujPbySSxXoJT86cZBzFEvHPEG_8OX34LgvDXP93VY1aWUF7BA9TvbF", "link": "http://nourishedkitchen.com/split-pea-puree/", "ingredients": ["4 medium carrots, peeled and chopped", "2 medium parsnips, peeled and chopped", "1 medium celeriac, peeled and chopped", "2 tablespoons extra virgin olive oil", "Finely ground sea salt, as needed", "Rye bread", "Butter", "Thinly sliced ham"], "directions": ["Dump the split peas into a bowl, cover them with warm water and let them soak at least four and up to eight hours. Drain, and rinse well.", "Toss the peas into a medium pot, cover with stock. Bring them to a boil over high heat, then turn down the heat to medium and simmer, covered, until the peas are tender and cooked through. Turn off the heat, replace the lid to keep them warm.", "Heat the oven to 425 F.", "Toss the carrots, parsnips and celeriac in a large bowl with olive oil, stirring them until they're evenly coated. Spread them on a rimmed baking sheet, and season them generously with salt. Roast them for 20 minutes or until cooked through, with their edges beginning to caramelize.", "While the vegetables roast, fry the bacon in a cast iron skillet over medium heat until crisp. Using a slotted spoon, transfer the bacon to a waiting plate. Stir the chopped onion and fresh thyme into the hot bacon fat and cook until fragrant and translucent, about 6 minutes.", "Transfer the onion and bacon fat, reserved split peas and white pepper to a food processor. Process until smooth. Generously adjust the seasoning of the puree with salt, and process about 30 seconds longer.", "Spoon the purée into a bowl, top with roasted vegetables and reserved bacon. Serve warm with buttered rye bread and ham."]}, {"id": "tXX5", "title": "Sprouted Chickpea Hummus", "image": "https://images.yumprint.com/p1yumprintg8/G8yGP8EpgzG7P__v4s8gdRVETVCp6PJhfD5v-35l3fHumOs4A6NpRXUGquUTJ-QF", "link": "http://www.motherearthliving.com/cooking-methods/raw-food-recipes-sprouted-chickpea-hummus.aspx", "ingredients": ["2 medium lemons, peeled and quartered", "1 cup tahini", "1 medium yellow onion, peeled and quartered", "3 medium cloves garlic", "1/2 cup fresh parsley leaves", "1/2 cup fresh cilantro leaves", "1 teaspoon ground cumin", "1/3 cup cold-pressed olive oil", "1 teaspoon sea salt, plus additional (up to 1 teaspoon) to taste"], "directions": ["Put the sprouted chickpeas in a food processor and blend well. Remove to a large bowl.", "To make the Tahini Sauce: Put the lemon first, then the remaining ingredients, in a blender and blend well.", "Pour the Tahini Sauce into the bowl with the chickpeas and mix well. Taste and adjust the seasonings. Voilà!", "Variations", "Sprouted Chickpea Hummus with Sun-Dried Tomatoes", "Follow the directions for Sprouted Chickpea Hummus, but add 1/3 cup sun-dried tomatoes to the ingredients in the blender. Blend well, then cut another 1/3 cup sun-dried tomatoes into thin strips and stir them into the hummus. This way, you get the wonderful flavor of these tomatoes throughout the hummus as well as getting delicious concentrations of their flavor and a nice chewy texture.", "Sprouted Chickpea Hummus with Black Olives and Chives", "Follow the directions for Sprouted Chickpea Hummus, but add 1/3 cup chopped sun-dried or oil-cured black olives (available online and in some specialty stores) to the ingredients in the blender. Blend well, then stir another 2/3 cup of the olives plus 1/2 cup chopped chives into the hummus. Again, you get wonderful flavor mixed through the hummus as well as delicious concentrations of flavor and a differentiated texture."]}, {"id": "q7O7", "title": "Sprouted Hummus with garlic & chilies", "image": "https://images.yumprint.com/p1yumprintcm/CmLVuueBdozTSRlBl7onwbef4aWuVrMccWAU03Ts5xjjSt2XrcCG_R5xZh_o5SOl", "link": "http://nourishedkitchen.com/sprouted-hummus-recipe/", "ingredients": ["1/2 cup dried Palouse Brand Garbanzo Beans (buy them here)", "1 clove garlic", "1 minced serrano pepper, optional", "3 tablespoons fresh lemon juice", "1 teaspoon unrefined sea salt", "2 tablespoons sesame tahini", "1/2 cup extra virgin olive oil (see sources)"], "directions": ["Rinse the garbanzo beans, and pick out any loose bits of debris. Place them in a bowl, and cover them with warm water by two inches. Cover, and allow them to soak at least 18 and up to 24 hours. Drain the beans and rinse them well.", "Pour the beans into a fine-mesh sieve or into a sprouting jar (available here). Rinse and drain the beans two to three times a day for two to three days, or until the sprouts barely emerges from the tip of the bean.", "Rinse the beans well, and pour them into a medium saucepan, cover with water, and bring to a boil over high heat. Reduce the heat to medium and continue simmering the beans for 1 1/2 hours, or until tender. Drain and rinse well in cold water.", "Slip the papery skin that envelops the garbanzo beans off, and place the beans into the basin of a food processor. Add the garlic, serrano pepper, lemon juice, salt and tahini. Pulse for ten seconds until the ingredients are loosely blended.", "Pour the olive oil into the feeder tube, so it drips into the basin of the food processor in a slow and thin stream, and process until the olive oil is spent and the hummus is well-emulsified. Serve immediately, or spoon into an airtight container. It will keep in the fridge about a week.", "(Plucking the thin, papery skin from the cooked chickpeas and the use of plenty of olive oil results in a remarkably luxuriant, smooth Sprouted Hummus. Remarkably versatile, use this recipe as a basis to make hummus flavored with cumin, chile peppers, cilantro, garlic or red bell peppers.)"]}, {"id": "k4R2", "title": "Squash-and-Kale Toasts", "image": "https://images.yumprint.com/p1yumprinta6/a6dd5xTKVnqPcGapahu_AZvmqa6x-4i6_3wBO6wqgvhF4x3IT9lbCuewdxQP9GQI", "link": "http://www.foodandwine.com/recipes/squash-and-kale-toasts", "ingredients": ["2 small delicata squash (2 pounds)—peeled, halved lengthwise, seeded and sliced crosswise 1/2 inch thick", "1/2 cup extra-virgin olive oil, plus more for brushing", "Salt and freshly ground pepper", "1 pound kale—thick stems and ribs discarded, leaves coarsely chopped", "4 garlic cloves, thinly sliced", "Eight 1/2-inch-thick slices of peasant bread", "4 ounces shaved Parmigiano-Reggiano cheese (1 1/2 loose cups)"], "directions": ["Preheat the oven to 350°. In a medium bowl, toss the squash with 2 tablespoons of the olive oil and season with salt and pepper. Spread the squash on a baking sheet and roast for about 30 minutes, turning once, until tender and lightly browned.", "In a large skillet, heat the remaining 1/4 cup plus 2 tablespoons of olive oil. Add the kale and cook until it is wilted, about 8 minutes. Add the garlic slices and cook until the kale is tender, about 3 minutes longer. Season the kale with salt and pepper. Add the squash and toss gently to combine.", "Heat a cast-iron grill pan. Brush the bread with olive oil and grill over high heat, turning once, until toasted. Mound the squash and kale on the toasts, top with the shaved cheese and serve.", "MAKE AHEAD The recipe can be prepared through Step 2 and refrigerated overnight. Rewarm in a skillet before serving."]}, {"id": "xefO", "title": "Sriracha Hummus", "image": "https://images.yumprint.com/p1yumprintxw/xWUU7Twi2QVXT9yst4RjgOgIz3mGeIU4HMbEvOW_T1TgX7SUFaLKXT0S-fiDpGFX", "link": "http://nourishedkitchen.com/sriracha-hummus/", "ingredients": ["2 cups dry chickpeas", "¼ teaspoon baking soda", "4 cloves garlic, smashed", "2½ teaspoons finely ground sea salt", "1 teaspoon smoked paprika", "¼ cup roasted sesame tahini", "¾ cup sriracha (Find organic sriracha here.)", "½ cup extra virgin olive oil", "¼ cup water"], "directions": ["Pour the chickpeas into a bowl, cover with warm water by two inches and then stir in the baking soda. Let the chickpeas soak, covered, for 18 to 24 hours. Drain them and rinse them well.", "Dump the soaked chickpeas into a stockpot or Dutch oven, cover them with plenty of water and boil them over high heat until softened, about 1½ to 2 hours. Drain the chickpeas, and allow them to cool to room temperature.", "Place the chickpeas, garlic cloves, salt, smoked paprika, tahini, sriracha, olive oil and water into a food processor, and process them together until they form a smooth, velvety paste.", "Serve immediately with vegetables, or store in an airtight container in the refrigerator for up to a week."]}, {"id": "A93L", "title": "Sriracha-Buffalo Cauliflower Bites", "image": "https://images.yumprint.com/p1yumprintvw/VWd24aPu7YJOKa9oR_V4uiGQmCVg8V6E87zTyKY1lPg84eWaq_k5ScpGywv_bAD1", "link": "http://www.eatingwell.com/recipe/251316/sriracha-buffalo-cauliflower-bites?utm_source=facebook&utm_medium=social&utm_campaign=etg_597621410_editorialcontent", "ingredients": ["8 cups 1 1/2-inch cauliflower florets 2 tablespoons extra-virgin olive oil 1/4 teaspoon kosher salt 2 tablespoons hot sauce, such as Frank's RedHot 1-2 tablespoons Sriracha sauce 1 tablespoon butter, melted 1 tablespoon lemon juice"], "directions": ["Preheat oven to 450 °F. Coat a large rimmed baking sheet with cooking spray. Toss cauliflower, oil and salt in a large bowl. Spread on the prepared baking sheet; reserve the bowl. Roast the cauliflower until it's starting to soften and brown on the bottom, about 15 minutes. Meanwhile, combine hot sauce, sriracha to taste, butter and lemon juice in the large bowl. Add the roasted cauliflower and toss to coat. Return the cauliflower to the baking sheet and continue roasting until hot, about 5 minutes more."]}, {"id": "BpRv", "title": "Stuffed Mushrooms Recipe", "image": "https://images.yumprint.com/p1yumprinthl/hl76Ql996ujK5zDouQbsKtU2Ct1LdaPhMeXOZ-YAH6IYvlWoKPP1hogrGIMWAHGF", "link": "https://draxe.com/recipe/stuffed-mushrooms/?utm_source=newsletter&utm_medium=email&utm_campaign=oct_5", "ingredients": ["1 tablespoon melted coconut oil, divided", "20 cremini mushroom caps", "1 package uncured turkey bacon", "1 head of cauliflower, chopped", "1/4 cup grated raw goat cheese", "1/2 teaspoon minced garlic", "1 tablespoon sea salt", "1 tablespoon pepper", "2 tablespoons unsalted grass-fed butter, diced into 20 pieces", "1/2 cup chives"], "directions": ["Heat the oven to 400 F.", "Brush the mushroom caps with the coconut oil and place them top down on a baking sheet.", "Use the remaining oil to grease another baking sheet.", "Distribute the bacon evenly on the greased baking sheet.", "Bake the mushrooms and bacon for 15 minutes.", "While the mushrooms and bacon are baking, bring a medium pot of water to a boil.", "Add the cauliflower and boil for 8 minutes, or until tender.", "Drain the cauliflower well and remove any excess water by patting with paper towels.", "Do not allow the cauliflower to cool.", "To the bowl of a food processor, add the cauliflower, cheese, garlic, salt and pepper and puree until almost smooth.", "Set aside.", "Remove the mushrooms and bacon from the oven.", "Chop up the bacon.", "Flip the mushroom caps and fill them with the cauliflower mixture.", "Place one piece of butter on top of the mixture.", "Crumble and sprinkle the bacon on top of each mushroom.", "Serve immediately."]}, {"id": "ng37", "title": "Summer Corn and Cotija Cheese Dip", "image": "https://images.yumprint.com/p1yumprintvf/vfsvmTQM2P6MQawbrB1KT5UkuRidrqp43UQmBawATleXvyYhVO3fmKW6YMcFdtXu", "link": "http://minimalistbaker.com/summer-corn-and-cotija-cheese-dip/", "ingredients": ["2 Tbsp olive oil, divided", "3 cups fresh corn, cut off the cob (~3 ears)", "1 shallot, chopped", "1 clove garlic, minced", "1/2 cup light sour cream or plain Greek yogurt", "4 ounces (1/2 package) 1/3-fat cream cheese", "1 cup grated cotija cheese + more for topping", "1/4 tsp each sea salt and ground black pepper"], "directions": ["Preheat oven to 375 degrees F.", "Heat a cast iron or oven-safe skillet over medium heat. Add 1 Tbsp olive oil, shallot and garlic. Stir constantly to prevent burning.", "Add corn, 1/4 tsp each sea salt and pepper and stir. Cook for 5 minutes until shallots appear softened and the corn is slightly darker in color. Then remove from heat.", "In a large bowl mix together sour cream, cream cheese, cotija and stir. Add corn mixture to the bowl and stir until well combined.", "Use additional Tbsp olive oil to lightly grease the cast iron so the dip doesn’t stick. Spoon dip back into the skillet and bake at 375 for 11-13 minutes or until hot and bubbly.", "Serve with veggies, tortilla chips, crackers or baguette bread. Tortilla chips were my favorite."]}, {"id": "CB3F", "title": "Sweet Potato Halloumi Tartines (Toasts)", "image": "https://images.yumprint.com/p1yumprint1g/1GyMN7qY0JszBc3yMMZcTUETlYDwOSVfb6RFRlZz4YaFhti8Q1wf0xs94K8e7n1-", "link": "http://gourmandeinthekitchen.com/sweet-potato-halloumi-tartines/", "ingredients": ["2 medium sweet potatoes; cut lengthwise into 1 inch thick slices", "2 Tablespoons/30ml extra-virgin olive oil, plus more for brushing and frying", "¼ cup fresh basil leaves, packed", "¼ cup/28g raw pistachios, plus more serving", "¼ teaspoon sea salt, plus more for baking", "1 teaspoon/5ml fresh lemon juice", "2 oz/57g wild arugula", "4oz/113g halloumi cheese, sliced and pat dry"], "directions": ["Preheat oven to 400 degrees F. Brush sweet potato slices on both sides very lightly with oil and season with a pinch of sea salt. Place directly on oven rack to bake, turning once until browned and tender, 15-20 minutes total. Remove from oven and set aside until cool enough to handle.", "In the meantime in a mini food processor purée olive oil and basil with pistachios, salt and lemon juice until just blended.", "In a large bowl toss the arugula with ½ the basil pistachio oil. Set aside.", "Heat a thin layer of olive oil in a medium skillet over medium heat. Add the slices of halloumi and cook until the cheese turns a light, golden-brown, (about 1 minute each side). (Slice diagonally to make triangles if desired.)", "Spread the remaining basil pistachio oil on the baked sweet potato slices and top with arugula and warm halloumi slices. Season with salt and pepper if desired and top with extra chopped pistachios. Serve immediately."]}, {"id": "JUel", "title": "sweet potato toppers", "image": "https://images.yumprint.com/p1yumprinteu/eUmdDRombEXQVtWwOGonnVue93FxURQmiCgW3bStM17PXUQeBeGfI1cTZPBakyGH", "link": "https://themerrymakersisters.com/sweet-potato-toppers/", "ingredients": ["1 large sweet potato peeled and cut in to thick slices", "1 avocado", "1 punnet cherry tomatoes halved", "1 shallot (scallion) sliced", "1 lemon juiced", "1 tsp. nigella seeds (or any spice!)", "salt and pepper", "1 tbs. macadamia/melted coconut oil"], "directions": ["Preheat oven to 180°C (350°F) and line 2 baking trays with baking paper.", "Place the sweet potato slices on to the baking trays and brush with oil.", "Place in to the oven for 20 minutes, turn the slices and return to the oven for a further 20 minutes.", "Meanwhile, in a small bowl mash together the avocado, nigella seeds, lemon juice, salt and pepper.", "When the sweet potato slices are ready, top each slice with a teaspoon of avocado mix, half a tomato and sprinkle with shallots!", "Just before serving, drizzle with a little olive oil and season with extra salt and pepper!"]}, {"id": "vLF8", "title": "Sweet Roasted Chickpeas from 'Short Stack'", "image": "https://images.yumprint.com/p1yumprintnp/nPvOmo7BKD0yXLYt9Ujql2QxeeZ4ojWyLdFFYhbmJHxC5szyLXUM_CNimwjC6Q6S", "link": "https://www.yahoo.com/food/sweet-roasted-chickpeas-from-short-stack-113878329396.html", "ingredients": ["One 15-ounce can chickpeas", "1 tablespoon light brown sugar", "Pinch ground cayenne", "Pinch ground cinnamon", "Pinch ground cumin", "1 teaspoon kosher salt", "1 tablespoon vegetable oil"], "directions": ["Preheat the oven to 400°. Line a rimmed baking sheet with a silicone baking mat or parchment paper.", "Drain the chickpeas in a large strainer and rinse well. Spread the chickpeas out on a kitchen towel or paper towels and pat them dry. (At this point, some of skins may be coming off the beans. You can remove them all if you like. I’m not married to either way.)", "Spread the dry chickpeas out on the baking sheet and roast for 15 minutes.", "Meanwhile, in a small mixing bowl, stir together the brown sugar, cayenne, cinnamon, cumin and salt. Set aside.", "Remove the chickpeas from the oven and drizzle with the vegetable oil, turning to coat with a large spoon. Sprinkle the sugar mixture over the chickpeas and mix well, rolling them around the pan until all the peas are coated. Return to the oven and roast for another 15 minutes, stirring every 5 minutes. Turn off the oven, crack open the oven door and leave the chickpeas inside for another 15 minutes. Remove from the oven (the chickpeas will still be slightly soft in the middle). Serve immediately, as the chickpeas do not keep well."]}, {"id": "whjR", "title": "Tequila Lime Sheet Pan Chicken Nachos", "image": "https://images.yumprint.com/p1yumprintkz/kZNTwL_xKEFD_s_8ys4VZ9qsYK9cBVp-Tqwkbb-17fAWDlA-lkIiFKfVHJQ1Rt7S", "link": "http://www.thecookierookie.com/sheet-pan-chicken-nachos/", "ingredients": ["32(ish) Tequila Lime Baked Tortilla Chips (recipe HERE) (you can also use your favorite tortilla chips instead)", "6 boneless skinless chicken tenders, cut into small strips", "1 (1 ounce) packet taco seasoning (I'm partial to Old El Paso)", "1 tablespoon olive oil", "1 tablespoon tequila", "1 tablespoon lime juice", "½ cup chopped onion", "2 cups shredded Mexican blend cheese", "1 cup prepared pico de gallo", "¼ cup fresh chopped cilantro (optional)", "Optional additional toppings: black beans, mexi-corn, jalapeños, refried beans, olives, or anything you love!", "Garnish ideas: sour cream, avocado, guacamole, salsa, the list goes on and on!"], "directions": ["Preheat your oven to 350F", "In a large skillet, heat your oil over medium/high heat", "Add the chicken into the skillet and toss in the tequila, taco seasoning, and lime juice, Stir to combine. Cook the chicken until fully cooked; about 4-5 minutes. Set aside.", "Lay the chips on a large sheet pan/cookie sheet sprayed with nonstick spray. Lay them pretty much in a single layer, only slightly overlapping. (I hate when chips get caught underneath and don't get any toppings!)", "Arrange the chicken and onion over the chips.", "Drizzle the chips and chicken with the white queso, a little goes a long way. You don't want everything to get soggy.", "Sprinkle everything with the shredded cheese", "Top with the pico and cilantro.", "Bake for approximately 10-15 minutes, rotating halfway through. You want the cheese fully melted and the chips starting to turn brown on the edges.", "Remove from the oven and top with all your favorites: sour cream, guac, salsa, the works!"]}, {"id": "rYF8", "title": "Tex-Mex White Bean Dip Recipe", "image": "https://images.yumprint.com/p1yumprint9y/9YJfR1Bc3Vj8j7okZqMR9FoH9VQm7tT83Wpi4JZUmflN4aCgN_arjIfpUKwAeYV1", "link": "http://www.kitchenstewardship.com/2015/07/22/white-bean-dip-recipe-gaps/", "ingredients": ["3 c. cooked white beans, (using the long-soak method) OR 2 cans", "1½ - 2 tsp. real salt", "1 Tbs. smoked paprika (my absolute favorite is the frontier brand)", "½+ tsp. chipotle", "1 Tbs. cumin", "1 Tbs. garlic powder", "½ tsp. coriander", "2 Tbs. nutritional yeast or ½ cup grated cheddar cheese (optional, we left out this time)", "Juice of 4 limes", "¼ c. extra virgin olive oil", "¼ loose c. cilantro leaves (optional)"], "directions": ["Make sure the beans are well drained, and rinsed if you used canned.", "Put the beans and spices (starting out with the smaller amount of salt and chipotle), and the nutritional yeast or cheese, if using, in the food processor and blend until mostly smooth.", "Add in the lime juice and blend in, followed by the olive oil and cilantro quickly pulsed in. Extra virgin olive oil doesn't really take well to being blended (it can get bitter) so once it is in sparingly use the pulse button to incorporate the other ingredients.", "Taste, and adjust salt depending on the service options. I used 2 teaspoons as I was using it as a vegetable dip (tastes a little too salty on it's own) if you were using it as a chip dip I would definitely recommend not using that much. A good idea is to taste with the food you will be dipping it in and judge the flavor as a whole.", "Add more chipotle if desired to make it spicy. I like to top with a little extra cilantro and another drizzle of olive oil."]}, {"id": "r3nN", "title": "The best basic hummus", "image": "https://images.yumprint.com/p1yumprintj9/J9cRDFcf4zSWHr655JYBVz4or0HGPxlVstYT6ZcOJT5zLr20mtOcZI9mgHnp6r6L", "link": "http://www.jamieoliver.com/news-and-features/features/best-basic-hummus-recipe/#y4GC33ql9rQIzv02.97", "ingredients": ["2 x 400g cans of chickpeas (reserve the liquid and a few chickpeas for decoration)", "4 tsp tahini", "2 garlic cloves, crushed", "1 tsp crushed sea salt", "6 tbsp quality extra virgin olive oil (plus extra for drizzling)", "3½ tbsp freshly squeezed lemon juice", "Paprika (optional)", "Coriander or parsley leaves (optional)"], "directions": ["Rinse the chickpeas in cold water and tip into the food processor. Add the tahini, crushed garlic, salt, lemon juice and seven tablespoons of the reserved liquid from the cans. Turn on the food processor and slowly pour in the oil while it runs.", "When the mixture is fully combined and smooth, tip it into a serving dish. Drizzle with some more extra virgin olive oil and decorate with a few whole chickpeas. Sprinkle with paprika and finely chopped coriander or parsley leaves, for colour."]}, {"id": "xKqf", "title": "These “Tater Tots” Are Made Of Broccoli And They’re Amazing As Life", "image": "https://images.yumprint.com/p1yumprint-z/-zWCePG5ctqaNe8_-A634ehiNpznkFyJhUVWJ0NDB6iSpeODmdFNNjZVEY-Wnm3y", "link": "http://www.buzzfeed.com/adambianchi/these-tater-tots-are-made-of-broccoli-and-theyre-amazing-as#.ab1JGz3g3", "ingredients": ["12 ounces broccoli, cut into small florets", "1/4 cup scallions, thinly sliced", "2 large garlic cloves, finely diced", "2/3 cup shredded cheddar cheese", "1 egg, beaten", "2/3 cup breadcrumbs", "Salt & pepper", "Optional: 2 tsp Sriracha (opt.but recommended!)"], "directions": ["Preheat oven to 400 degrees.", "Fill a medium saucepan with water and bring to a boil. Aggressively season it with salt. Blanch the broccoli in boiling water for about two minutes. Drain and finely chop the cooked broccoli. In a mixing bowl, add broccoli, scallions, garlic, cheddar, egg, and breadcrumbs. Optional: add hot sauce of choice. Mix well and chill in the refrigerator for 15-20 minutes.", "Spray a nonstick baking sheet with nonstick spray. Shape the mixture into tot shapes and spread them evenly on the sheet.", "Bake for 8-9 minutes. Flip and then bake for an additional 8-9 minutes on the other side until golden brown."]}, {"id": "KjG0", "title": "Turkey Artichoke Meatballs", "image": "https://images.yumprint.com/p1yumprintzw/ZWuO9X6QZLXf7GcXyEA9y8kS57_dI3FiMaXGyF6_mRuyHLaGUjTaNC3mVXMEjjS7", "link": "https://thewellnesswayclinics.com/artichoke-meatballs/?fbclid=IwAR0ahd6H3r7mrggRA94EQmyQ1TJvAvZMop_2cf0IMnXv9Ck6oKS8OTN-kJM", "ingredients": ["1-2 pounds organic ground turkey", "1 cup organic onion, chopped", "2 tablespoons organic minced garlic", "1 can organic artichokes", "organic parsley", "sea salt to taste", "organic parmesan cheese (optional)"], "directions": ["Preheat oven to 375 degrees.", "Sauté onions and garlic in pan.", "Add artichokes, onions, and garlic into ground turkey.", "Add parsley and sea salt to taste.", "Optional – add organic parmesan cheese.", "Form into balls and place on parchment paper.", "Bake for 20 minutes or until done."]}, {"id": "HW_E", "title": "Vegan Spinach Artichoke Dip", "image": "https://images.yumprint.com/p1yumprinte1/E1i75JoP6kjpJkUgxTrBf15RXYR_JSU2Xr4gbN1uCaUXdLsGy09EWWq0BXDd5Q3M", "link": "https://yupitsvegan.com/hot-spinach-artichoke-dip/", "ingredients": ["1/4 cup raw cashews soaked (see notes)", "1 cup plain, unsweetened non-dairy milk room temperature or warm", "1 tsp apple cider vinegar", "2 tbsp + 1/2 tsp tapioca starch (see notes about substitutions)", "1 tsp olive oil", "3/4 tsp salt", "1 tbsp nutritional yeast (optional, see notes)", "1/4 tsp paprika"], "directions": ["Combine all ingredients in a blender or food processor, until smooth (or as smooth as you can get it). If not using a high-powered blender like a Vitamix, make sure to blend or process for 60 seconds and pour through a mesh sieve before continuing.", "Pour the mixture into a saucepan and turn the heat to medium. Stir every few seconds, making sure to scrape around the bottom of the saucepan to keep from sticking. The mixture will start to get chunky in places; when you see this happening, start to stir constantly until the mixture smooths out again and becomes one cohesive, somewhat stretchy mass. Reduce the heat to medium-low and cook for another 2 minutes, then remove from the heat.", "Working quickly so that the cheese does not stick to the pan, divide the cheese equally among the baking dishes you have selected. Use a fork to toss the vegetables with the cheese to incorporate it evenly. If desired, gently brush or spray oil on the top of the mixture to help it brown. (It will still brown somewhat either way. The photographed dip did not have any oil added at all.)", "Bake the vegan spinach artichoke dip:", "Place the dip into the oven and bake for about 20 minutes, or until hot all the way through and the top is slightly crusty and browned.", "Serve immediately, with chips, crackers or toasted bread of your choosing. Be careful, as the inside will be hot.", "Soak the cashews overnight, but if you forget, simply put them in a bowl with water and microwave for 90-120 seconds at a time or until very softened."]}, {"id": "xJjg", "title": "Veggie Rolls with Avocado Hummus", "image": "https://images.yumprint.com/p1yumprinthm/hMwWfQ5Rjoe8LWrmx315AHPbzuRSYrba1U3kdjLIycFibqz8QXdfB0tpY6GOYHqp", "link": "http://www.theglowingfridge.com/veggie-rolls-with-avocado-hummus/", "ingredients": ["1 15 oz. can cannellini beans, drained and rinsed", "1/2 ripe avocado", "2 1/2 tablespoons fresh lemon juice", "1/2 tablespoon olive oil (optional)", "1/2 cup arugula (or spinach)", "1/4 cup fresh cilantro", "1/2 clove of garlic", "small piece of jalapeño (optional)", "1/2 teaspoon sea salt, or more to taste", "1/4 teaspoon black pepper", "VEGGIE ROLLS", "2 zucchini, sliced thin with spiralizer blade", "2 large carrots, sliced into sticks", "1/2 english cucumber, sliced into sticks", "2-3 radishes, sliced thin and halved", "1/4 cup cilantro", "sesame seeds (optional)"], "directions": ["TO MAKE AVOCADO HUMMUS", "In a food processor, blend the beans, avocado, lemon juice and olive oil until smooth. Add in arugula, cilantro, garlic, sea salt and pepper. Blend a few minutes until smooth and creamy. Transfer to a small bowl.", "TO MAKE VEGGIE ROLLS", "On a flat, dry surface, lay a thin piece of zucchini.", "Smear with a spoonful of avocado hummus (not too much or it will overflow out the sides).", "Lay the assorted veggies and cilantro closely together on one end and begin rolling it up.", "Finish with a toothpick to hold it together.", "Repeat the process for the rest of the rolls (about 13-16 more).", "Sprinkle with sesame seeds.", "Enjoy!"]}, {"id": "k0n8", "title": "Walnut Pesto and Goat Cheese Dip", "image": "https://images.yumprint.com/p1yumprintte/TeULnNSEolLPLySngJ3czpS2_znJIe3ZcG6rO8l4QkAbGjMd_GUfBS1dDd1ooZbH", "link": "http://www.foodandwine.com/recipes/walnut-pesto-and-goat-cheese-dip?xid=PS_yahoofood", "ingredients": ["14 ounces walnuts (2 1/4 cups)", "1/2 cup extra-virgin olive oil, plus more for drizzling", "Kosher salt and freshly ground pepper", "10 ounces fresh goat cheese, at room temperature", "4 small shallots, minced", "1/2 cup finely chopped watercress leaves", "1/4 cup fresh lemon juice", "3 Hass avocados, cut into 1/2-inch dice", "Small radishes and assorted vegetable sticks, such as celery, fennel and carrots, for serving"], "directions": ["Preheat the oven to 350°. Spread the walnuts on a rimmed baking sheet and toast for 7 minutes, or until golden. Transfer to a plate and let cool. In a food processor, working in 2 batches, pulse the walnuts until coarsely chopped. Add the second batch of nuts back to the food processor and pulse in the 1/2 cup of olive oil. Do not overprocess: the pesto should be slightly chunky. Season with 2 teaspoons of salt and 1/2 teaspoon of pepper.", "Transfer the pesto to a medium bowl. Mix in the goat cheese, shallots, watercress and lemon juice. Season with salt and pepper. Fold in the avocados. Drizzle the dip with olive oil and serve with radishes and assorted crisp vegetables.", "MAKE AHEAD The dip can be refrigerated overnight without the avocados. Bring to room temperature and fold in the diced avocados before serving."]}, {"id": "KjGT", "title": "Wellness Way Touchdown Taco Dip Recipe", "image": "https://images.yumprint.com/p1yumprintfi/fI-jD6KqIbGKWLOAHAIyPK6i7ni_7Nic6e1B8aD1vjNEiYYN0SyOGjl2bhpb8FoN", "link": "https://thewellnesswayclinics.com/taco-dip/?fbclid=IwAR3XIPkUtpjT0UDmib35R0p2-HkqC2GVGMxkwpzcvmQM2sY_U-TSEyClwa0", "ingredients": ["1 can organic, refried black beans", "8 oz Kite Hill cream cheese", "1/4 cup soy-free Veganaise", "2 tablespoons organic taco seasoning", "2 organic garlic cloves, pressed", "1 medium organic tomato", "1 medium organic yellow pepper", "3 organic green onions (with tops)", "1/2 cup organic black olives", "optional – organic or dairy-free cheese on top"], "directions": ["Preheat oven to 350 degrees.", "Spread beans over bottom of glass or stone baking dish.", "Combine cream cheese, Veganaise, taco seasoning, and garlic.", "Spread mixture over beans.", "Bake 15-18 minutes, then let dish cool for a few minutes.", "Dice yellow pepper, tomato, and thinly slice onions, and spread on top of dip.", "Serve with gluten-free crackers or organic tortilla chips, and enjoy!"]}, {"id": "LtJt", "title": "Zucchini Garlic Bites", "image": "https://images.yumprint.com/p1yumprintln/lnqC8AtDQ34J0uiCGHcjozJS6joWQXKZqJUh_OfsbYS4fVCPpRQHN6iqMS_WYFGT", "link": "https://growagoodlife.com/zucchini-garlic-bites/?fbclid=IwAR0Tm341eMqP7IjzO8WGP3eL_6o5tfNppcYCONKhd_f6pVQNFfq_U0GklVQ", "ingredients": ["1 cup zucchini grated and drained well", "1 egg", "1/3 cup breadcrumbs", "1/4 cup Parmesan cheese grated fine", "1 clove garlic grated fine", "2 tablespoons fresh chives chopped", "1 tablespoon fresh parsley chopped", "1 teaspoon fresh basil chopped", "1 teaspoon fresh oregano chopped", "pinch of salt and pepper", "tomato sauce for dipping"], "directions": ["Preheat oven to 400˚F. Lightly coat a baking sheet with olive oil or non-stick spray. Set aside.", "Use a box grater to grate the zucchini into a clean towel. Roll up the towel and twist to wring out the moisture. Grate the garlic using the small holes on the box grater.", "In a medium bowl, combine all of the ingredients and mix well.", "Shape a tablespoon of the mixture into your hands, pat into small balls, and place on the baking sheet.", "Bake for 15-18 minutes in the preheated oven until golden. Serve warm with marinara sauce. Recipe makes about 16 bites.", "Serve with warm marinara sauce:"]}, {"id": "GSoz", "title": "Zucchini Nuggets with Almond Meal and Mushrooms", "image": "https://images.yumprint.com/p1yumprintnt/ntBgQzOZtkqY856DTA_erRTxQ_krrqGSqV4oTk7yVeB0CAy0esaPYtgv8OU1326Z", "link": "https://www.motherearthliving.com/food-and-recipes/recipes/zucchini-nuggets-zerz1801zcoy", "ingredients": ["• 1 1/2 cups shredded zucchini", "• 3/4 cup almond meal (or gluten-free rolled oats)", "• 3/4 cup finely chopped mushrooms", "• 2 1/2 tablespoons almond butter", "• 1 tablespoon flax meal", "• 1 teaspoon olive oil", "• 1/2 teaspoon onion powder", "• 1/2 teaspoon sea salt"], "directions": ["If Making in an Oven", "Preheat your oven to 400 degrees Fahrenheit. Line a rimmed baking sheet with parchment paper. Set aside.", "Place all the ingredients in a large bowl. Stir very well to combine (at least 1 minute).", "Using your hands, form the mixture into 16 tidy nuggets (or 8 fingers). Place the formed nuggets on the parchment-lined pan.", "Bake for 13 minutes. Flip each nugget and bake for another 10 minutes, or until golden brown (23 minutes total). Do not let them burn. Once you remove the nuggets from the oven, let them cool for 10 minutes to firm.", "If Making in a Dehydrator", "Line a dehydrator tray with parchment paper. Set aside.", "Place all the ingredients in a large bowl. Stir very well to combine (at least 1 minute).", "Using your hands, form the mixture into 16 tidy nuggets. Place the formed nuggets on the parchment-lined tray."]}, {"id": "jovE", "title": "Zucchini Parmesan Crisps", "image": "https://images.yumprint.com/p1yumprintfq/fqVp-Luws_GRkcg_p-wb9FbJ9AKR641KKnhe-JS1sW2fH_qcM7s0HGDhb8BCwdea", "link": "http://damndelicious.net/2014/02/24/zucchini-parmesan-crisps/", "ingredients": ["1/2 cup vegetable oil", "1 cup Panko*", "1/2 cup grated Parmesan cheese", "2 zucchinis, thinly sliced to 1/4-inch thick rounds", "1/2 cup all-purpose flour", "2 large eggs, beaten"], "directions": ["Heat vegetable oil in a large skillet over medium high heat.", "In a large bowl, combine Panko and Parmesan; set aside.", "Working in batches, dredge zucchini rounds in flour, dip into eggs, then dredge in Panko mixture, pressing to coat.", "Add zucchini rounds to the skillet, 5 or 6 at a time, and cook until evenly golden and crispy, about 1 minute on each side. Transfer to a paper towel-lined plate.", "Serve immediately."]}, {"id": "Kj0W", "title": "Zucchini Tots", "image": null, "link": "https://www.southernkissed.com/the-ketogenic-cookbook-review/", "ingredients": ["2 cups shredded zucchini, about 1 medium zucchini", "1 teaspoon fine sea salt", "1 Tablespoon coconut flour", "2 large eggs", "1 cup shredded sharp cheese, about 4 ounces (or nutritional yeast if dairy-sensitive)", "1/2 cup finely chopped yellow onion", "1 teaspoon smoked paprika"], "directions": ["Preheat the oven to 400 degrees. Spray a 24-cup mini-muffin pan with cooking spray.", "Place the shredded zucchini in a medium-sized bowl and toss with the salt. Let sit for 10 to 15 minutes. Squeeze out any moisture and discard the liquid.", "Sprinkle the coconut flour onto the zucchini and toss well to coat. Add the eggs, cheddar cheese, onion, and paprika and mix well to combine.", "Fill each muffin cup with 1 1/2 tablespoons of the zucchini mixture. Bake for 15 minutes, or until golden brown. Run a knife around the tots to loosen as soon as you get them out of the oven. Let cool for a minute to allow them to set up, then remove them from the muffin pan."]}, {"id": "KoRu", "title": "‘Casabe’ – Crispy Cassava Bread (GF, Paleo, AIP)", "image": "https://images.yumprint.com/p1yumprint4x/4xyuv4jbe_WsepPgp-JcAs-49vkWSqReUvlrXYVKucd7LOJqPnKoM12wveqgIa5T", "link": "http://www.littlebitesofbeauty.com/casabe-crispy-cassava-bread-aip/?fbclid=IwAR2V1lVz_fUXxWHO5ipVWW-rnrnv8775zYXXcHEwHshRKOMWX_zR97-MDXo#1465215056538-ec69775e-02ecb74d-d1621fd3-53a5e860-00a7", "ingredients": ["1.2 kg (42.3 oz) Fresh Cassava or Yucca, peeled and washed", "1 tsp dried Italian Herbs", "¼ tsp Himalayan Salt", "2 tbsp Coconut Milk", "Himalayan Salt, to taste"], "directions": ["Grate all the cassava with a fine grater (this is the annoying part of the procedure you can ask a man to do for you).", "Using a nut milk bag, squeeze the grated cassava until you extract as much liquid as possible.", "At this point, you can either decide to mix in the extras or not (I like to add them for a savorier bread).", "Spread the grated cassava on a flat plate (you might need more than one) and leave in the refrigerator for at least 4 hours (this will remove leftover humidity).", "Mix and break clumps with your hands every hour or so, until you get a grated parmesan like consistency.", "Heat up a small cast iron skillet (you can lightly coat it with extra virgin olive oil if you want).", "Make sure all clumps are broken down, and spread a thin layer of grated cassava over it (about 4 tbsp).", "Cook for about 2 minutes or so (or until you are sure the crispy bread sticks together) just like you would do with a pancake, then flip the cassava bread and cook it for another couple of minutes, or until both sides are light golden.", "When the Casabe is firm it means it’s ready to be removed from the skillet (if it’s bendy, it means not all water has evaporated yet, so you need to cook it a bit longer).", "Follow this procedure until you run out of grated cassava and you have about 10 discs of delicious crispy cassava bread!"]}, {"id": "v4rV", "title": "‘Hummoli’ Dip", "image": "https://images.yumprint.com/p1yumprint1w/1W0nr7JLSLW608AVpUGOKuLPFhJ67ZFYuUd4FxBobJI6_iElthtyPqHlvTn6eA8m", "link": "http://www.healthy-holistic-living.com/guacamole-and-hummus.html", "ingredients": ["1 cup of cooked and cooled (or jarred) organic chick peas", "1 organic lemon, juiced", "As much or as little organic cilantro as you like (I usually use about a small handful)", "2 teaspoons of organic extra virgin olive oil", "½ of an organic avocado", "Pink Himalayan salt and pepper to taste"], "directions": ["Now you can prepare this dip one of two ways. If you want a more smooth and creamy consistency you can chuck everything in a blender for about a minute until everything is combined. Or you could do what I do, for a more textured snack.", "When I’m eating something I like to know what’s in it, so that’s why more often I skip blending and prepare the dip by hand. I put all of the ingredients, except the cilantro, in a mixing bowl and mashed it all together with a fork, but you can use whatever you prefer. Once everything is to the consistency I like, I put most of the cilantro in and fork it through. Then I put however much I want into a small bowl and top it with the rest of the cilantro."]}]}